Repository: Ari-Ramkilowan/po-files
Catalog: translations/Assistant(Release (open))_Zulu.po
Languages: zul

source: Here’s each step of the daily programme with a suggested time limit: • Greeting time (10 minutes) • Message-board time (10 minutes) • Small-group time (15-20 minutes) • Planning time (10 minutes) • Playtime (60 minutes) • Cleanup time (10 minutes) • Recall time (10 minutes) • Big-group time (15 minutes) • Story time (10 minutes)
zul: Nasi isinyathelo ngasinye sohlelo lwansuku zonke nesikhathi esiphakanyisiwe esiwumkhawulo: • Isikhathi sokubingelela (imizuzu eyi-10) • Isikhathi sebhodi lemiyalezo (imizuzu eyi-10) • Isikhathi seqembu elincane (imizuzu eyi-15-20) • Isikhathi sokuhlela (imizuzu eyi-10) • Isikhathi sokudlala (imizuzu engama-60) • Isikhathi sokuqoqa (imizuzu eyi-10) • Isikhathi sokubuyekeza (imizuzu eyi-10) • Isikhathi seqembu elikhulu (imizuzu eyi-15) • Isikhathi sendaba (imizuzu eyi-10)

source: SmartStart has a clear 3-hour routine designed to help your children learn lots of new and exciting skills and concepts. 🌞
zul: I-SmartStart inenqubo yamahora ama-3 ecacile eyenzelwe ukusiza izingane zakho zifunde amakhono amaningi amasha kanye nemiqondo. 🌞

source: 👋🏾 Greeting time (10 mins)
zul: 👋🏾 Isikhathi sokubingelela (imizuzu eyi-10)

source: See next step
zul: Buka isinyathelo esilandelayo

source: 📝 Planning time (10 min)
zul: 📝 Isikhathi sokuhlela (imizuzu eyi-10)

source: 🧒🏾 Play time (60 min)
zul: 🧒🏾 Isikhathi sokudlala (imizuzu engama-60)

source: 🧠 Recall time (10 mins)
zul: 🧠 Isikhathi sokubuyekeza (imizuzu eyi-10)

source: 👩‍👧‍👦 Large group time (15 min)
zul: 👩‍👧‍👦 Isikhathi seqembu elikhulu (imizuzu eyi-15)

source: 📖 Story time (20 min)
zul: 📖 Isikhathi sendaba (imizuzu eyi-20)

source: Once everyone is there, gather around the message board to start the day. 💬 Use the message board to share news about that day and what they will be doing by pointing to the symbols and talking to the children.
zul: Uma wonke umuntu esefikile, qoqanani nizungeze ibhodi lemiyalezo ukuze niqale usuku. 💬 Sebenzisa ibhodi lemiyalezo ukuze uxoxe izindaba zosuku nalokho abazobe bekwenza ngokukhomba izimpawu nokukhuluma nezingane.

source: See activity ideas
zul: Buka imibono yokwenziwayo

source: ✨ Clean up time (10 min)
zul: ✨ Isikhathi sokuqoqa (imizuzu eyi-10)

source: 👩‍👧 Small-group time (15 min)
zul: 👩‍👧 Isikhathi seqembu elincane (imizuzu eyi-15-20)

source: This is where children break into smaller groups to learn new skills. 👫 First show the whole group what to do, then put them in groups. While the kids are busy, go around to each group to help, ask questions and use the activity to teach them something. I have lots of daily small-group activity ideas for you, if you ever need some inspiration. You can find them in the menu.
zul: Lapha yilapho izingane zihlukana ngamaqembu amancane ukuze zifunde amakhono amasha. 👫 Qala ukhombise iqembu lonke okufanele likwenze, bese ubahlukanisa ngamaqembu. Ngenkathi izingane zimatasa, hamba uye eqenjini ngalinye ukuze usize, buza imibuzo futhi usebenzise umsebenzi lo ukubafundisa okuthile. Nginemibono eminingi yansuku zonke yemisebenzi yamaqembu amancane, uma kwenzeka udinga ukugqugquzeleka. Ungayithola kumenyu.

source: *groan*☹ No one likes to clean up, but it’s important the kids learn the habit of tidying up after themselves, but also to learn about organization and order. So when playtime is over everyone must help pack up the toys and tidy their area before the next activity can start.
zul: *Bubula*☹ Akekho umuntu othanda ukuqoqa, kodwa kubalulekile ukuba izingane zijwayele ukuqoqa uma zingcolisile, futhi zifunde ngokuhleleka. Ngakho uma isikhathi sokudlala sesiphelile, wonke umuntu kufanele apakishe amathoyizi futhi aqoqe indawo yakhe ngaphambi kokuba kuqale umsebenzi olandelayo.

source: Playing is very important for a child’s development, plus they just love it. This time let’s them play freely, choosing their own games and toys from the interest areas. Use this time to ask questions, help them make friends, get them to try new things, and join in the game. Make sure you have put out lots of resources that children can reach and use to play with.
zul: Ukudlala kubalulekile kakhulu ekuthuthukeni kwengane, kanti futhi-ke ziyakuthanda kakhulu. Lesi sikhathi ziyeke izingane zidlale ngokukhululeka, zizikhethele imidlalo yazo namathoyizi endaweni ezinentshisekelo kuzo. Sebenzisa lesi sikhathi ukubuza imibuzo, zizcele zithole abangani, zitshele zizame izinto ezintsha, futhi zijoyine umdlalo. Qinisekisa ukuthi ubeke izinsiza eziningi izingane ezizokwazi ukufinyelela kuzo zizisebenzise lapho zidlala.

source: Explain steps
zul: Chaza izinyathelo

source: 💬 Message-board time (10 min)
zul: 💬 Isikhathi sebhodi lemiyalezo (imizuzu eyi-10)

source: After everything is packed away, bring the children together and ask them about what they did during play time. Ask a few children to share what they did. Show interest and involve other children.
zul: Emva kokuba konke sekupakishiwe, qoqa izingane ndawonye uzibuze ngezikwenzile ngesikhathi sokudlala. Cela izingane ezimbalwa zixoxe ngezikwenzile. Khombisa intshisekelo futhi ubandakanye ezinye izingane.

source: Say hello to all children when they arrive, and help them find a friend or something to do while the other children arrive.
zul: Bingelela izingane zonke lapho zifika, futhi uzisize zithole umngani noma okuthile ezingakwenza ngenkathi ezinye izingane zifika.

source: This is a fun time for all to get together to play games, act out stories, play music, do exercise, sing songs or dance. You can repeat these activities more often than the small-group ones, especially if there’s a game the children enjoy. But just to keep things fresh I have some activity ideas for you in the menu.
zul: Lesi yisikhathi sentokozo sokuba bonke bahlangane badlale imidlalo, balingise izindaba, badlale umculo, bazivocavoce, bacule amaculo noma badanse. Ungaphinda le misebenzi kaningi kunale yamaqembu amancane, ikakhulukazi uma kunomdlalo izingane eziwuthokozelayo. Kodwa ukugcina izinto zihlabahlosile nginemibono yokungenziwa kumenyu.

source: This is where give each child a chance to talk about what they are going to do in their play time. It lets them decide how they spend the next hour, share ideas and feel included. Use props to help them talk about their plans.
zul: Lapha kulapho unikeza ingane ngayinye ithuba lokukhuluma ngalokho ezokwenza ngesikhathi sayo sokudlala. Kuyisiza ikwazi ukunquma ukuthi izochitha kanjani ihora elilandelayo, ukwabelana ngemibono nokuzizwa ibandakanyekile. Sebenzisa ama-prop ukuyisiza ikwazi ukuxoxa ngezinhlelo zayo.

source: I hope this helped you plan your day. You can come back anytime to go over the steps again. Would you like to see those activity ideas or go back to the main menu.
zul: Ngethemba lokhu kukusizile wahlela usuku lwakho. Ungabuya noma ngasiphi isikhathi uphinde ulandele lezi zinyathelo futhi. Ungathanda ukubona leyo mibono yokungenziwa noma ubuyele Kumenyu eyinhloko.

source: SmartStart has a clear 3-hour routine designed to help you children learn lots of new and exciting skills and concepts. 🌞
zul: I-SmartStart inenqubo yamahora ama-3 ecacile eyenzelwe ukusiza izingane zakho zifunde amakhono amaningi amasha kanye nemiqondo. 🌞

source: Once everyone is there, gather around the message board to start the day. 💬 use the message board to share news about that day and what they will be doing by pointing to the symbols and talking to the children.
zul: Uma wonke umuntu esefikile, qoqanani nizungeze ibhodi lemiyalezo ukuze niqale usuku. 💬 Sebenzisa ibhodi lemiyalezo ukuze uxoxe izindaba zosuku nalokho abazobe bekwenza ngokukhomba izimpawu nokukhuluma nezingane.

source: Go to main menu
zul: Buyela kumenyu eyinhloko

source: Go back to menu
zul: Buyela kumenyu

source: Here’s each step of the daily programme with a suggested time limit: • Greeting time (10 minutes) • Message-board time (10 minutes) • Small-group time (15-20 minutes) • Planning time (10 minutes) • Playtime (60 minutes) • Cleanup time (10 minutes) • Recall time (10 minutes) • Big-group time (15 minutes) • Story time (10 minutes)
zul: Nasi isinyathelo ngasinye sohlelo lwansuku zonke nesikhathi esiphakanyisiwe esiwumkhawulo: • Isikhathi sokubingelela (imizuzu eyi-10) • Isikhathi sebhodi lemiyalezo (imizuzu eyi-10) • Isikhathi seqembu elincane (imizuzu eyi-15-20) • Isikhathi sokuhlela (imizuzu eyi-10) • Isikhathi sokudlala (imizuzu engama-60) • Isikhathi sokuqoqa (imizuzu eyi-10) • Isikhathi sokubuyekeza (imizuzu eyi-10) • Isikhathi seqembu elikhulu (imizuzu eyi-15) • Isikhathi sendaba (imizuzu eyi-10)

source: Do you want me to explain the programme steps more, see some activity ideas, or go back to the menu?
zul: Ungathanda ngichaze kabanzi izinyathelo zohlelo, buka imibono yokwenziwayo, noma Buyela kumenyu?

source: This is normally the last step of the day. After all the excitement of the day it’s nice to sit down together and hear a story. You can read it or tell it, make faces, do voices and ask the children questions about the story. 🎭 Stories develop language skills as well as get the children thinking, imagining and concentrating.
zul: Lesi ngokuvamile yisinyathelo sokugcina sosuku. Emva kwayo yonke injabulo yosuku, kumnandi ukuhlala phansi uzwe indaba. Ungayifunda noma uyixoxe, ulinganise ngobuso, ulinganise ngephimbo, futhi ubuze izingane imibuzo mayelana nendaba. 🎭 Izindaba zithuthukisa amakhono olimi nokwenza izingane zicabange, zisabalale ngengqondo futhi zigxilise ingzondo.
