Repository: Ari-Ramkilowan/po-files
Catalog: translations/Assistant(Release (open))_Southern Sotho.po
Languages: sot

source: Here’s each step of the daily programme with a suggested time limit: • Greeting time (10 minutes) • Message-board time (10 minutes) • Small-group time (15-20 minutes) • Planning time (10 minutes) • Playtime (60 minutes) • Cleanup time (10 minutes) • Recall time (10 minutes) • Big-group time (15 minutes) • Story time (10 minutes)
sot: Mohato ka mong ke ona wa lenaneo la letsatsi le letsatsi le nang le tlhahiso ya nako e lekantsweng: • Nako ya tumediso (metsotso e10) • Nako ya letlapa la melaetsa (metsotso e 10) • Nako ya dihlotshwana (metsotso e15-20) • Nako ya ho rera (metsotso e 10) • Nako ya ho bapala (metsotso e 60) • Nako ya ho hlwekisa (metsotso e 10) • Nako ya ho hopola (metsotso e 10) • Nako ya sehlopha se seholo(metsotso e15) • Nako ya pale (metsotso e10)

source: SmartStart has a clear 3-hour routine designed to help your children learn lots of new and exciting skills and concepts. 🌞
sot: SmartStart e na le tlhophiso e hlakileng ya dihora tse 3 e raletsweng ho thusa bana ba hao ho ithuta bokgoni bo botjha le bo thabisang le dintlha tse ntjha tse ngata. 🌞

source: 👋🏾 Greeting time (10 mins)
sot: 👋🏾 Nako ya tumediso (metsotso e10)

source: See next step
sot: Sheba mohato o latelang

source: 📝 Planning time (10 min)
sot: 📝 Nako ya ho rera (mets e 10)

source: 🧒🏾 Play time (60 min)
sot: 🧒🏾 Nako ya ho bapala (mets e 60)

source: 🧠 Recall time (10 mins)
sot: 🧠 Nako ya ho hopola (mets e 10)

source: 👩‍👧‍👦 Large group time (15 min)
sot: 👩‍👧‍👦 Nako ya Sehlopha se seholo (mets e 15)

source: 📖 Story time (20 min)
sot: 📖 Nako ya pale (mets e 20)

source: Once everyone is there, gather around the message board to start the day. 💬 Use the message board to share news about that day and what they will be doing by pointing to the symbols and talking to the children.
sot: Hang ha bohle ba fihlile, bokanang letlapeng la melaetsa ho qala letsatsi. 💬 Sebedisa letlapa la melaetsa ho abelana ka ditaba tse mabapi le letsatsi leo le dintho tseo ba tlang ho di etsa ka ho supa matshwao le ho bua le bana.

source: See activity ideas
sot: Sheba mehopolo ya diketsahalo

source: ✨ Clean up time (10 min)
sot: ✨ Nako ya ho hlwekisa (mets e 10)

source: 👩‍👧 Small-group time (15 min)
sot: 👩‍👧 Nako ya dihlotshwana (mets e 15)

source: This is where children break into smaller groups to learn new skills. 👫 First show the whole group what to do, then put them in groups. While the kids are busy, go around to each group to help, ask questions and use the activity to teach them something. I have lots of daily small-group activity ideas for you, if you ever need some inspiration. You can find them in the menu.
sot: Mona ke moo bana ba ikarolang ka dihlotshwana ho ithuta bokgoni bo botjha. 👫 Qala ka ho bontsha sehlopha sohle seo ba lokelang ho se etsa, mme ebe o ba arola ka dihlotshwana. Ha bana ba ntse ba sebetsa, potoloha dihlotshwaneng ka bonngwe ho ya thusa, botsa dipotso mme o sebedise ketsahalo eo ho ba ruta ho hong. Ken a le mehopolo e mengata ya diketsahalo tsa kamehla tsa dihlotshwana bakeng sa hao, ha o ka hloka kgothatso e itseng. O ka e fumana ka hara menu.

source: *groan*☹ No one likes to clean up, but it’s important the kids learn the habit of tidying up after themselves, but also to learn about organization and order. So when playtime is over everyone must help pack up the toys and tidy their area before the next activity can start.
sot: *Honotha*☹ Ha ho motho ya ratang ho hlwekisa, empa ho bohlokwa hore bana ba ithute tlwaelo ya ho phutha ha ba silafaditse, empa le ho ithuta mabapi le tlhophiso le tatelano ya dintho. Kahoo ha nako ya ho bapala e fedile, bohle ba lokela ho thusa ho pakela dithoye le ho hlwekisa sebaka sa bona pele ho qala ketsahalo e latelang.

source: Playing is very important for a child’s development, plus they just love it. This time let’s them play freely, choosing their own games and toys from the interest areas. Use this time to ask questions, help them make friends, get them to try new things, and join in the game. Make sure you have put out lots of resources that children can reach and use to play with.
sot: Ho bapala ke ntho ya bohlokwa haholo bakeng sa kgolo ya ngwana, mme ba a ho rata. Nako ena e ba dumella ho bapala ka bolokolohi, ba ikgethela dipapadi tsa bona le dithoye ho tswa dibakeng tsa thahasello. Sebedisa nako ena ho botsa dipotso, ba thuse ho etsa metswalle, ere ba leke dintho tse ntjha, mme o bapala dipapadi tseo le bona. Etsa bonnete ba hore o beile disebediswa/mehlodi e mengata eo bana ba ka e fihlelang le ho e sebedisa bakeng sa ho bapala.

source: Explain steps
sot: Hlalosa mehato

source: 💬 Message-board time (10 min)
sot: 💬 Nako ya letlapa la melaetsa (metsotso e10)

source: After everything is packed away, bring the children together and ask them about what they did during play time. Ask a few children to share what they did. Show interest and involve other children.
sot: Kamora hoba tsohle di beilwe moo di dulang, bokella bana mmoho mme o ba botse mabapi le seo ba se entseng ka nako ya ho bapala. Kopa bana ba mmalwa hore ba bolele seo ba se entseng. Bontsha thahasello mme o kenyeletse le bana ba bang.

source: Say hello to all children when they arrive, and help them find a friend or something to do while the other children arrive.
sot: Dumedisa bana bohle ha ba fihla, mme o ba thuse ho fumana motswalle kapa ho hong hoo ba ka ho etsang ha bana ba bang ba sa ntse ba fihla.

source: This is a fun time for all to get together to play games, act out stories, play music, do exercise, sing songs or dance. You can repeat these activities more often than the small-group ones, especially if there’s a game the children enjoy. But just to keep things fresh I have some activity ideas for you in the menu.
sot: Ena ke nako ya monyaka bakeng sa hore bohle ba kopane mmoho ho tla bapala dipapadi, ho tshwantshisa dipale, ho bapala mmino, ho ikwetlisa, ho bina dipina kapa ho tantsha. O ka pheta diketsahalo tsena hangata ho feta tsa dihlotshwana, haholoholo ha ho na le papadi eo bana ba e ratang. Empa bakeng sa ho boloka dintho di le foreshe ke na le mehopolo ya diketsahalo bakeng sa hao ho menu.

source: This is where give each child a chance to talk about what they are going to do in their play time. It lets them decide how they spend the next hour, share ideas and feel included. Use props to help them talk about their plans.
sot: Mona ke moo o fang ngwana ka mong sebaka sa ho bua ka seo a tlang ho se etsa ka nako ya ho bapala. Sena se etsa hore ba etse qeto kamoo ba tlang ho sebedisa hora ya bona e tlang, ho abelana mehopolo le ho ikutlwa eka ke karolo ya ba bang. Sebedisa diporopo bakeng sa ho ba thusa ho bua ka merero ya bona.

source: I hope this helped you plan your day. You can come back anytime to go over the steps again. Would you like to see those activity ideas or go back to the main menu.
sot: Ke tshepa hore sena se o thusitse ho rera letsatsi la hao. O ka kgutla ka nako efe kapa efe ho sheba mehato ena hape. Na o ka rata ho sheba mehopolo eo ya diketsahalo kapa ho kgutlela morao ho menu wa sehlooho?

source: SmartStart has a clear 3-hour routine designed to help you children learn lots of new and exciting skills and concepts. 🌞
sot: SmartStart e na le tlhophiso e hlakileng ya dihora tse 3 e raletsweng ho thusa bana ba hao ho ithuta bokgoni bo botjha le bo thabisang le dintlha tse ntjha tse ngata. 🌞

source: Once everyone is there, gather around the message board to start the day. 💬 use the message board to share news about that day and what they will be doing by pointing to the symbols and talking to the children.
sot: Hang ha bohle ba fihlile, bokanang letlapeng la melaetsa ho qala letsatsi. 💬 Sebedisa letlapa la melaetsa ho abelana ka ditaba tse mabapi le letsatsi leo le dintho tseo ba tlang ho di etsa ka ho supa matshwao le ho bua le bana.

source: Go to main menu
sot: Ho ya ho menu wa sehlooho

source: Go back to menu
sot: Kgutlela ho menu

source: Here’s each step of the daily programme with a suggested time limit: • Greeting time (10 minutes) • Message-board time (10 minutes) • Small-group time (15-20 minutes) • Planning time (10 minutes) • Playtime (60 minutes) • Cleanup time (10 minutes) • Recall time (10 minutes) • Big-group time (15 minutes) • Story time (10 minutes)
sot: Mohato ka mong ke ona wa lenaneo la letsatsi le letsatsi le nang le tlhahiso ya nako e lekantsweng: • Nako ya tumediso (metsotso e10) • Nako ya letlapa la melaetsa (metsotso e 10) • Nako ya dihlotshwana (metsotso e15-20) • Nako ya ho rera (metsotso e 10) • Nako ya ho bapala (metsotso e 60) • Nako ya ho hlwekisa (metsotso e 10) • Nako ya ho hopola (metsotso e 10) • Nako ya sehlopha se seholo(metsotso e15) • Nako ya pale (metsotso e10)

source: Do you want me to explain the programme steps more, see some activity ideas, or go back to the menu?
sot: Na o batla hore ke o hlalosetse mehato ya lenaneo ho feta, sheba mehopolo ya diketsahalo, kapa o kgutlele ho menu?

source: This is normally the last step of the day. After all the excitement of the day it’s nice to sit down together and hear a story. You can read it or tell it, make faces, do voices and ask the children questions about the story. 🎭 Stories develop language skills as well as get the children thinking, imagining and concentrating.
sot: Ka tlwaelo ona ke mohato wa ho qetela wa letsatsi. Kamora menyaka yohle ya letsatsi, ho monate ho dula fatshe mmoho le ho mamela pale. O ka e bala kapa wa e pheta, o etsa dipontsho tsa sefahleho, o fetola mantswe, mme o botsa bana dipotso mabapi le pale. 🎭 Dipale di ntshetsa pele bokgoni ba puo mme di etsa hore bana ba nahane, ba inahanele le ho tsepamisa maikutlo.
