Repository: Ari-Ramkilowan/po-files
Catalog: translations/Assistant(Release (open))_Afrikaans.po
Languages: afr

source: Here’s each step of the daily programme with a suggested time limit: • Greeting time (10 minutes) • Message-board time (10 minutes) • Small-group time (15-20 minutes) • Planning time (10 minutes) • Playtime (60 minutes) • Cleanup time (10 minutes) • Recall time (10 minutes) • Big-group time (15 minutes) • Story time (10 minutes)
afr: Hier is elke stap van die daaglikse program met ’n voorgestelde tydsbeperking: • Tyd om te groet (10 minute) • Tyd vir die boodskapbord (10 minute) • Tyd vir klein groep (15-20 minute) • Tyd om te beplan (10 minute) • Tyd om te speel (60 minute) • Tyd om op te ruim (10 minute) • Tyd om te herroep (10 minute) • Tyd vir groot groep (15 minute) • Storietyd (10 minute)

source: SmartStart has a clear 3-hour routine designed to help your children learn lots of new and exciting skills and concepts. 🌞
afr: SmartStart het ’n duidelike roetine van 3-uur ontwerp om jou te help om jou kinders baie nuwe en opwindende vaardighede en begrippe te leer. 🌞

source: 👋🏾 Greeting time (10 mins)
afr: 👋🏾 Tyd om te groet (10 minute)

source: See next step
afr: Kyk na volgende stap

source: 📝 Planning time (10 min)
afr: 📝 Tyd om te beplan (10 min)

source: 🧒🏾 Play time (60 min)
afr: 🧒🏾 Speeltyd (60 min)

source: 🧠 Recall time (10 mins)
afr: 🧠 Tyd om te herroep (10 minute)

source: 👩‍👧‍👦 Large group time (15 min)
afr: 👩‍👧‍👦 ‍‍Tyd vir groot groep (15 min)

source: 📖 Story time (20 min)
afr: 📖 Storietyd (20 min)

source: Once everyone is there, gather around the message board to start the day. 💬 Use the message board to share news about that day and what they will be doing by pointing to the symbols and talking to the children.
afr: Sodra almal daar is, staan saam by die boodskapbord om die dag te begin. 💬 Gebruik die boodskapbord om nuus oor die dag te deel en hulle te vertel wat hulle sal doen deur na die simbole te wys – gesels met die kinders.

source: See activity ideas
afr: Kyk na idees vir aktiwiteite

source: ✨ Clean up time (10 min)
afr: ✨ Tyd om op te ruim (10 min)

source: 👩‍👧 Small-group time (15 min)
afr: 👩‍👧 ‍Tyd vir klein groep (15 min)

source: This is where children break into smaller groups to learn new skills. 👫 First show the whole group what to do, then put them in groups. While the kids are busy, go around to each group to help, ask questions and use the activity to teach them something. I have lots of daily small-group activity ideas for you, if you ever need some inspiration. You can find them in the menu.
afr: Dit is waar kinders in kleiner groepe verdeel om nuwe vaardighede te leer. 👫 Wys eers die hele groep wat om te doen, en verdeel hulle dan in groepe. Terwyl die kinders besig is, gaan na elke groep om te help, vra vrae en gebruik die aktiwiteit om hulle iets te leer. Ek het vir jou baie daaglikse idees vir klein groepies, sou jy ooit inspirasie nodig hê. Jy kan dit op die spyskaart vind.

source: *groan*☹ No one likes to clean up, but it’s important the kids learn the habit of tidying up after themselves, but also to learn about organization and order. So when playtime is over everyone must help pack up the toys and tidy their area before the next activity can start.
afr: *Sug*☹ Niemand hou van opruim nie, maar dis belangrik dat die kinders die gewoonte leer om op te ruim as hulle klaar gespeel het – hulle leer ook oor organisering en orde. Wanneer speeltyd verby is, moet almal dus help om die speelgoed op te pak en hul area netjies te maak voordat die volgende aktiwiteit kan begin.

source: Playing is very important for a child’s development, plus they just love it. This time let’s them play freely, choosing their own games and toys from the interest areas. Use this time to ask questions, help them make friends, get them to try new things, and join in the game. Make sure you have put out lots of resources that children can reach and use to play with.
afr: Speel is baie belangrik vir ’n kind se ontwikkeling en hulle is boonop mal daaroor. Hierdie tyd laat hulle vryelik speel en hul eie speletjies en speelgoed uit die belangstelling-area kies. Gebruik hierdie tyd om vrae te vra, hulle te help om maatjies te maak, hulle te help om nuwe dinge te probeer en aan speletjies deel te neem. Maak seker jy sit baie hulpbronne uit wat die kinders kan bykom en gebruik om mee te speel.

source: Explain steps
afr: Verduidelik stappe

source: 💬 Message-board time (10 min)
afr: 💬 Tyd vir die boodskapbord (10 min)

source: After everything is packed away, bring the children together and ask them about what they did during play time. Ask a few children to share what they did. Show interest and involve other children.
afr: Nadat alles weggepak is, bring die kinders bymekaar en vra hulle oor wat hulle tydens speeltyd gedoen het. Vra ’n paar kinders om te vertel wat hulle gedoen het. Toon belangstelling en betrek ander kinders.

source: Say hello to all children when they arrive, and help them find a friend or something to do while the other children arrive.
afr: Groet alle kinders wanneer hulle opdaag, en help hulle om ’n maatjie te vind of iets om te doen terwyl die ander kinders opdaag.

source: This is a fun time for all to get together to play games, act out stories, play music, do exercise, sing songs or dance. You can repeat these activities more often than the small-group ones, especially if there’s a game the children enjoy. But just to keep things fresh I have some activity ideas for you in the menu.
afr: Dit is ’n prettige tyd vir almal om saam speletjies te speel, stories uit te speel, musiek te speel, oefening te doen, liedjies te sing of te dans. Jy kan hierdie aktiwiteite meer dikwels as die aktiwiteit vir klein groepe herhaal, veral as daar ’n speletjie is wat die kinders geniet. Maar net om dinge nuut en opwindend te hou, het ek ’n paar aktiwiteite-idees vir jou op die spyskaart.

source: This is where give each child a chance to talk about what they are going to do in their play time. It lets them decide how they spend the next hour, share ideas and feel included. Use props to help them talk about their plans.
afr: Dit is waar jy elke kind ’n kans gee om te praat oor wat hulle in hul speeltyd gaan doen. Dit laat hulle besluit hoe hulle die volgende uur gaan bestee en idees gaan deel, en laat hulle ingesluit voel. Gebruik rekwisiete om hulle te help om oor hul planne te praat.

source: I hope this helped you plan your day. You can come back anytime to go over the steps again. Would you like to see those activity ideas or go back to the main menu.
afr: Ek hoop dit het jou gehelp om jou dag te beplan. Jy kan enige tyd terugkom om weer deur die stappe te werk. Wil jy daardie aktiwiteite-idees sien of teruggaan na die hoofspyskaart?

source: SmartStart has a clear 3-hour routine designed to help you children learn lots of new and exciting skills and concepts. 🌞
afr: SmartStart het ’n duidelike roetine van 3-uur ontwerp om jou te help om jou kinders baie nuwe en opwindende vaardighede en begrippe te leer. 🌞

source: Once everyone is there, gather around the message board to start the day. 💬 use the message board to share news about that day and what they will be doing by pointing to the symbols and talking to the children.
afr: Sodra almal daar is, staan saam by die boodskapbord om die dag te begin. 💬 Gebruik die boodskapbord om nuus oor die dag te deel en hulle te vertel wat hulle sal doen deur na die simbole te wys – gesels met die kinders.

source: Go to main menu
afr: Gaan na hoofspyskaart

source: Go back to menu
afr: Gaan terug na die spyskaart

source: Here’s each step of the daily programme with a suggested time limit: • Greeting time (10 minutes) • Message-board time (10 minutes) • Small-group time (15-20 minutes) • Planning time (10 minutes) • Playtime (60 minutes) • Cleanup time (10 minutes) • Recall time (10 minutes) • Big-group time (15 minutes) • Story time (10 minutes)
afr: Hier is elke stap van die daaglikse program met ’n voorgestelde tydsbeperking: • Tyd om te groet (10 minute) • Tyd vir die boodskapbord (10 minute) • Tyd vir klein groep (15-20 minute) • Tyd om te beplan (10 minute) • Tyd om te speel (60 minute) • Tyd om op te ruim (10 minute) • Tyd om te herroep (10 minute) • Tyd vir groot groep (15 minute) • Storietyd (10 minute)

source: Do you want me to explain the programme steps more, see some activity ideas, or go back to the menu?
afr: Wil jy hê ek moet die programstappe verder verduidelik, wil jy ’n paar idees vir aktiwiteite sien of wil jy teruggaan na die spyskaart?

source: This is normally the last step of the day. After all the excitement of the day it’s nice to sit down together and hear a story. You can read it or tell it, make faces, do voices and ask the children questions about the story. 🎭 Stories develop language skills as well as get the children thinking, imagining and concentrating.
afr: Dit is gewoonlik die laaste stap van die dag. Na al die opwinding van die dag is dit lekker om saam te gaan sit en na ’n storie te luister. Jy kan dit lees of vertel, gesigte trek, stemme gebruik, en die kinders vrae oor die storie vra. 🎭 Stories ontwikkel taalvaardighede en laat die kinders dink, hul verbeelding gebruik en konsentreer.
