Repository: Ari-Ramkilowan/po-files
Catalog: translations/Assistant(Release (open))_Pedi; Sepedi;  Northern Sotho.po
Languages: nso

source: Here’s each step of the daily programme with a suggested time limit: • Greeting time (10 minutes) • Message-board time (10 minutes) • Small-group time (15-20 minutes) • Planning time (10 minutes) • Playtime (60 minutes) • Cleanup time (10 minutes) • Recall time (10 minutes) • Big-group time (15 minutes) • Story time (10 minutes)
nso: Mo go latela kgato ka kgato ya lenaneo la tšatši ka tšatši leo le nago le nako ye e šišinywago: • Nako ya go dumediša (metsotso ye 10) • Nako ya molaetša wa letlapeng (metsotso ye 10) • Nako ya sehlopha se sennyane (metsotso ye 15-20) • Nako ya peakanyo (metsotso ye 10) • Nako ya go raloka (metsotso ye 60) • Nako ya go hlwekiša (metsotso ye 10) • Nako ya go gopodišiša (metsotso ye 10) • Nako ya sehlopha se segolo (metsotso ye 15) • Nako ya kanegelo (metsotso ye 10)

source: SmartStart has a clear 3-hour routine designed to help your children learn lots of new and exciting skills and concepts. 🌞
nso: SmartStart e na le mediro ya diiri tše 3 ye e hlametšwego go thuša bana ba gago go ithuta mabokgoni le mareo a mantši le ao a thabišago. 🌞

source: 👋🏾 Greeting time (10 mins)
nso: 👋🏾 Nako ya go dumediša (metsotso ye 10)

source: See next step
nso: Lebelela kgato ye e latelago

source: 📝 Planning time (10 min)
nso: 📝 Nako ya go beakanya (metsotso ye 10)

source: 🧒🏾 Play time (60 min)
nso: 🧒🏾 Nako ya go raloka (metsotso ye 60)

source: 🧠 Recall time (10 mins)
nso: 🧠 Nako ya go gopodišiša (metsotso ye 10)

source: 👩‍👧‍👦 Large group time (15 min)
nso: 👩‍👧‍👦 Nako ya sehlopha se segolo (metsotso ye 15)

source: 📖 Story time (20 min)
nso: 📖 Nako ya kanegelo (metsotso ye 20)

source: Once everyone is there, gather around the message board to start the day. 💬 Use the message board to share news about that day and what they will be doing by pointing to the symbols and talking to the children.
nso: Morago ga gore ba be moo ka moka, rarelang letlapa la go ngwalela molaetša go thomiša ka letšatši. 💬 Somiša letlapa la go ngwalela melaetša go abelana ka ditaba mabapi le letšatši le gore ba tla be ba dira eng ka go šupa godimo ga maswao le go bolela le bana.

source: See activity ideas
nso: Bona dikgopolo tša mošomo

source: ✨ Clean up time (10 min)
nso: ✨ Nako ya go hlwekiša (metsotso ye 10)

source: 👩‍👧 Small-group time (15 min)
nso: 👩‍👧 Nako ya dihlopha tše nnyane (metsotso ye 15)

source: This is where children break into smaller groups to learn new skills. 👫 First show the whole group what to do, then put them in groups. While the kids are busy, go around to each group to help, ask questions and use the activity to teach them something. I have lots of daily small-group activity ideas for you, if you ever need some inspiration. You can find them in the menu.
nso: Moo ke moo bana bana ba itlhophago ka dihlopha tše nnyane go ithuta bokgoni bjo bofsa. 👫 Sa pele bontšha sehlopha ka botlalo seo se swanetšego go dirwa, gomme o ba bee ka dihlopha. Ge digotlane di tsene fase, sepelasepela le dihlopha ka moka go thuša, botšiša dipotšišo le go šomiša mošomo go ba ruta se sengwe. Ke na le dikgopolo tše ntši tša dihlopha tše nnyane, ge e le gore o nyaka tlhohleletšo. O ka di hwetša ka gare ga menyu.

source: *groan*☹ No one likes to clean up, but it’s important the kids learn the habit of tidying up after themselves, but also to learn about organization and order. So when playtime is over everyone must help pack up the toys and tidy their area before the next activity can start.
nso: *Go gwaba*☹ Ga go na yo a ratago go hlwekiša, eupša go bohlokwa gore digotlane di ithute setlwaedi sa go itlhwekiša, le go ithuta mabapi le tša peakanyo le bothakga. Ge nako ya meraloko e fedile, bana ka moka ba swanetše go thuša go phutha dibapadišwa le go hlwekiša lefelo la bona pele go ka thomišwa ka mošomo wo o latelago.

source: Playing is very important for a child’s development, plus they just love it. This time let’s them play freely, choosing their own games and toys from the interest areas. Use this time to ask questions, help them make friends, get them to try new things, and join in the game. Make sure you have put out lots of resources that children can reach and use to play with.
nso: Go raloka go bohlokwa kudu go kgolo ya ngwana yo mongwe le yo mongwe, ebile ba go rata kudu. Mo nakong ye ba raloka ka go lokologa, ba kgetha dipapadi tša bona le dibapadišwa go tšwa mafapheng ao a kgahlišago. šomiša nako ye go botšiša dipotšišo, o ba thuše go ikhweletša bagwera, ba leke dilo tše mpsha, le go ba karolo papading. Kgonthiša gore o beile methopo ye mentši yeo bana ba ka e fihlelelago le go raloka ka yona.

source: Explain steps
nso: Hlaloša dikgato

source: 💬 Message-board time (10 min)
nso: 💬 Nako ya molaetšwa wa letlapeng (metsotso ye 10)

source: After everything is packed away, bring the children together and ask them about what they did during play time. Ask a few children to share what they did. Show interest and involve other children.
nso: Morago ga gore ba phuthe dilo ka moka, kopanya bana felo gotee o ba botšiše seo ba se dirilego nakong ya meraloko. Kgopela bana ba mmalwa go abelana ka seo ba se dirilego. Bontšha kgahlego le go akaretša bana ba bangwe.

source: Say hello to all children when they arrive, and help them find a friend or something to do while the other children arrive.
nso: Dumediša bana ka moka ge ba fihla, le go ba thuša go hwetša mogwera goba se sengwe seo ba ka se dirago ge bana ba bangwe ba fihla.

source: This is a fun time for all to get together to play games, act out stories, play music, do exercise, sing songs or dance. You can repeat these activities more often than the small-group ones, especially if there’s a game the children enjoy. But just to keep things fresh I have some activity ideas for you in the menu.
nso: Ye ka nako ya boithabišo moo bana ba kopanago ba raloka dipapadi mmogo, ba raloka ditiragatšo, ba raloka mmino, ba itšhidulla, ba opela dikoša goba go bina. O ka bušeletša mešomo ye kgafetšakgafetša go feta ge o na le dihlopha tše nnyane, gagologolo ge e le gore go na le papadi yeo bana ba ipshinago ka yona. Go tšwetša pele dilo tše bose pele, ke go swaretše dikgopolo tša mešomo ka gare ga menyu.

source: This is where give each child a chance to talk about what they are going to do in their play time. It lets them decide how they spend the next hour, share ideas and feel included. Use props to help them talk about their plans.
nso: Mo ke moo ngwana yo mongwe le yo mongwe a fiwago sebaka sa go bolela mabapi le seo ba tlilego go se dira nakong ya bona ya go raloka. E ba dumelela go tšea sephetho mabapi le ka moo ba šomišago iri ye e latelago, go abelana dikgopolo le go kwa ba sa kgethollwa. šomiša dikokwane go ba thuša go bolela ka dipeakanyo tša bona.

source: I hope this helped you plan your day. You can come back anytime to go over the steps again. Would you like to see those activity ideas or go back to the main menu.
nso: Ke tshepha gore se se go thušitše go beakanya letšatši la gago. O ka boa gape nako efe goba efe go bušeletša dikgato gape. O rata go bona dikgopolo tšeo tša mošomo goba go boela morago go menyu.

source: SmartStart has a clear 3-hour routine designed to help you children learn lots of new and exciting skills and concepts. 🌞
nso: SmartStart e na le mediro ya diiri tše 3 ye e hlametšwego go thuša bana ba gago go ithuta mabokgoni le mareo a mantši le ao a thabišago. 🌞

source: Once everyone is there, gather around the message board to start the day. 💬 use the message board to share news about that day and what they will be doing by pointing to the symbols and talking to the children.
nso: Morago ga gore ba be moo ka moka, rarelang letlapa la go ngwalela molaetša go thomiša ka letšatši. 💬 šomiša letlapa la go ngwalela melaetša go abelana ka ditaba mabapi le letšatši le gore ba tla be ba dira eng ka go šupa godimo ga maswao le go bolela le bana.

source: Go to main menu
nso: Boela morago go menyu

source: Go back to menu
nso: Boela morago go menyu

source: Here’s each step of the daily programme with a suggested time limit: • Greeting time (10 minutes) • Message-board time (10 minutes) • Small-group time (15-20 minutes) • Planning time (10 minutes) • Playtime (60 minutes) • Cleanup time (10 minutes) • Recall time (10 minutes) • Big-group time (15 minutes) • Story time (10 minutes)
nso: Mo go latela kgato ka kgato ya lenaneo la tšatši ka tšatši leo le nago le nako ye e šišinywago: • Nako ya go dumediša (metsotso ye 10) • Nako ya molaetša wa letlapeng (metsotso ye 10) • Nako ya sehlopha se sennyane (metsotso ye 15-20) • Nako ya peakanyo (metsotso ye 10) • Nako ya go raloka (metsotso ye 60) • Nako ya go hlwekiša (metsotso ye 10) • Nako ya go gopodišiša (metsotso ye 10) • Nako ya sehlopha se segolo (metsotso ye 15) • Nako ya kanegelo (metsotso ye 10)

source: Do you want me to explain the programme steps more, see some activity ideas, or go back to the menu?
nso: Naa o nyaka ke hlaloša dikgato tša lenaneo go tsenelela, bona dikgopolo tše dingwe tša mošomo, goba boela go menyu?

source: This is normally the last step of the day. After all the excitement of the day it’s nice to sit down together and hear a story. You can read it or tell it, make faces, do voices and ask the children questions about the story. 🎭 Stories develop language skills as well as get the children thinking, imagining and concentrating.
nso: Ye gantši ke kgato ya mafelelo ya letšatši. Morago ga boipshino ka moka bja letšatši, go bose go dula fase mmogo gomme le kwa kanegelo. O ka e bala goba wa e anega, wa dira difahlogo, le go botšiša bana dipotšišo mabapi le kanegelo. 🎭 Dikanegelo di hlabolla bokgoni bja polelo le gore bana ba nagane, ba akanye le go ela tlhoko.
