Repository: Ari-Ramkilowan/po-files
Catalog: translations/Assistant(Release (open))_South Ndebele.po
Languages: nbl

source: Here’s each step of the daily programme with a suggested time limit: • Greeting time (10 minutes) • Message-board time (10 minutes) • Small-group time (15-20 minutes) • Planning time (10 minutes) • Playtime (60 minutes) • Cleanup time (10 minutes) • Recall time (10 minutes) • Big-group time (15 minutes) • Story time (10 minutes)
nbl: Nali igadango lehlelo langemihla nesikhathi esiphakamisiweko: • Isikhathi sokulotjhisa (imizuzu eli -10) • Isikhathi sebhodi yomlayezo (imizuzu eli -10) • Isikhathi sesiqhema esincane (imizuzu eli -15-20) • Isikhathi sokuhlela (imizuzu eli -10) • Isikhathi sokudlala (imizuzu ema -60) • Isikhathi sokuhlwenga (imizuzu eli -10) • Isikhathi sokubuyelela (imizuzu eli - 10) • Isikhathi sesiqhema esukhulu (imizuzu eli -15) • Isikhathi seAwalwana (imizuzu eli -10)

source: SmartStart has a clear 3-hour routine designed to help your children learn lots of new and exciting skills and concepts. 🌞
nbl: I-SmartStart inerhrrho lama iri ama-3 enzelwe ukukurhelebha bona abantwana bakho bafunde amakghoAwa Awamcabango omutjha Awakarisako. 🌞

source: 👋🏾 Greeting time (10 mins)
nbl: 👋🏾 Isikhathi sokulotjhisa (imizuzu eli -10)

source: See next step
nbl: Qala igadango elilandelako

source: 📝 Planning time (10 min)
nbl: 📝 Isikhathi sokuhlela (imizuzu eli - 10)

source: 🧒🏾 Play time (60 min)
nbl: 🧒🏾 Isikhathi sokudlala (imizuzu ema - 60)

source: 🧠 Recall time (10 mins)
nbl: 🧠 Isikhathi sokubuyelela (imizuzu eli - 10)

source: 👩‍👧‍👦 Large group time (15 min)
nbl: 👩‍👧‍👦 Isikhathi sesiqhema esikhulu (imizuzu eli - 15)

source: 📖 Story time (20 min)
nbl: 📖 Isikhathi seAwalwana (imizuzu ema - 20)

source: Once everyone is there, gather around the message board to start the day. 💬 Use the message board to share news about that day and what they will be doing by pointing to the symbols and talking to the children.
nbl: Nasele bakhona boke thoma usuku ngokuthi uye nabo kubhodi yomlayezo. 💬 Sebenzisa ibhodi yomlayezo le ukwabelana iindaba zelanga Awakuthi bazokwenzani ngokukhomba amatshwayo Awakukhuluma nabantwana.

source: See activity ideas
nbl: Qala imiboAwa yeemfundo

source: ✨ Clean up time (10 min)
nbl: ✨ Isikhathi sokuhlwenga (imizuzu eli - 10)

source: 👩‍👧 Small-group time (15 min)
nbl: 👩‍👧 Isikhathi sesiqhema esincane (imizuzu eli -15)

source: This is where children break into smaller groups to learn new skills. 👫 First show the whole group what to do, then put them in groups. While the kids are busy, go around to each group to help, ask questions and use the activity to teach them something. I have lots of daily small-group activity ideas for you, if you ever need some inspiration. You can find them in the menu.
nbl: La ngilapho abantwana bahlukana ngeenqhema ezincane bazokufunda amakghoAwa amatjha. 👫 Kokuthoma batjengise baboke basiqhema sinye bona benzene bese uyabahlukanisa. Nabasebenzako khambakhamba uye esiqhemeni ngasinye ukubarhelebha, ubuze imibuzo begodu usebenzise isifundesi ukufundisa okuthile. NginemiboAwa eminengi yomsebenzi yeenqhema ezincane, nawuzitlhogako. Ungazithola erhelweni

source: *groan*☹ No one likes to clean up, but it’s important the kids learn the habit of tidying up after themselves, but also to learn about organization and order. So when playtime is over everyone must help pack up the toys and tidy their area before the next activity can start.
nbl: *Balisa*☹ Akakho othanda ukubhlwenga, kodwana kuqakathekile ukuthi abantwana bajwayele ukubutha ngemva kwabo, bafunde Awakuhlela. Ye – ke isikhathi sokudlala nasiphelile, kufuze bona woke umntwana abuthe amathoyisi begogu abuthe nendawo gade alalela kiyo ngaphambi kokuthoma isifundo esilandelako.

source: Playing is very important for a child’s development, plus they just love it. This time let’s them play freely, choosing their own games and toys from the interest areas. Use this time to ask questions, help them make friends, get them to try new things, and join in the game. Make sure you have put out lots of resources that children can reach and use to play with.
nbl: Ukudlala kuqakatheke khulu ekukhuleni komntwana, kanti ke bayakuthanda. Ngalesisikhathi masidlale ngokukhululeka, bazikhethele imidlalo namathoyisi abawathandako. Sebenzisa isikhathesi ukubuza imibuzo, barhelebhe benze abangani, wenze benze nezinto ezitja. Qinisekisa bona unazo iintlabageloabangazithola msinya begodu bakwazi ukudlala.

source: Explain steps
nbl: Hlathulula amagadango

source: 💬 Message-board time (10 min)
nbl: 💬 Isikhathi sebhodi yomlayezo (imizuzu eli -10)

source: After everything is packed away, bring the children together and ask them about what they did during play time. Ask a few children to share what they did. Show interest and involve other children.
nbl: Nasele bapsuse yoke into babuze ukuthi gade benzani ngesikhathi sokudlala. Bawa abambalwa bona batjho ukuthi benzene. Tjengisa ikareko begodu ubabandakanye.

source: Say hello to all children when they arrive, and help them find a friend or something to do while the other children arrive.
nbl: Lotjhisa boke abantwana nabafikako, ubarhelebhe ukuthula umngani Awama ukwenza okuthile abanye nabasafikako.

source: This is a fun time for all to get together to play games, act out stories, play music, do exercise, sing songs or dance. You can repeat these activities more often than the small-group ones, especially if there’s a game the children enjoy. But just to keep things fresh I have some activity ideas for you in the menu.
nbl: Lesi sikhathi esimnandi sokuthi badlale boke ndawonye imidlalo, balingise, balalele umculo, bazithabulule, bacule bebajide. Ungabuyelela imisebenzi le ukudlula yeenqhema ezincane, khulukhulu nange kuAwamdlalo abawuthandako. Kodwana qinisekisa ukuthi kutjha ngombana nginemiboAwa eminye erhelweni.

source: This is where give each child a chance to talk about what they are going to do in their play time. It lets them decide how they spend the next hour, share ideas and feel included. Use props to help them talk about their plans.
nbl: La kulapho unikela khona woke umntwana ithuba lokkhuluma ngalokhu abazokwenza ngesikhathi sabo sokudlala. Kubenza bakhethe ukuthi i-iri elilandelako bazakulichitha bunjani, babelane imiboAwa bazizwe babandakanyeka. Sebenzisa izinsiza ukurhelebha ukukhuluma ngamahlelo wabo.

source: I hope this helped you plan your day. You can come back anytime to go over the steps again. Would you like to see those activity ideas or go back to the main menu.
nbl: Ngithemba ukuthi lokhu kukwazile ukukurhelebha ukuhlela ilanga lakho.Ungabuya Awama yinini ubuyelele amagadango la godu. Ungathanda ukuqala leyo miboAwa Awama ubuyele erhelweni?

source: SmartStart has a clear 3-hour routine designed to help you children learn lots of new and exciting skills and concepts. 🌞
nbl: I-SmartStart inerhrrho lama iri ama-3 enzelwe ukukurhelebha bona abantwana bakho bafunde amakghoAwa Awamcabango omutjha Awakarisako. 🌞

source: Once everyone is there, gather around the message board to start the day. 💬 use the message board to share news about that day and what they will be doing by pointing to the symbols and talking to the children.
nbl: Nasele bakhona boke thoma usuku ngokuthi uye nabo kubhodi yomlayezo. 💬 Sebenzisa ibhodi yomlayezo le ukwabelana iindaba zelanga Awakuthi bazokwenzani ngokukhomba amatshwayo Awakukhuluma nabantwana.

source: Go to main menu
nbl: Buyela erhelweni

source: Go back to menu
nbl: Buyela erhelweni

source: Here’s each step of the daily programme with a suggested time limit: • Greeting time (10 minutes) • Message-board time (10 minutes) • Small-group time (15-20 minutes) • Planning time (10 minutes) • Playtime (60 minutes) • Cleanup time (10 minutes) • Recall time (10 minutes) • Big-group time (15 minutes) • Story time (10 minutes)
nbl: Nali igadango lehlelo langemihla nesikhathi esiphakamisiweko: • Isikhathi sokulotjhisa (imizuzu eli -10) • Isikhathi sebhodi yomlayezo (imizuzu eli -10) • Isikhathi sesiqhema esincane (imizuzu eli -15-20) • Isikhathi sokuhlela (imizuzu eli -10) • Isikhathi sokudlala (imizuzu ema -60) • Isikhathi sokuhlwenga (imizuzu eli -10) • Isikhathi sokubuyelela (imizuzu eli - 10) • Isikhathi sesiqhema esukhulu (imizuzu eli -15) • Isikhathi seAwalwana (imizuzu eli -10)

source: Do you want me to explain the programme steps more, see some activity ideas, or go back to the menu?
nbl: Ufuna ngihlathulule amagadango la ngokuzeleko, qala eminye imiboAwa yeemfundo Awama Buyela erhelweni?

source: This is normally the last step of the day. After all the excitement of the day it’s nice to sit down together and hear a story. You can read it or tell it, make faces, do voices and ask the children questions about the story. 🎭 Stories develop language skills as well as get the children thinking, imagining and concentrating.
nbl: Kanengi leli ligadango lokugcina lelanga. Nasele bathabile, kuhle bona bahlale phasi balalele iAwalwana. Ungabafundela Awama ubacocele yona, wenze ubuso, iphimbo bese ubuza abantwana imibuzo. 🎭 IiAwalwana zithuthukisa amakghoAwa welimi, zenza abantwana bacabange, babone begodu balalelisise.
