Repository: Ari-Ramkilowan/po-files
Catalog: translations/Assistant(Release (open))_Tsonga.po
Languages: tso

source: Here’s each step of the daily programme with a suggested time limit: • Greeting time (10 minutes) • Message-board time (10 minutes) • Small-group time (15-20 minutes) • Planning time (10 minutes) • Playtime (60 minutes) • Cleanup time (10 minutes) • Recall time (10 minutes) • Big-group time (15 minutes) • Story time (10 minutes)
tso: Hi leri goza rin’wana na rin’wana ra nongonoko wa siku na siku na mpimo wa nkarhi lowu ringanyetiweke: • Nkarhi wo xeweta (10 ra timinete) • Nkarhi wa bodo ya mahungu (10 ra timinete) • Nkarhi wa ntlawa lowuntsobgo (15-20 wa timinete) • Nkarhi wo kunguhata (10 ra timinete) • Nkarhi wo tlanga (60 wa timinete) • Nkarhi wo basisa (10 ra timinete) • Nkarhi wo tsundzuka (10 ra timinete) • Nkarhi wa ntlawa lowukulu (15 wa timinete) • Nkarhi wa xitori (10 ra timinete)

source: SmartStart has a clear 3-hour routine designed to help your children learn lots of new and exciting skills and concepts. 🌞
tso: Ku Sungula hi Vutlhari swi na swilo leswi nga erivaleni leswi endliwaka masiku hinkwawo ku ringana tiawara ti 3 leswi endleriweke ku pfuna vana va wena ku dyondza swikili swintshwa swo nyanyula na tikhonsepe. 🌞

source: 👋🏾 Greeting time (10 mins)
tso: 👋🏾 Nkarhi wo xeweta (10 ra timinete)

source: See next step
tso: Vona goza leri landzelaka

source: 📝 Planning time (10 min)
tso: 📝 Nkarhi wo kunguhata (10 ra timinete)

source: 🧒🏾 Play time (60 min)
tso: 🧒🏾 Nkarhi wo tlanga (60 wa timinete)

source: 🧠 Recall time (10 mins)
tso: 🧠 Nkarhi wo Tsundzuka (10 ra timinete)

source: 👩‍👧‍👦 Large group time (15 min)
tso: 👩‍👧‍👦 Nkarhi wa ntlawa lowukulu (15 wa timinete)

source: 📖 Story time (20 min)
tso: 📖 Nkarhi wa xitori (20 wa timinete)

source: Once everyone is there, gather around the message board to start the day. 💬 Use the message board to share news about that day and what they will be doing by pointing to the symbols and talking to the children.
tso: Loko hikwavo va fikile, hlengeletanani ku rhendzeleka na bodo ya mahungu ku sungula siku. 💬 Tirhisani bodo ya mahungu ku avelana mahungu hi siku na leswi va nga ta swi endla hi ku komba mimfungho na ku vulavula na vana.

source: See activity ideas
tso: Vona mianakanyo ya nghingiriko

source: ✨ Clean up time (10 min)
tso: ✨ Nkarhi wo basisa (10 ra timinete)

source: 👩‍👧 Small-group time (15 min)
tso: 👩‍👧 nkarhi wa ntlawa lowuntsongo (15 wa timinete)

source: This is where children break into smaller groups to learn new skills. 👫 First show the whole group what to do, then put them in groups. While the kids are busy, go around to each group to help, ask questions and use the activity to teach them something. I have lots of daily small-group activity ideas for you, if you ever need some inspiration. You can find them in the menu.
tso: Laha hi laha vana va aviwaka hi mintlawa leyintsongo ku va va dyondza swikili leswintshwa. 👫 Sungula hi ku komba ntlawa hinkwawo leswi faneleke ku endliwa, kutani u veka hi mintlawa. Loko van va ri bizi, rhendzeleka na mintlawa hinkwayo ku va pfuna, vutisa swivutisa na ku tirhisa nghingiriko ku va dyondzisa swo karhi. Ndzi ku khomele mianakanyo yo tala ya nghingiriko wa siku na siku wa ntlawa lowuntsongo, loko u lava nhlohlotelo wo nkarhi. U nga yi kuma eka menyu.

source: *groan*☹ No one likes to clean up, but it’s important the kids learn the habit of tidying up after themselves, but also to learn about organization and order. So when playtime is over everyone must help pack up the toys and tidy their area before the next activity can start.
tso: *Konya*☹ Ku hava loyi a tsakelaka ku basisa, kambe swi na nkoka leswaku vana va dyondza ntolovelo wo basisa loko va heta ku tirhisa ndhawu, na ku dyondza hi lulamisa swilo swa vona na ku va na oda. Loko nkarhi wo tlanga wu herile, munhu un’wana na un’wana u fanele ku pfuneta ku paka tithoyi na ku basisa ndhawu ya yena loko nghingiriko lowu landzelaka wu nga se sungula.

source: Playing is very important for a child’s development, plus they just love it. This time let’s them play freely, choosing their own games and toys from the interest areas. Use this time to ask questions, help them make friends, get them to try new things, and join in the game. Make sure you have put out lots of resources that children can reach and use to play with.
tso: Ku tlanga swi na nkoka eka ku kula ka n’wana, naswona va swi rhandza. Sweswi endla leswaku va tlanga va ntshuxekile, va hlawula mitlangu ya vona vini na tithoyi ku suka eka swivandla leswi va swi tsakelaka. Tirhisa nkarhi lowu ku vutisa swivutiso, va pfuni ku kuma vanghana, endla leswaku va ringeta swilo swintshwa, na ku joyina ntlangu. Vona leswaku u veketele switirhisiwa swo tala leswi vana va nga swi fikelelaka na ku tlanga hi swona.

source: Explain steps
tso: Hlamusela magoza

source: 💬 Message-board time (10 min)
tso: 💬 Nkarhi wa bodo ya mahungu (10 ra timinete)

source: After everything is packed away, bring the children together and ask them about what they did during play time. Ask a few children to share what they did. Show interest and involve other children.
tso: Loko hinkwaswo swi pakiwile swi vekiwile, hlanganisa vana na ku va vutisa hi leswi va nga swi endla hi nkarhi wo tlanga. Byela vana va nga ri vangani ku avelana leswi va nga swi endla. Komba ntsakelo na ku nghenelerisa vana lavan’wana.

source: Say hello to all children when they arrive, and help them find a friend or something to do while the other children arrive.
tso: U nge halo eka vana hinkwavo loko va fika na ku va pfuna ku kuma munghana kumbe swo karhi swo swi endla loko vana lavan’wana va fika.

source: This is a fun time for all to get together to play games, act out stories, play music, do exercise, sing songs or dance. You can repeat these activities more often than the small-group ones, especially if there’s a game the children enjoy. But just to keep things fresh I have some activity ideas for you in the menu.
tso: Lowu i nkarhi wo tiphina wo va hinkwavo va vuya ndhawu yin’we va tlanga mintlangu, va tlanga switori, va tlangisa vuyimbelri, va endla vutiolori, va yimbelela tinsimu kumbe va cina. U nga vuyelela mingingiriko leyi ko tala ku hundza leya mitlawa leyintsongo, ngopfu loko ku ri na ntlangu lowu vana va wu tsakelaka. Ku endlela leswaku swilo swi nga rivariwi, ndzi ku khomele mianakanyo ya migingiriko yo karhi eka menyu.

source: This is where give each child a chance to talk about what they are going to do in their play time. It lets them decide how they spend the next hour, share ideas and feel included. Use props to help them talk about their plans.
tso: Laha hi laha u nyikaka n’wana un’wana na un’wana nkarhi wo vulavula hi leswi a nga ta swi endla hi nkarhi wa yena wo tlanga. Swi endla leswaku va teka xiboho xa leswaku awara leyi landzelaka va ta yi tirhisisa ku yini, ku avelana mianakanyo na ku titwa a katsiwa eka ntlawa. Tirhisa swiseketelo ku va pfuna ku vulavula hi makungu ya vona.

source: I hope this helped you plan your day. You can come back anytime to go over the steps again. Would you like to see those activity ideas or go back to the main menu.
tso: Ndza tshemba leswi swi ku pfune ku pulana siku ra wena. U nga tlhelela endzhaku nkarhi wun’wana na wun’wana ku vuyelela magoza nakambe. Xana u nga tsakela ku vona mianakanyo leyi ya nghingiriko kumbe ku tlhela eka menyunkulu.

source: SmartStart has a clear 3-hour routine designed to help you children learn lots of new and exciting skills and concepts. 🌞
tso: Ku Sungula hi Vutlhari swi na swilo leswi nga erivaleni leswi endliwaka masiku hinkwawo ku ringana tiawara ti 3 leswi endleriweke ku pfuna vana va wena ku dyondza swikili swintshwa swo nyanyula na tikhonsepe. 🌞

source: Once everyone is there, gather around the message board to start the day. 💬 use the message board to share news about that day and what they will be doing by pointing to the symbols and talking to the children.
tso: Loko hikwavo va fikile, hlengeletanani ku rhendzeleka na bodo ya mahungu ku sungula siku. 💬 Tirhisani bodo ya mahungu ku avelana mahungu hi siku na leswi va nga ta swi endla hi ku komba mimfungho na ku vulavula na vana.

source: Go to main menu
tso: Famba eka menyunkulu

source: Go back to menu
tso: Famba eka Ku tlhelela eka menyu

source: Here’s each step of the daily programme with a suggested time limit: • Greeting time (10 minutes) • Message-board time (10 minutes) • Small-group time (15-20 minutes) • Planning time (10 minutes) • Playtime (60 minutes) • Cleanup time (10 minutes) • Recall time (10 minutes) • Big-group time (15 minutes) • Story time (10 minutes)
tso: Hi leri goza rin’wana na rin’wana ra nongonoko wa siku na siku na mpimo wa nkarhi lowu ringanyetiweke: • Nkarhi wo xeweta (10 ra timinete) • Nkarhi wa bodo ya mahungu (10 ra timinete) • Nkarhi wa ntlawa lowuntsobgo (15-20 wa timinete) • Nkarhi wo kunguhata (10 ra timinete) • Nkarhi wo tlanga (60 wa timinete) • Nkarhi wo basisa (10 ra timinete) • Nkarhi wo tsundzuka (10 ra timinete) • Nkarhi wa ntlawa lowukulu (15 wa timinete) • Nkarhi wa xitori (10 ra timinete)

source: Do you want me to explain the programme steps more, see some activity ideas, or go back to the menu?
tso: Xana u lava leswaku ndzi hlamusela magoza ya nongonoko nakambe, vona mianakanyo yin’wana ya nghingiriko, kumbe tlhelela eka menyu?

source: This is normally the last step of the day. After all the excitement of the day it’s nice to sit down together and hear a story. You can read it or tell it, make faces, do voices and ask the children questions about the story. 🎭 Stories develop language skills as well as get the children thinking, imagining and concentrating.
tso: Hi ntolovelo leri i goza ro hetelela ra siku. Endzhaku ka nyanyuko hinkwawo wa siku, swi kahe ku tshama swin’we mi twa xitori. U nga xi hlaya kumbe ku xihlamusela, ku endla swikandza, ku endla marito, na ku vutisa vana swivutiso hi xitori. 🎭 Switori swi ndlandlamuxa swikili swa ririmi na ku endla leswaku vana va ehleketa, va va na swifaniso swa le miehleketweni na ku va na vurhonwana.
