Repository: Ari-Ramkilowan/po-files
Catalog: translations/Assistant(Release (open))_Swati.po
Languages: ssw

source: Here’s each step of the daily programme with a suggested time limit: • Greeting time (10 minutes) • Message-board time (10 minutes) • Small-group time (15-20 minutes) • Planning time (10 minutes) • Playtime (60 minutes) • Cleanup time (10 minutes) • Recall time (10 minutes) • Big-group time (15 minutes) • Story time (10 minutes)
ssw: Nasi sinyatselo ngasinye saloluhlelo lwamalanga onkhe kanye nesilinganiso sesikhatsi lesiconyiwe: • Sikhatsi sekubingelela (10 lemizuzu) • Sikhatsi semlayeto lobhalwe ebhodini (10 lemizuzu) • Sikhatsi semacembu lamancane (15-20 imizuzu) • Sikhatsi sekuhlela (10 lemizuzu) • Sikhatsi sekudlala (60 imizuzu) • Sikhatsi sekuhlobisa (10 lemizuzu) • Sikhatsi sekubuyeketa (10 lemizuzu) • Sikhatsi selicembu lelikhulu (15 imizuzu) • Sikhatsi sekucoca tindzaba (10 lemizuzu)

source: SmartStart has a clear 3-hour routine designed to help your children learn lots of new and exciting skills and concepts. 🌞
ssw: I-SmartStart inendlela leyisebentisako lecacile yemahora lama-3 leyentelwe kusita bantfwana bakho kutsi bafundze tintfo letinyenti nemakhono lajabulisako kanye nemicondvo lemisha. 🌞

source: 👋🏾 Greeting time (10 mins)
ssw: 👋🏾 Sikhatsi sekubingelela (10 lemizuzu)

source: See next step
ssw: Buka sinyatselo lesilandzelako

source: 📝 Planning time (10 min)
ssw: 📝 Sikhatsi sekuhlela (10 lemizuzu)

source: 🧒🏾 Play time (60 min)
ssw: 🧒🏾 Sikhatsi sekudlala (60 imizuzu)

source: 🧠 Recall time (10 mins)
ssw: 🧠 Sikhatsi sekubuyeketa (10 lemizuzu)

source: 👩‍👧‍👦 Large group time (15 min)
ssw: 👩‍👧‍👦 Sikhatsi selicembu lelikhulu (15 imizuzu)

source: 📖 Story time (20 min)
ssw: 📖 Sikhatsi sekucoca indzaba (20 min)

source: Once everyone is there, gather around the message board to start the day. 💬 Use the message board to share news about that day and what they will be doing by pointing to the symbols and talking to the children.
ssw: Uma wonkhe umuntfu sekafikile, hambani nonkhe nime ngakulebhodi yemilayeto kute kucalwe lusuku. 💬 Sebentisa lebhodi yemilayeto kwabelana ngetindzaba telusuku nekutsi batawube bentani ngekubakhombisa imifanekiso nekukhuluma nalabantfwana.

source: See activity ideas
ssw: Buka imibono yemisebenti longayenta

source: ✨ Clean up time (10 min)
ssw: ✨ Sikhatsi sekuhlobisa (10 lemizuzu)

source: 👩‍👧 Small-group time (15 min)
ssw: 👩‍👧 Sikhatsi selicembu lelincane (15 imizuzu)

source: This is where children break into smaller groups to learn new skills. 👫 First show the whole group what to do, then put them in groups. While the kids are busy, go around to each group to help, ask questions and use the activity to teach them something. I have lots of daily small-group activity ideas for you, if you ever need some inspiration. You can find them in the menu.
ssw: Lapha kungalesikhatsi bahlukana baya emacenjini lamancane batofundza ngemakhono lamasha. 👫 Cala ngekukhombisa licembu lonkhe kutsi lenteni, bese ubafaka emacenjini. Ngalesikhatsi bonkhe bantfwana bamatasatasa, hamba uye ecenjini ngalinye uyosita, buta imibuto usebentise lelitfuba lalomsebenti kubasita bafundze lokutsite. 👫 Nginemibono leminyenti longayisebentisa emisebentini yemacembu lamancane, uma ngabe udzinga kukhutsatwa. Ungayitfola kulemenyu.

source: *groan*☹ No one likes to clean up, but it’s important the kids learn the habit of tidying up after themselves, but also to learn about organization and order. So when playtime is over everyone must help pack up the toys and tidy their area before the next activity can start.
ssw: *Nyukubele*☹ Akekho lotsandza kuhlobisa, kodvwa kubalulekile kutsi labantfwana bafundze umkhuba wekuhlobisa lapho bebangcolise khona, kodvwa baphindze bafundze ngekuhlela ngendlela lefanele. Uma ngabe sikhatsi sekudlala sesiphelile, wonkhe umuntfu kufanele asite kupakisha onkhe emathoyisi babuye bahlobise indzawo yabo ngembi kwekutsi kucale umsebenti lolandzelako.

source: Playing is very important for a child’s development, plus they just love it. This time let’s them play freely, choosing their own games and toys from the interest areas. Use this time to ask questions, help them make friends, get them to try new things, and join in the game. Make sure you have put out lots of resources that children can reach and use to play with.
ssw: Kudlala kubaluleke kakhulu ebantfwaneni kute bakhule, kantsi bayakutsandza nabo. Nyalo bayekele badlale ngekukhululeka, batikhetsele imidlalo nemathoyisi labakutsandzako kulendzawo yekudlalela. Sebentisa lesikhatsi kubuta imibuto, basite bente bangani, bente bazame tintfo letinsha, uhlanganyele nabo kulemidlalo. Cinisekisa kutsi ubeke tinsita letinyenti ngaphandle bantfwana labangafinyelela kuto batisebentisele kudlala.

source: Explain steps
ssw: Chaza tinyatselo

source: 💬 Message-board time (10 min)
ssw: 💬 Sikhatsi sekubhala umlayeto ebhodini (10 lemizuzu)

source: After everything is packed away, bring the children together and ask them about what they did during play time. Ask a few children to share what they did. Show interest and involve other children.
ssw: Ngemuva kwekutsi konkhe sekupakashiwe, bantfwana abahlangane ndzawonye bese uyababuta ngekutsi bebentani ngalesikhatsi sekudlala. Cela bantfwana labambalwa kutsi bakutjele kutsi benteni. Khombisa inshisekelo ubuye ufake ekhatsi labanye.

source: Say hello to all children when they arrive, and help them find a friend or something to do while the other children arrive.
ssw: Bingelela bonkhe bantfwana uma ngabe bafika, bese uyabasita kutsi batfole umngani noma labangakwenta ngalesikhatsi labanye bantfwana bafika.

source: This is a fun time for all to get together to play games, act out stories, play music, do exercise, sing songs or dance. You can repeat these activities more often than the small-group ones, especially if there’s a game the children enjoy. But just to keep things fresh I have some activity ideas for you in the menu.
ssw: Lesi sikhatsi sekutijabulisa kubo bonkhe kutsi babe ndzawonye badlale imidlalo, badlale tikeshi, bacule emaculo noma badanse. Ungayiphindza lemisebenti njalo kunalena yemacembu lamancane, ikakhulukati uma kube nemdlalo labantfwana labawutfokotele. Kodvwa kute kutsi kugcinwe tintfo titisha nginaleminye imibono yalongakwenta kumenyu.

source: This is where give each child a chance to talk about what they are going to do in their play time. It lets them decide how they spend the next hour, share ideas and feel included. Use props to help them talk about their plans.
ssw: Lapha kungalesikhatsi uniketa umntfwana ngamunye litfuba lekukhuluma kwekutsi utawentani ngalesikhatsi sakhe skudlala. Bayekele batincumele kutsi batawube bentani ngalelihora lelilandzelako, banikete imibono nawe utive ungenelela. Sebentisa tinkhomba kubasita bakhulume ngetinhlelo tabo.

source: I hope this helped you plan your day. You can come back anytime to go over the steps again. Would you like to see those activity ideas or go back to the main menu.
ssw: Ngiyetsemba kutsi loku kukusitile kutsi uhlele lusuku lwakho. Ungabuyela noma nini wente letinyatselo futsi. Ungatsandza kubona leyo mibono ngalemisebenti noma ubuyele emuva kumenyu.

source: SmartStart has a clear 3-hour routine designed to help you children learn lots of new and exciting skills and concepts. 🌞
ssw: I-SmartStart inendlela leyisebentisako lecacile yemahora lama-3 leyentelwe kusita bantfwana bakho kutsi bafundze tintfo letinyenti nemakhono lajabulisako kanye nemicondvo lemisha. 🌞

source: Once everyone is there, gather around the message board to start the day. 💬 use the message board to share news about that day and what they will be doing by pointing to the symbols and talking to the children.
ssw: Uma wonkhe umuntfu sekafikile, hambani nonkhe nime ngakulebhodi yemilayeto kute kucalwe lusuku. 💬 Sebentisa lebhodi yemilayeto kwabelana ngetindzaba telusuku nekutsi batawube bentani ngekubakhombisa imifanekiso nekukhuluma nalabantfwana.

source: Go to main menu
ssw: Buyela emuva kumenyu

source: Go back to menu
ssw: Buyela emuva kumenyu

source: Here’s each step of the daily programme with a suggested time limit: • Greeting time (10 minutes) • Message-board time (10 minutes) • Small-group time (15-20 minutes) • Planning time (10 minutes) • Playtime (60 minutes) • Cleanup time (10 minutes) • Recall time (10 minutes) • Big-group time (15 minutes) • Story time (10 minutes)
ssw: Nasi sinyatselo ngasinye saloluhlelo lwamalanga onkhe kanye nesilinganiso sesikhatsi lesiconyiwe: • Sikhatsi sekubingelela (10 lemizuzu) • Sikhatsi semlayeto lobhalwe ebhodini (10 lemizuzu) • Sikhatsi semacembu lamancane (15-20 imizuzu) • Sikhatsi sekuhlela (10 lemizuzu) • Sikhatsi sekudlala (60 imizuzu) • Sikhatsi sekuhlobisa (10 lemizuzu) • Sikhatsi sekubuyeketa (10 lemizuzu) • Sikhatsi selicembu lelikhulu (15 imizuzu) • Sikhatsi sekucoca tindzaba (10 lemizuzu)

source: Do you want me to explain the programme steps more, see some activity ideas, or go back to the menu?
ssw: Ngabe ungatsandza kutsi ngichaze ngalesikhatsi seluhlelo kabanti, nayi leminye imibono yemsebenti, noma ubuyele emuva kumenyu?
