Repository: Ari-Ramkilowan/po-files
Catalog: translations/Assistant(Release (open))_Xhosa.po
Languages: xho

source: Here’s each step of the daily programme with a suggested time limit: • Greeting time (10 minutes) • Message-board time (10 minutes) • Small-group time (15-20 minutes) • Planning time (10 minutes) • Playtime (60 minutes) • Cleanup time (10 minutes) • Recall time (10 minutes) • Big-group time (15 minutes) • Story time (10 minutes)
xho: Nali inqanaba ngalinye lenkqubo yosuku ngalunye umlinganiselo wexesha eliphakanyisiweyo: • Ixesha lokubulisa (imizuzu elingu-10) • Ixesha lebhodi lomyalezo (imizuzu eli-10) • Ixesha elincane-leqela (imizuzu eyi-15-20) • Ixesha lokucwangcisa (imizuzu 10) • Ixesha lokudlala (imizuzu engama-60) • Ixesha lokucoca (10 imizuzu) • Khumbula ixesha (10 imizuzu)

source: SmartStart has a clear 3-hour routine designed to help your children learn lots of new and exciting skills and concepts. 🌞
xho: ISmartStart indlendla ecacile yeyure ezi 3 eyenzelwe ukunceda abantwana bakho bafunde izinto ezininzi nezivuyisayo zezkhono. 🌞

source: 👋🏾 Greeting time (10 mins)
xho: 👋🏾 Ixesha lokubulisa (10 Imizuzu)

source: See next step
xho: Jonga inyathelo elilandelayo

source: 📝 Planning time (10 min)
xho: 📝 Ixesha lokuceba (10 min)

source: 🧒🏾 Play time (60 min)
xho: 🧒🏾 Ixesha lokudlala (60 min)

source: 🧠 Recall time (10 mins)
xho: 🧠 Buyisela ixesha (10 Imizuzu)

source: 👩‍👧‍👦 Large group time (15 min)
xho: 👩‍👧‍👦 Ixesha leqela elikhulu (15 min)

source: 📖 Story time (20 min)
xho: 📖 Ixesha lebali (20 min)

source: See activity ideas
xho: Bona izimvo zemidlalo

source: ✨ Clean up time (10 min)
xho: ✨ Ixesha lokucoca (10 Imizuzu)

source: 👩‍👧 Small-group time (15 min)
xho: 👩‍👧 Ixesha elincinci- lamaqela (15 min)

source: This is where children break into smaller groups to learn new skills. 👫 First show the whole group what to do, then put them in groups. While the kids are busy, go around to each group to help, ask questions and use the activity to teach them something. I have lots of daily small-group activity ideas for you, if you ever need some inspiration. You can find them in the menu.
xho: Kulapho abantwna behlukana ngokwamaqela amancinci ukufnd izakhono ezitsha. 👫 Okokuqala bonisa iqela lonke, kwaye ubabeke ngokwamaqela. Ngoku abantwana besaxakekile, jikeleza uye kwiqela ngalinye unceda, buza imibuzo, usebenzise lo msebenzi ukubafundisa into. Ndinemisebenzi eminzinzi emincinci yeqela akho, ukuba udinga inkuthazo. Ungazifumana kwimenyu.

source: *groan*☹ No one likes to clean up, but it’s important the kids learn the habit of tidying up after themselves, but also to learn about organization and order. So when playtime is over everyone must help pack up the toys and tidy their area before the next activity can start.
xho: *Gquma*☹ Akukho mntu othatha ukucoca, kodwa kubalulekile abantwana bafunde ukuzicocela, bafunde ngokuqoqa nokuma. Ke ngoko xa ixesha lokudlala liphelile, wonke umntu makancede apakishe iithoyi kwaye balungise indawo yabo ngaphambi kokuba umlalo wesibini aqale.

source: Playing is very important for a child’s development, plus they just love it. This time let’s them play freely, choosing their own games and toys from the interest areas. Use this time to ask questions, help them make friends, get them to try new things, and join in the game. Make sure you have put out lots of resources that children can reach and use to play with.
xho: Ukudlala kubaluleke kakhulu ekuphuhlisweni komntwana, kunye nabo bayayithanda. Eli xesha libavumela ukuba badlale ngokukhululeka, bakhethe imidlalo yabo kunye namathoyizi avela kwiindawo ezithandayo. Sebenzisa eli xesha ukubuza imibuzo, bancede benze izihlobo, bafumane ukuba bazame izinto ezintsha, baze bajoyine umdlalo. Qinisekisa ukuba uye wafaka ezininzi iinkonzo abantwana abangakwazi ukuzifikelela kunye nokusebenzisa ukudlala nazo.

source: Explain steps
xho: Cacisa amanyathelo

source: 💬 Message-board time (10 min)
xho: 💬 xesha lebhodi yemiyalezo (10 imizuzu)

source: After everything is packed away, bring the children together and ask them about what they did during play time. Ask a few children to share what they did. Show interest and involve other children.
xho: Emva kokuba yonke into iqhutywe kude, bazise abantwana kunye nokubuza malunga nento abayenzayo ngexesha lokudlala. Buza abantwana abambalwa ukuba babelane ngezinto abazenzayo. Bonisa umdla kwaye ubandakanye nabanye abantwana.

source: Say hello to all children when they arrive, and help them find a friend or something to do while the other children arrive.
xho: Babulise bonke abantwana xa befika, bancede bafumane abahlobo okanye into yokwenza ngethuba belinde abanye abantwana ukuba bafike.

source: This is a fun time for all to get together to play games, act out stories, play music, do exercise, sing songs or dance. You can repeat these activities more often than the small-group ones, especially if there’s a game the children enjoy. But just to keep things fresh I have some activity ideas for you in the menu.
xho: Lelixesha elihle lokuba bonke bahlangane ukuze badlale imidlalo, benze ibali, badlale umculo, baqhelise, badumise iingoma okanye udaniso. Unokuphinda le mi sebenzi ngokuphindaphindiweyo kuneyona encinci-Iqela, ngakumbi xa kukho umdlalo abantwana abonwabileyo. Kodwa nje ukugcina izinto ezintsha ndinezinye iingcamango zomsebenzi kuwe kwimenyu.

source: This is where give each child a chance to talk about what they are going to do in their play time. It lets them decide how they spend the next hour, share ideas and feel included. Use props to help them talk about their plans.
xho: Kulapho unika umntwana ngamnye ithuba lokuba bathetha malunga nabaza kukwenza ngexesha lokudlala. Ibavumela bagqibe ukuba bayichitha njani iyure elandelayo, yabelana ngezimvo uzive ubandakanywa. Sebenzisa izikokhelo ukubnceda bthethe ngenjjongo zabo.

source: I hope this helped you plan your day. You can come back anytime to go over the steps again. Would you like to see those activity ideas or go back to the main menu.
xho: Ndiyanqwena ukuba oku kukuncede waceba usuku lwakho. Ungabuya nanini. Ukuba ujonge amanyathelo kwakhona. Ungathanda ukubona izimvo zemidlalo okanye ubuyele Kweyona Menyu.

source: SmartStart has a clear 3-hour routine designed to help you children learn lots of new and exciting skills and concepts. 🌞
xho: ISmartStart indlendla ecacile yeyure ezi 3 eyenzelwe ukunceda abantwana bakho bafunde izinto ezininzi nezivuyisayo zezkhono. 🌞

source: Once everyone is there, gather around the message board to start the day. 💬 use the message board to share news about that day and what they will be doing by pointing to the symbols and talking to the children.
xho: sf

source: Go to main menu
xho: Go to Eyona Menyu

source: Go back to menu
xho: Go Buyela kwimenyu

source: Here’s each step of the daily programme with a suggested time limit: • Greeting time (10 minutes) • Message-board time (10 minutes) • Small-group time (15-20 minutes) • Planning time (10 minutes) • Playtime (60 minutes) • Cleanup time (10 minutes) • Recall time (10 minutes) • Big-group time (15 minutes) • Story time (10 minutes)
xho: Nali inqanaba ngalinye lenkqubo yosuku ngalunye umlinganiselo wexesha eliphakanyisiweyo: • Ixesha lokubulisa (imizuzu elingu-10) • Ixesha lebhodi lomyalezo (imizuzu eli-10) • Ixesha elincane-leqela (imizuzu eyi-15-20) • Ixesha lokucwangcisa (imizuzu 10) • Ixesha lokudlala (imizuzu engama-60) • Ixesha lokucoca (10 imizuzu) • Khumbula ixesha (10 imizuzu)

source: Do you want me to explain the programme steps more, see some activity ideas, or go back to the menu?
xho: Ingaba ufuna ndicacise amanyethelo enkqubo ngokubanzi, bona ezinye izimvo zenkqubo, okanye uhambe uBuyele kiwMenyu?

source: This is normally the last step of the day. After all the excitement of the day it’s nice to sit down together and hear a story. You can read it or tell it, make faces, do voices and ask the children questions about the story. 🎭 Stories develop language skills as well as get the children thinking, imagining and concentrating.
xho: Ngokuqhelekileyo isinyathelo sokugqibela sosuku. Emva kwayo yonke imincili yosuku, kulungile ukuhlala kunye kunye nokuva ibali. Uyakwazi ukuyifunda okanye ukuxelela, yenza ubuso, wenze amazwi, uze ucele abantwana imibuzo malunga nebali. 🎭 Iindaba zithuthukisa izakhono zolwimi kwaye zenza abantwana bacinge, bacinge kwaye bajonge.
