Repository: Ari-Ramkilowan/po-files
Catalog: translations/Assistant(Release (open))_Venda.po
Languages: ven

source: Here’s each step of the daily programme with a suggested time limit: • Greeting time (10 minutes) • Message-board time (10 minutes) • Small-group time (15-20 minutes) • Planning time (10 minutes) • Playtime (60 minutes) • Cleanup time (10 minutes) • Recall time (10 minutes) • Big-group time (15 minutes) • Story time (10 minutes)
ven: Aya ndi mamaga a mbekanyamushumo ya ḓuvha ḽiṅwe na ḽiṅwe na zwifhinga zwo dzinginyiwaho: • Tshifhinga tsha u lumelisa (minetse dza 10) • Tshifhinga tsha mulaedza kha bodo (minetse dza 10) • Tshifhinga tsha tshigwada tshiṱuku (minetse dza 15-20) • Tshifhinga tsha u dzudzanya (minetse dza 10) • Tshifhinga tsha u tamba (minetse dza 60) • Tshifhinga tsha u kunakisa (minetse dza 10) • Tshifhinga tsha u humbula (minetse dza 10) • Tshifhinga tsha tshigwada tshihulwane (minetse dza 15) • Tshifhinga tsha u anetshela tshiṱori (minetse dza 10)

source: SmartStart has a clear 3-hour routine designed to help your children learn lots of new and exciting skills and concepts. 🌞
ven: SmartStart i na mushumo wa awara tharu yo bveledzwaho u itela u thusa vhana vhavho u guda vhukoni na mihumbulo minzhi miswa i takadzaho. 🌞

source: 👋🏾 Greeting time (10 mins)
ven: 👋🏾 U lumelisa (minetse dza 10)

source: See next step
ven: Kha vha sedze ḽiga ḽi tevhelaho

source: 📝 Planning time (10 min)
ven: 📝 Tshifhinga tsha u dzudzanya (Minetse ya 10)

source: 🧒🏾 Play time (60 min)
ven: 🧒🏾 Tshifhinga tsha u tamba (Minetse dza 60)

source: 🧠 Recall time (10 mins)
ven: 🧠 Tshifhinga tsha u kuvhangana (Minetse dza 10)

source: 👩‍👧‍👦 Large group time (15 min)
ven: 👩‍👧‍👦 Tshifhinga tsha tshigwada tshihulwane (Minetse dza 15)

source: 📖 Story time (20 min)
ven: 📖 Tshifhinga tsha u anetshela tshiṱori (Minetse dza 20)

source: Once everyone is there, gather around the message board to start the day. 💬 Use the message board to share news about that day and what they will be doing by pointing to the symbols and talking to the children.
ven: Musi ṅwana muṅwe na muṅwe o no swika, kha vha kuvhangane kha bodo ya mulaedza u itela u thoma ḓuvha ḽavho. 💬 Kha vha shumise mulaedza kha bodo u itela u amba mafhungo nga ha ḓuvha na zwine vha ḓo vha vha tshi khou ita nga u sumba kha zwiga na u amba na vhana.

source: See activity ideas
ven: Kha vha sedze kha mihumbulo nga ha mushumo

source: ✨ Clean up time (10 min)
ven: ✨ Tshifhinga tsha u kunakisa (Minetse dza 10)

source: 👩‍👧 Small-group time (15 min)
ven: 👩‍👧 Tshifhinga tsha tshigwada tshiṱuku (minetse ya 15)

source: This is where children break into smaller groups to learn new skills. 👫 First show the whole group what to do, then put them in groups. While the kids are busy, go around to each group to help, ask questions and use the activity to teach them something. I have lots of daily small-group activity ideas for you, if you ever need some inspiration. You can find them in the menu.
ven: Afha ndi hune vhana vha khethekana nga zwigwada zwiṱuku u itela u guda vhukoni vhuswa Tsha u thoma kha vha sumbedze tshigwada tshoṱhe zwine vha tea u ita, vha kone u vha vhekanya nga zwigwada. Musi vhana vha tshi khou shuma kha vha mone na tshigwada tshiṅwe na tshiṅwe vha tshi vha thusa, kha vha vha vhudzise mbudziso vha shumise mushumo uyo u vha gudisa. Ndi na mihumbulo mizhi ya mishumo ya zwigwada zwiṱuku ya ḓuvha ḽiṅwe na ḽiṅwe, arali vha tshi ṱoḓa ṱhuṱhuwedzo. Vha nga i wana vho humela murahu kha menyu.

source: *groan*☹ No one likes to clean up, but it’s important the kids learn the habit of tidying up after themselves, but also to learn about organization and order. So when playtime is over everyone must help pack up the toys and tidy their area before the next activity can start.
ven: *Kha vha gungule*☹ A hu na ane a ṱoḓa u kunakisa, fhedzi ndi zwa ndeme uri vhana vha gude u ḓowela u kunakisa vho no ita mashika, fhedzi vha dovhe nga gude nga u vheekanya na u dzudzanya zwithu zwavhuḓi. Zwino musi tshifhinga tsha u tamba tsho no fhela, muṅwe na muṅwe u tea u thusa u doba zwitambiswa na u kunakisa afho fhethu vha sa athu u thoma na mushumo u tevhelaho.

source: Playing is very important for a child’s development, plus they just love it. This time let’s them play freely, choosing their own games and toys from the interest areas. Use this time to ask questions, help them make friends, get them to try new things, and join in the game. Make sure you have put out lots of resources that children can reach and use to play with.
ven: U tamba ndi zwa ndemesa kha nyaluwo ya ṅwana, nahone vha a zwi funa. Tshifhinga itshi tshi vha konisa u tamba vho vhofholowa, u nanga mitambo yavho na zwitambiswa kha sia ḽine vha ḽi vhufuna. Kha vha shumise tshifhinga itshi u vhudzisa mbudziso, kha vha vha thuse u wana khonani, kha vha ri vha lingedze zwithu zwiswa, na vhone vha dzhenelele kha mutambo uyo. Kha vha vhone uri vha na tshomedzo nnzhi dzine vhana vha kona u dzi swikela na u dzi shumisa na u kona u tamba ngadzo.

source: Explain steps
ven: Kha vha ṱalutshedze maga

source: 💬 Message-board time (10 min)
ven: 💬 Tshifhinga tsha mulaedza kha bodo (minetse dza 10)

source: After everything is packed away, bring the children together and ask them about what they did during play time. Ask a few children to share what they did. Show interest and involve other children.
ven: Nga murahu ha musi vhana vho no vheekanya, kha vha ri vhana vha kuvhangane vha vha vhudzise nga zwe vha ita nga tshifhinga tsha u tamba. Kha vha humbele vhana vha si gathi vha ṱalutshedze zwe vha ita. Kha vha sumbedze dzangalelo na u ita uri vhaṅwe vhana vha dzhenelelevho.

source: Say hello to all children when they arrive, and help them find a friend or something to do while the other children arrive.
ven: Kha vha lumelise vhana vhoṱhe musi vha tshi tou swika, vha vha thuse u wana khonani kana zwine vha nga vha vha tshi khou ita u swika vhaṅwe vhana vha tshi swika vhoṱhe.

source: This is a fun time for all to get together to play games, act out stories, play music, do exercise, sing songs or dance. You can repeat these activities more often than the small-group ones, especially if there’s a game the children enjoy. But just to keep things fresh I have some activity ideas for you in the menu.
ven: Itshi ndi tshifhinga tshi takadzaho tsha u tamba vhoṱhe, u tamba zwiṱori, u tamba muzika, u ita nyonyoloso, u imba nyimbo kana u tshina. Vha nga dovholola iyi mishumo tshifhinga tshinzhi u fhirisa mishumo ya tshigwada tshiṱuku, nga maanḓa arali hu na mitambo ine ya takadza vhana vhaṱuku. Fhedzi u ita uri zwithu zwi dzule zwi zwiswa, ndi na miṅwe mihumbulo murahu kha zwirengomu.

source: This is where give each child a chance to talk about what they are going to do in their play time. It lets them decide how they spend the next hour, share ideas and feel included. Use props to help them talk about their plans.
ven: Afha ndi hune vha ita uri vhana vha ambe nga ha zwine vha ḓo ita nga tshifhinga tsha u tamba. Zwi vha konisa u dzhia tsheo uri vha ḓo shumisa hani awara i tevhelaho, u kovhekana mihumbulo na u ḓipfa vha tshipiḓa kha tshigwada. Kha vha shumise zwishumiswa u vha thusa u amba nga ha nzudzanyo dzavho.

source: I hope this helped you plan your day. You can come back anytime to go over the steps again. Would you like to see those activity ideas or go back to the main menu.
ven: Ndi a fulufhela izwi zwo vha thusa u dzudzanya ḓuvha ḽavho. Vha humele murahu tshifhinga tshinwe na tshiṅwe vha lavhelese maga aya hafhu. Vha khou ṱoda miṅwe mihumbulo nga ha mishumo kana vha ṱoḓa u humela murahu kha zwirengomu?

source: SmartStart has a clear 3-hour routine designed to help you children learn lots of new and exciting skills and concepts. 🌞
ven: SmartStart i na mushumo wa awara tharu yo bveledzwaho u itela u thusa vhana vhavho u guda vhukoni na mihumbulo minzhi miswa i takadzaho. 🌞

source: Once everyone is there, gather around the message board to start the day. 💬 use the message board to share news about that day and what they will be doing by pointing to the symbols and talking to the children.
ven: Musi ṅwana muṅwe na muṅwe o no swika, kha vha kuvhangane kha bodo ya mulaedza u itela u thoma ḓuvha ḽavho. 💬 Kha vha shumise mulaedza kha bodo u itela u amba mafhungo nga ha ḓuvha na zwine vha ḓo vha vha tshi khou ita nga u sumba kha zwiga na u amba na vhana.

source: Go to main menu
ven: Kha vha humele murahu kha zwirengomu

source: Go back to menu
ven: Kha vha humele murahu

source: Here’s each step of the daily programme with a suggested time limit: • Greeting time (10 minutes) • Message-board time (10 minutes) • Small-group time (15-20 minutes) • Planning time (10 minutes) • Playtime (60 minutes) • Cleanup time (10 minutes) • Recall time (10 minutes) • Big-group time (15 minutes) • Story time (10 minutes)
ven: Aya ndi mamaga a mbekanyamushumo ya ḓuvha ḽiṅwe na ḽiṅwe na zwifhinga zwo dzinginyiwaho: • Tshifhinga tsha u lumelisa (minetse dza 10) • Tshifhinga tsha mulaedza kha bodo (minetse dza 10) • Tshifhinga tsha tshigwada tshiṱuku (minetse dza 15-20) • Tshifhinga tsha u dzudzanya (minetse dza 10) • Tshifhinga tsha u tamba (minetse dza 60) • Tshifhinga tsha u kunakisa (minetse dza 10) • Tshifhinga tsha u humbula (minetse dza 10) • Tshifhinga tsha tshigwada tshihulwane (minetse dza 15) • Tshifhinga tsha u anetshela tshiṱori (minetse dza 10)

source: Do you want me to explain the programme steps more, see some activity ideas, or go back to the menu?
ven: Vha a ṱoda ndi tshi ṱalutshedza maga a mbekanyamushumo, kha vha sedze kha miṅwe mihumbulo nga ha mishumo, kana vha humele murahu?

source: This is normally the last step of the day. After all the excitement of the day it’s nice to sit down together and hear a story. You can read it or tell it, make faces, do voices and ask the children questions about the story. 🎭 Stories develop language skills as well as get the children thinking, imagining and concentrating.
ven: Kanzhisa heḽi ndi ḽiga ḽa u fhedza ḽa ḓuvha. Nga murahu ha ḓuvha ḽi nyanyulaho, ndi zwavhuḓi u kuvhangana ha thetsheleswa tshiṱori. Vha nga tou tshi vhala kana vha tou tshi anetshela, kha vha shumise zwifhaṱuwo, vha shandukise maipfi, vha vhudzise vhana mbudziso nga ha tshiṱori. 🎭 Zwiṱori zwi bveledza vhukoni ha luambo na u ita uri vhana vha humbule, u humbulela na u thetshelesa.
