Repository: Ari-Ramkilowan/po-files
Catalog: translations/Assistant(Release (open))_Tswana.po
Languages: tsn

source: Here’s each step of the daily programme with a suggested time limit: • Greeting time (10 minutes) • Message-board time (10 minutes) • Small-group time (15-20 minutes) • Planning time (10 minutes) • Playtime (60 minutes) • Cleanup time (10 minutes) • Recall time (10 minutes) • Big-group time (15 minutes) • Story time (10 minutes)
tsn: Kgato nngwe le nngwe ke e ya thulaganyo ya letsatsi le letsatsi e na le tekanyetso ya nako e e akantshiwang: • Nako ya go dumedisa (metsotso e 10) • Nako ya boto ya melaetsa (metsotso e 10) • Nako ya setlhopha se sennye (metsotso e 15-20) • Nako ya go rulaganya (metsotso e 10) • Nako ya go tshameka (metsotso e 60) • Nako ya go phepafatsa (metsotso e 10) • Nako ya go boela (metsotso e 10) • Nako ya setlhopha se segolo (metsotso e 15) • Nako ya setori (metsotso e 10)

source: SmartStart has a clear 3-hour routine designed to help your children learn lots of new and exciting skills and concepts. 🌞
tsn: SmartStart e na le tiro e e sa raraanangya ka metlha ya diura tse 3 e e rulaganyeditsweng go thusa bana go ithuta dilo tse dintsi tse disha le tse di itumedisang le megopolo.🌞

source: 👋🏾 Greeting time (10 mins)
tsn: 👋🏾 Nako ya go dumedisa (metsotso e 10)

source: See next step
tsn: Bona kgato e e latelang

source: 📝 Planning time (10 min)
tsn: 📝Bona kgato e e latelang

source: 🧒🏾 Play time (60 min)
tsn: 🧒🏾 Nako ya go tshameka (metsotso e 60)

source: 🧠 Recall time (10 mins)
tsn: 🧠Nako ya go boela (metsotso e 10)

source: 👩‍👧‍👦 Large group time (15 min)
tsn: 👩‍👧‍👦Nako ya setlhopha se segolo (metsotso e 15)

source: 📖 Story time (20 min)
tsn: 📖Nako ya setori (metsotso e 20)

source: Once everyone is there, gather around the message board to start the day. 💬 Use the message board to share news about that day and what they will be doing by pointing to the symbols and talking to the children.
tsn: Fa mongwe le mongwe a setse a gorogile, kgobokanang go dikologa boto ya melaetsa go simolola letsatsi. 💬 Dirisa boto ya molaetsa go abelana dikgang kaga letsatsi leno le gore ba tlile ggo dirang ka go supa matshwao le go bua le bana.

source: See activity ideas
tsn: Bona megopolo ya tirwana

source: ✨ Clean up time (10 min)
tsn: ✨ Nako ya go phepafatsa (metsotso e 10)

source: 👩‍👧 Small-group time (15 min)
tsn: 👩‍👧 Nako ya setlhopha se sennye (metsotso e 15)

source: This is where children break into smaller groups to learn new skills. 👫 First show the whole group what to do, then put them in groups. While the kids are busy, go around to each group to help, ask questions and use the activity to teach them something. I have lots of daily small-group activity ideas for you, if you ever need some inspiration. You can find them in the menu.
tsn: E ke nako ya gore bana ba kgaogane ditlhopha tse dinnye go ithuta bokgoni jo bosha. 👫 Santlha bontsha setlhopha sotlhe se ba tshwanetseng go se dira, o bo o ba kgaoganya ka ditlhopha. Fa bana ba ntse ba dira dilo tse di farologaneng, botsa dipotso o bo o dirisa tirwana eno go ba ruta sengwe. Ke na le megopolo e mentsi ya ditirwana tsa tsatsi le letsatsi tsa setlhopha se sennye, fa o ka tlhoka sengwe se se ka go tlhotlheletsang. O ka se bona mo menyung.

source: *groan*☹ No one likes to clean up, but it’s important the kids learn the habit of tidying up after themselves, but also to learn about organization and order. So when playtime is over everyone must help pack up the toys and tidy their area before the next activity can start.
tsn: *Ngongorego*☹ Ga go na yo o ratang go phepafatsha, mme go botlhokwa gore bana ba ithute mokgwa wa go hapha dilo fa ba fetsa, mme gape le go ithuta go rulaganya dilo le go di baya ka tshwanelo.. Jalo fa nako ya go tshameka e se na go fela, mongwe le mongwe o tshwanetse go thusa ka go baya dithoye fa di nnang teng le go hapha dilo mo lefelong la bone pele ga tirwana e e latelang e ka simolola.

source: Playing is very important for a child’s development, plus they just love it. This time let’s them play freely, choosing their own games and toys from the interest areas. Use this time to ask questions, help them make friends, get them to try new things, and join in the game. Make sure you have put out lots of resources that children can reach and use to play with.
tsn: Go tshameka go botlhokwa thata mo go goleng ga ngwana, gape baa go rata. Nako eno e ba naya tshono ya go tshameka ba lokologile, ba tlhopha metshameko ya bone le dithoye mo mafelong a a kgatlhisang. Dirisa nako e go botsa dipotso, ba thuse go dira ditsala, dira gore ba leke dilo tse disha, mme le wena o tshameke le bone. Tlhomamisa gore o ntshe dilo tse dintsi tse di dirisiwang tse bana ba ka kgonang go di tsaya le go di dirisa go tshameka ka tsone.

source: Explain steps
tsn: Tlhalosa dikgato

source: 💬 Message-board time (10 min)
tsn: 💬 Nako ya boto ya melaetsa(metsotso e 10)

source: After everything is packed away, bring the children together and ask them about what they did during play time. Ask a few children to share what they did. Show interest and involve other children.
tsn: Fa sengwe le sengwe se sena go bewa fa se nnang teng, kgobokanya bana mme o ba botse gore ba ne ba dirang ka nako ya go tshameka. Kopa bana ba sekae go re ba bolele se ba neng ba se dira. Bontsha kgatlhego mme o akaretse le bana ba bangwe.

source: Say hello to all children when they arrive, and help them find a friend or something to do while the other children arrive.
tsn: Dumedisa bana botlhe fa ba goroga, o bo o ba thuse go batla tsala kgotsa sengwe se ba ka se dirang fa bana ba bangwe ba ntse ba goroga.

source: This is a fun time for all to get together to play games, act out stories, play music, do exercise, sing songs or dance. You can repeat these activities more often than the small-group ones, especially if there’s a game the children enjoy. But just to keep things fresh I have some activity ideas for you in the menu.
tsn: E ke nako ya go ja monate ya gore botlhe ba kopane mme ba tshameke metshameko, ba diragatse ditori, ba tshameke mmino, ba dire dithutiso, ba opele dipina kgotsa ba bine O ka boeletsa ditirwana tseno gantsi go na le tsa setlhopha se sennye, bogolo jang fa e le gore go na le motshameko o bana ba o ratang. Mme gore re dire dilo tse disha ke na le megopolo mengwe ya ditirwana e e mo menyung.

source: This is where give each child a chance to talk about what they are going to do in their play time. It lets them decide how they spend the next hour, share ideas and feel included. Use props to help them talk about their plans.
tsn: E ke nako ya go naya ngwana mongwe le mongwe tshono ya go bua kaga se ba tlileng go se dira ka nako ya bone ya go tshameka. E ba naya tshono ya go dira tshwetso ya kafa ba ka dirisang ura e e latelang ka gone, go abelana megopolo le go ikutlwa ba le karolo ya setlhopha. Dirisa didirisiwa tsa tirwana go ba thusa ka dithulaganyo tsa bone.

source: I hope this helped you plan your day. You can come back anytime to go over the steps again. Would you like to see those activity ideas or go back to the main menu.
tsn: Ke solofela gore se se go thusitse go rulaganya letsatsi la gago. O ka boa gape lefa e le leng fela go tla go ithuta dikgato tseno gape. A o batla go bona megopolo eo ya ditirwana kgotsa go boela kwa mmenyung o mogolo.

source: SmartStart has a clear 3-hour routine designed to help you children learn lots of new and exciting skills and concepts. 🌞
tsn: SmartStart e na le tiro e e sa raraanangya ka metlha ya diura tse 3 e e rulaganyeditsweng go thusa bana go ithuta dilo tse dintsi tse disha le tse di itumedisang le megopolo.🌞

source: Once everyone is there, gather around the message board to start the day. 💬 use the message board to share news about that day and what they will be doing by pointing to the symbols and talking to the children.
tsn: Fa mongwe le mongwe a setse a gorogile, kgobokanang go dikologa boto ya melaetsa go simolola letsatsi. 💬 Dirisa boto ya molaetsa go abelana dikgang kaga letsatsi leno le gore ba tlile ggo dirang ka go supa matshwao le go bua le bana.

source: Go to main menu
tsn: Boela kwa mmenyung wa mogolo

source: Go back to menu
tsn: Boela kwa mmenyung

source: Here’s each step of the daily programme with a suggested time limit: • Greeting time (10 minutes) • Message-board time (10 minutes) • Small-group time (15-20 minutes) • Planning time (10 minutes) • Playtime (60 minutes) • Cleanup time (10 minutes) • Recall time (10 minutes) • Big-group time (15 minutes) • Story time (10 minutes)
tsn: Kgato nngwe le nngwe ke e ya thulaganyo ya letsatsi le letsatsi e na le tekanyetso ya nako e e akantshiwang: • Nako ya go dumedisa (metsotso e 10) • Nako ya boto ya melaetsa (metsotso e 10) • Nako ya setlhopha se sennye (metsotso e 15-20) • Nako ya go rulaganya (metsotso e 10) • Nako ya go tshameka (metsotso e 60) • Nako ya go phepafatsa (metsotso e 10) • Nako ya go boela (metsotso e 10) • Nako ya setlhopha se segolo (metsotso e 15) • Nako ya setori (metsotso e 10)

source: Do you want me to explain the programme steps more, see some activity ideas, or go back to the menu?
tsn: A o batla gore ke tlhalose dikgato tsa thulaganyo eno gape, bona megopolo mengwe ya tirwana, kgotsa boela kwa menyung?

source: This is normally the last step of the day. After all the excitement of the day it’s nice to sit down together and hear a story. You can read it or tell it, make faces, do voices and ask the children questions about the story. 🎭 Stories develop language skills as well as get the children thinking, imagining and concentrating.
tsn: Gantsi se ke kgato ya bofelo mo letsatsing. Morago ga go itumela mo letsatsing leo, go monate go nna fa fatshe mmogo go reetsa setori. O ka se bala kgotsa wa se ba bolelela, wa bontsha maikutlo ka sefatlhego, wa bua ka mantswe a a farologaneng, mme wa botsa bana dipotso ka ga setori seo. Ditori di godisa bokgoni jwa go bua gape di dira gore bana ba kgone go akanya, go tlhama dilo mo mogopolong le go tlhoma mogopolo.🎭
