Repository: Ari-Ramkilowan/po-files
Catalog: translations/Child Attendance(Release (open))_Venda.po
Languages: ven

source: Thanks, attendance list updated :)
ven: Ndo livhuwa, ridzhisṱara yo dzudzanywa:)

source: Thanks we received your upload!
ven: Ndo livhuwa, ndo zwi ṱanganedza!

source: {{ trans.current_date_capitalize }}'s attendance list
ven: {{ trans.current_date_capitalize }}'s Mutevhe wa vho ḓaho

source: I'm sorry, I don't understand you. Please try again - remember to list the numbers of all the children who were absent. eg 1, 2, 5.
ven: Pfarelo, a thi khou tou vha pfesesa. Kha vha lingedze hafhu - vha humbule u sumbedza mutevhe wa vhana vhe vha vha vha siho sa tsumbo 1, 2, 5

source: Would you like to upload a child attendance document?
ven: Vha a ṱoḓa u dzhenisa ḽinwalo ḽa ridzhisiṱara ya ṅwana wavho:

source: I'm sorry something went wrong there, please try again.
ven: Pfarelo, hu na zwi songo tshimbilaho zwavhuḓi, vha nga lingedza hafhu.

source: {{ trans.children }} Status: :heavy_check_mark:present ,:x:absent Glad everyone was there today 👍🏾
ven: {{ trans.children }} Tshiimo: :heavy_check_mark:u hone ,:x:haho Ndo takala uri vhana vhoṱhe vha hone ṋamusi👍🏾

source: Yes
ven: Ee

source: No
ven: Hai

source: Please list the numbers of all the children who were absent. eg 1, 2, 5.
ven: Ndi khou u humbela vha sumbedze tshivhalo tsha vhana vhane a vhaho. Sa tsumbo 1, 2, 5

source: Please upload a photograph of your child attendance register:
ven: ndi khou humbela vha dzhenise tshifanyiso tsha ridzhisiṱara ya ṅwana wavho:

source: Sorry something went wrong, please retry.
ven: Pfarelo hu na zwi songo tshimbilaho zwavhuḓi, kha vha lingedze hafhu.

source: Sorry we were unable to find any child attendance registers linked to your account, please contact SmartStart. Please phone our hotline on 0606536058. Would you like to go back to the menu?
ven: Pfarelo, ri khou kundelwa u wana ṅwana kha ridzisisṱara i tshimbilelanaho na akhaunthu yavho, ndi khou humbela vha kwame Smartstart

source: Your attendance register from {{trans.current_date}} is incomplete, would you like to update it now?
ven: Ridzhisiṱara yavho ḓaho u bva {{trans.current_date}} a yo ngo fhelela, vha nga ṱoḓa u i dzudzanya zwino?

source: {{ trans.children }} Status: :heavy_check_mark:present ,:x:absent
ven: {{ trans.children }} Tshiimo: :heavy_check_mark:u hone ,:x:haho

source: Were all the children present today ?
ven: Vhana vho vha hone vhoṱhe tshikoloni ṋamusi?

source: It's Sunday, please note attendance registers will be available from tomorrow again!
ven: Ndi Swondaha, kha vha dzhiele nzhele uri ridzhisiṱara i ḓo wanala hafhu matshelo!
