Repository: Ari-Ramkilowan/po-files
Catalog: translations/Child Attendance(Release (open))_Tsonga.po
Languages: tso

source: Thanks, attendance list updated :)
tso: Ndza nkhensa, xaxamelo wa matelo wu pfuxetiwile :)

source: Thanks we received your upload!
tso: Ndza Nnkhensa, hi yi kumile apulodi ya wena!

source: {{ trans.current_date_capitalize }}'s attendance list
tso: {{ trans.current_date_capitalize }}'s Nxaxamelo wa matelo

source: I'm sorry, I don't understand you. Please try again - remember to list the numbers of all the children who were absent. eg 1, 2, 5.
tso: Ndzi kombela ku khomeriwa, A ndzi ku twisisi. U komberiwa ku ringeta nakambe - tsundzuka ku xaxameta tinomboro ta vana hinkwavo lava a va nga ri kona. 1, 2, 5

source: Would you like to upload a child attendance document?
tso: Xana u lava ku apuloda tsalwa ra matelo ya n'wana?

source: I'm sorry something went wrong there, please try again.
tso: Ndzi khomele swin'wana a swi fambanga kahle, u komberiwa ku ringeta nakambe.

source: {{ trans.children }} Status: :heavy_check_mark:present ,:x:absent Glad everyone was there today 👍🏾
tso: {{ trans.children }} Xiteyitasi: :heavy_check_mark:u kona ,:x:a nga kona Ndzi tsakile hikuva hinkwavo a va ri kona namuntlha👍🏾

source: Yes
tso: Ina

source: No
tso: E-e

source: Please list the numbers of all the children who were absent. eg 1, 2, 5.
tso: U komberiwa ku xaxameta tinomboro ta vana hinkwavo lava a va nga ri kona. Xikombiso1, 2, 5

source: Please upload a photograph of your child attendance register:
tso: U komberiwa ku apuloda xifaniso xa rhijisitara ra matelo ya n'wana wa wena.

source: Sorry something went wrong, please retry.
tso: Ndzi khomele swin'wana a swi fambanga kahle, u komberiwa ku ringeta nakambe.

source: Sorry we were unable to find any child attendance registers linked to your account, please contact SmartStart. Please phone our hotline on 0606536058. Would you like to go back to the menu?
tso: Ndzi khomele a hi kotaka ku kuma rhijisitara ro matelo ya vana leri fambelanaka na akhawunti ya wena, u komberiwa ku tihlanganisa na Ku Sungula ka Vutlhari.

source: Your attendance register from {{trans.current_date}} is incomplete, would you like to update it now?
tso: Rhijisitara ra wena ra matelo kusukela ri herilerile {{trans.current_date}} xana u nga tsakela ku ri pfuxeta sweswi?

source: {{ trans.children }} Status: :heavy_check_mark:present ,:x:absent
tso: {{ trans.children }} Xiteyitasi: :heavy_check_mark:u kona ,:x:a nga kona

source: Were all the children present today ?
tso: Ingabe zonke izingane bezikhona namhlanje?

source: It's Sunday, please note attendance registers will be available from tomorrow again!
tso: I Sonto, u komberiwa ku lemuka leswaku rhijisitara ra matelo ri ta tlhela ri va kona nakambe kusukela mundzuku!
