Repository: Ari-Ramkilowan/po-files
Catalog: translations/Club Meetings(Release (open))_Swati.po
Languages: ssw

source: Did you attend the meeting on the following date?
ssw: Ngabe uyile emhlanganweni ngalolusuku lolulandzelako?

source: No
ssw: Cha

source: Sorry something went wrong, please try again.
ssw: Siyacolisa kukhona lokungakahambi kahle, phindza uzame futsi.

source: Thank you 😃
ssw: Siyabonga 😃

source: Upload a picture 📸 of your club attendance register now.
ssw: Faka sitfombe 📸 serejista yalabebakhona ecenjini lakho.

source: Would you like to mark the attendance of the past meetings?
ssw: Ungatsandza kumakha lebebakhona kulomhlangano lesewundlile?

source: Would you like to upload a meeting attendance register?
ssw: Ungatsandza kufaka irejista yalomhlangano?

source: Yes
ssw: Yebo

source: {% if trans.past_meeting_string %}Past meetings this month: {{ trans.past_meeting_string }} {% else %}Sorry we have no past meetings on record.{% endif %} {% if trans.future_meeting_string %}Future meetings this year: {{ trans.future_meeting_string }} {% else %}Sorry we have no future meetings on record.{% endif %}
ssw: https://dev.feersum.io/demo/b29e32c9-4b31-4c12-a7d1-6dcadfd6e181

source: Meeting Attendance
ssw: Kubakhona emihlanganweni
