Repository: Ari-Ramkilowan/po-files
Catalog: translations/Club Meetings(Release (open))_Southern Sotho.po
Languages: sot

source: Did you attend the meeting on the following date?
sot: Na o ile wa ba teng kopanong ka letsatsi le latelang?

source: No
sot: Tjhe

source: Sorry something went wrong, please try again.
sot: Tshwarelo, ho na le phoso e etsahetseng, ka kopo leka hape.

source: Thank you ðŸ˜ƒ
sot: Re a leboha

source: Upload a picture ðŸ“¸ of your club attendance register now.
sot: Aplouta setshwantsho sa rejistara ya boteng tlelapong hona jwale.

source: Would you like to mark the attendance of the past meetings?
sot: Na o ka rata ho tshwaya boteng ba batho ho dikopano tse fetileng?

source: Would you like to upload a meeting attendance register?
sot: Na o ka rata ho aplouta rejistara ya boteng kopanong?

source: Yes
sot: ee

source: {% if trans.past_meeting_string %}Past meetings this month: {{ trans.past_meeting_string }} {% else %}Sorry we have no past meetings on record.{% endif %} {% if trans.future_meeting_string %}Future meetings this year: {{ trans.future_meeting_string }} {% else %}Sorry we have no future meetings on record.{% endif %}
sot: {% if trans.past_meeting_string %}Dikopano tse fetileng kgweding ena: {{ trans.past_meeting_string }} {% else %}Re Mohau ha re na dikopano tse fetileng tse rekotilweng.{% endif %} {% if trans.future_meeting_string %}Dikopano tse tlang selemong sena: {{ trans.future_meeting_string }} {% else %}Re mohau ha re na dikopano tse tlang tse rekotilweng.{% endif %}

source: Meeting Attendance
sot: Ho ba teng Kopanong
