Repository: Ari-Ramkilowan/po-files
Catalog: translations/Club Meetings(Release (open))_Afrikaans.po
Languages: afr

source: Did you attend the meeting on the following date?
afr: Het jy die vergadering op die volgende datum bygewoon?

source: No
afr: Nee

source: Sorry something went wrong, please try again.
afr: Jammer, iets het skeefgeloop; probeer asseblief weer.

source: Thank you 😃
afr: Baie dankie 😃

source: Upload a picture 📸 of your club attendance register now.
afr: Laai nou ’n foto 📸 van jou klub se bywoningsregister op.

source: Would you like to mark the attendance of the past meetings?
afr: Wil jy die bywoning van die vorige vergaderings afmerk?

source: Would you like to upload a meeting attendance register?
afr: Wil jy ’n bywoningsregister van die vergadering oplaai?

source: Yes
afr: Ja

source: {% if trans.past_meeting_string %}Past meetings this month: {{ trans.past_meeting_string }} {% else %}Sorry we have no past meetings on record.{% endif %} {% if trans.future_meeting_string %}Future meetings this year: {{ trans.future_meeting_string }} {% else %}Sorry we have no future meetings on record.{% endif %}
afr: 1.{% if trans.past_meeting_string %}Vorige vergaderings hierdie maand: {{ trans.past_meeting_string }} {% else %}Jammer, ons het geen vorige vergaderings op rekord nie.{% endif %} {% if trans.future_meeting_string %}Toekomstige vergaderings hierdie jaar: {{ trans.future_meeting_string }} {% else %}Jammer, ons het geen toekomstige vergaderings op rekord nie.{% endif %}

source: Meeting Attendance
afr: Bywoning van vergaderings
