Repository: Ari-Ramkilowan/po-files
Catalog: translations/Club Meetings(Release (open))_Tsonga.po
Languages: tso

source: Did you attend the meeting on the following date?
tso: Tinhlengeletano leti nga hundza eka n'hweti leyi:

source: No
tso: E-e

source: Sorry something went wrong, please try again.
tso: Ndzi khomele swin'wana a swi fambanga kahle, u komberiwa ku ringeta nakambe.

source: Thank you 😃
tso: Ndza nkhensa 😃

source: Upload a picture 📸 of your club attendance register now.
tso: Apuloda xifaniso 📸 xa rhijisitara ra matelo ya xipano xa wena sweswi.

source: Would you like to mark the attendance of the past meetings?
tso: Xana u lava ku maka matelo ya tinhlengeletano leti nga hundza?

source: Would you like to upload a meeting attendance register?
tso: Xana u lava ku apuloda rhijisitara ra matelo ya le ka nhlengeletano?

source: Yes
tso: Ina

source: {% if trans.past_meeting_string %}Past meetings this month: {{ trans.past_meeting_string }} {% else %}Sorry we have no past meetings on record.{% endif %} {% if trans.future_meeting_string %}Future meetings this year: {{ trans.future_meeting_string }} {% else %}Sorry we have no future meetings on record.{% endif %}
tso: {% if trans.past_meeting_string %}Tinhlengeletani leti nga hundza eka n’hweti leyi: {{ trans.past_meeting_string }} {% else %}Ndzi khomele hi hava tinhlengeletano leti nga hundza ti nga rhekhodiwa. {% endif %} {% if trans.future_meeting_string %}Tinhlengeletano leti nga ta va kona eka nkarhi lowutaka eka lembe leri. {{ trans.future_meeting_string }} {% else %}Ndzi khomele hi hava tinhlengeletano leti nga ta va kona eka nkarhi lowutaka ti nga rhekhodiwa. {% endif %}

source: Meeting Attendance
tso: Matelo eka Tinhlengeletano
