Repository: Ari-Ramkilowan/po-files
Catalog: translations/How things work(Release (open))_Tswana.po
Languages: tsn

source: Back to menu
tsn: Boela kwa mmenyung wa mogolo

source: If a new child attends your class you can add them onto the register using WhatsApp. Just follow the instructions and take photos of the relevant documents when necessary.
tsn: Fa ngwana yo mosha a nna teng mo tlelaseng o ka mo tsenya mo rejisetareng o dirisa WhatsApp. Latela fela ditaelo o bo o tsaya dinepe tsa ditokumente tse di tshwanetseng fa go tlhokega.

source: New child registration
tsn: Go kwadisiwa ga ngwana mo rejisetareng

source: Let's go!
tsn: A re simolole!

source: What else can I do here?
tsn: Ke eng gape se ke ka se dirang fa?

source: You can tell me if you attended a meeting and received the right info. ℹ
tsn: O ka mpolelela fa o nnile teng kwa phuthegong nngwe mme o neilwe tshedimoseto e e siameng. ℹ

source: I might ask you to confirm where your SmartSchool school is by dropping a pin from time to time . 📍
tsn: Ke ka nna ka go kopa go tlhomamisa gore sekolo sa SmartStart se ko kae ka go tlhoma phine nako le nako. 📍

source: First off {{trans.nickname}}, can I show you around?
tsn: Santlha {{trans.nickname}}, a ke ka go bontsha mo tikologong?

source: SmartStart is designed to have very little paperwork, so you can focus on the kids. The first way we do that is filing the paperwork for you. 📄
tsn: SmartStart e rulaganyeditswe gore go seka ga dirisiwa dipampiri tse dintsi, gore o kgone go tlhoma mogopolo mo baneng. Tsela ya ntlha e re dirang jalo ka yone ke go go tlaletsa dipampiri. 📄

source: You can update your child-attendance registers right here and upload a photo of the paper. 📷
tsn: O ka kwala tsa bosheng mo direjesetereng tsa go nna teng ga bana ba gago gone mo le go laisa senepe sa pampiri. 📷

source: Need a reminder about how the daily routine works? You can go through the steps anytime right here. 🕐
tsn: A o tlhoka go gakololwa kafa tiro ya tsatsi le letsatsi e rulaganeng ka teng? O ka dira dikgato tseno nako nngwe le nngwe fano. 🕐

source: I also have lots of ideas for small and large group activities, if you need ideas for how to run a great programme. 👩‍👩‍👧‍👦👩‍👩‍👦‍👦
tsn: Gape ke na le megopolo e mentsi ya ditirwana tsa ditlhopha tse dinnye le tse dikgolo, fa o batla megopolo ya tsela ya go diragatsa porokerame e kgolo.👩‍👩‍👧‍👦👩‍👩‍👦‍👦 ‍‍‍‍‍‍

source: The My League function lets you share photos from your league to increase your points. 🖼
tsn: Tiro ya Liki ya Me e dira gore o bontshe ba bangwe dinepe tsa liki ya gago go oketsa dintlha tsa gago.🖼

source: I also have lots of helpful contacts like your coach and club members, in case you need some help. 👥
tsn: Gape ke na le batho ba bantsi ba go ka ikgolaganngwang le bone ba ba ka thusang ba ba tshwanang le mokatisi le maloko a tlelabo, fa e le gore o tlhoka thuso. 👥

source: You can also quickly and easily update your details if you change your number or move locations. 🏘
tsn: Gape o ka kwala dintlha tsa gago tsa bosheng ka bonako le ka bonolo fela fa o nna le nomoro e ntšha kgotsa o fudugela go sele. 🏘
