Repository: Ari-Ramkilowan/po-files
Catalog: translations/How things work(Release (open))_Tsonga.po
Languages: tso

source: Back to menu
tso: Famba eka menyunkulu

source: If a new child attends your class you can add them onto the register using WhatsApp. Just follow the instructions and take photos of the relevant documents when necessary.
tso: Loko mudyondzi lontshwa a ta etlilasini ya wena u nga n'wi nghenisa eka rhijisitara hi ku tirhisa Whatsapu. Wo landzelela swiletelo na ku teka swifaniso swa matsalwa lama lavekaka loko swi fanerile.

source: New child registration
tso: Marhijisitarelo ya n'wana

source: Let's go!
tso: A hi fambi!

source: What else can I do here?
tso: I yini xi’wana ndzi nga xi endlaka laha?

source: You can tell me if you attended a meeting and received the right info. ℹ
tso: U nga ndzi byela loko u nghenele nhlengeletano na ku kuma mahungu lama lulameke. ℹ

source: I might ask you to confirm where your SmartSchool school is by dropping a pin from time to time . 📍
tso: Ndzi nga ku kombela ku tiyisisa laha xikolo xa wena xa ku SunguIa hi Vutlhari xi nga kona hi ku rhumela phini yo komba laha u nga kona nkarhi na nkarhi. 📍

source: First off {{trans.nickname}}, can I show you around?
tso: Xo sungula {{trans.vito ro duvulela}}, ndzi ku komba ndhawu leyi?

source: SmartStart is designed to have very little paperwork, so you can focus on the kids. The first way we do that is filing the paperwork for you. 📄
tso: Ku sungula hi Vutlhari swi endleriwe ku va na ntirho wuntsongo wa maphepha, leswaku u kota ku kongomisa eka vana. Ndlela yo sungula yo endla leswi i ku ku tatela ntirho lowu a wu afenele wu tsariwa eka maphepha. 📄

source: You can update your child-attendance registers right here and upload a photo of the paper. 📷
tso: U nga pfuxeta marhijisitara ya vana va wena ya matelo ya le xikolweni kwala na ku apuloda xifaniso xa phepha. 📷

source: Need a reminder about how the daily routine works? You can go through the steps anytime right here. 🕐
tso: U lava xitsundzuxo xa ndlela leyi matirhelo ya rhotini ya siku na siku ya tirhisaka swona? U nga tlhelela eka magoza ya maendlelo kwala nkarhi na nkarhi. 🕐

source: I also have lots of ideas for small and large group activities, if you need ideas for how to run a great programme. 👩‍👩‍👧‍👦👩‍👩‍👦‍👦
tso: Ndzi tlhela ndzi va na mainankanyo yo tala ya migingiriko ya ntlawa lowuntsongo na lowukulu, loko u lava mianakanyo ya ndlela yo fambisa nongonoko lowukulu. 👩‍👩‍👧‍👦👩‍👩‍👦‍👦

source: The My League function lets you share photos from your league to increase your points. 🖼
tso: Ntirho wa Ligi ya Mina wu endla leswaku u komba swinepe ku suka eka ligi ya wena ku engetela minkutlunya ya wena. 🖼

source: I also have lots of helpful contacts like your coach and club members, in case you need some help. 👥
tso: Ndzi tlhela ndzi va na vanhu vo tala lava nga pfunaka ku fana na mudzabi wa wena na swirho swa xipano, loko u tshika u lava ku pfuniwa. 👥

source: You can also quickly and easily update your details if you change your number or move locations. 🏘
tso: U nga tlhela u pfuxeta vuxokoxoko bya wena hi xihatla no olova loko u cinca nomboro ya wena kumbe ku famba u ya eka tindhawu tin’wana. 🏘
