Repository: Ari-Ramkilowan/po-files
Catalog: translations/How things work(Release (open))_Afrikaans.po
Languages: afr

source: Back to menu
afr: Terug na die spyskaart

source: If a new child attends your class you can add them onto the register using WhatsApp. Just follow the instructions and take photos of the relevant documents when necessary.
afr: As ’n nuwe kind jou klas bywoon, kan jy deur middel van Whatsapp hulle by die register voeg. Volg net die instruksies en neem foto’s van die betrokke dokumente, wanneer nodig.

source: New child registration
afr: Nuwe Kind se registrasie

source: Let's go!
afr: Laat ons begin!

source: What else can I do here?
afr: Wat anders kan ek hier doen?

source: You can tell me if you attended a meeting and received the right info. ℹ
afr: Jy kan my vertel of jy ’n vergadering bygewoon het en die regte inligting ontvang het. ℹ

source: I might ask you to confirm where your SmartSchool school is by dropping a pin from time to time . 📍
afr: Ek kan jou vra om te bevestig waar jou SmartStart-skool is, deur van tyd tot tyd ’n pennetjie te laat val. 📍

source: First off {{trans.nickname}}, can I show you around?
afr: Eerstens, {{trans.nickname}}, kan ek jou rondwys?

source: SmartStart is designed to have very little paperwork, so you can focus on the kids. The first way we do that is filing the paperwork for you. 📄
afr: SmartStart is ontwerp om baie min papierwerk te hê sodat jy op die kinders kan fokus. Die eerste manier hoe ons dit doen is om die papierwerk vir jou te liasseer. 📄

source: You can update your child-attendance registers right here and upload a photo of the paper. 📷
afr: Jy kan jou kinderbywoningsregisters hier bywerk en ’n foto van die register oplaai. 📷

source: Need a reminder about how the daily routine works? You can go through the steps anytime right here. 🕐
afr: Wil jy herinner word oor hoe die daaglikse roetine werk? Jy kan enige tyd hier deur die stappe gaan. 🕐

source: I also have lots of ideas for small and large group activities, if you need ideas for how to run a great programme. 👩‍👩‍👧‍👦👩‍👩‍👦‍👦
afr: Ek het ook baie idees vir klein en groot groepaktiwiteite, sou jy idees nodig hê om ’n goeie program aan te bied. 👩‍👩‍👧‍👦👩‍👩‍👦‍👦

source: The My League function lets you share photos from your league to increase your points. 🖼
afr: Die My League-funksie laat jou foto’s van jou liga deel om jou punte te verhoog. 🖼

source: I also have lots of helpful contacts like your coach and club members, in case you need some help. 👥
afr: Ek het ook baie nuttige kontakte soos jou afrigter en klublede, ingeval jy hulp soek. 👥

source: You can also quickly and easily update your details if you change your number or move locations. 🏘
afr: As jy jou nommer verander of van ligging verander, kan jy ook jou besonderhede vinnig en maklik bywerk. 🏘
