Repository: Ari-Ramkilowan/po-files
Catalog: translations/How things work(Release (open))_South Ndebele.po
Languages: nbl

source: Back to menu
nbl: Buyela erhelweni

source: If a new child attends your class you can add them onto the register using WhatsApp. Just follow the instructions and take photos of the relevant documents when necessary.
nbl: Nange umntwana omutjha eza ngeklasini lakho ungabafaka kurejista usebenzisa iWhatsApp. Landela imiyalelo uthathe isithombe somtlolo nakutlhogekako.

source: New child registration
nbl: Ukutloliswa komntwana

source: Let's go!
nbl: Asikhambe!

source: What else can I do here?
nbl: Khuyini okhunye engingakwenza lapha?

source: You can tell me if you attended a meeting and received the right info. ℹ
nbl: Ungangitjela nawuye emhlanganweni begodu wathola ilwazi elifanele. ℹ

source: I might ask you to confirm where your SmartSchool school is by dropping a pin from time to time . 📍
nbl: Ngingakubawa bona uqinisekisi ukuthi isikolo sakho se - SmartStart sikuphi ngokuthumela iphini.📍

source: First off {{trans.nickname}}, can I show you around?
nbl: Kokuthoma {{trans.igama lokudlala}}, ngingakutjengisa indawo?

source: SmartStart is designed to have very little paperwork, so you can focus on the kids. The first way we do that is filing the paperwork for you. 📄
nbl: SmartStart yenzelwe ukuthi isebenzise iphepha elincani ukuze umnqopho ube semntwaneni. Sikwenza lokho ngokuthi sikugcwalisele thina iphepha. 📄

source: You can update your child-attendance registers right here and upload a photo of the paper. 📷
nbl: Ungalungisa irejista yomntwanakho khona la uphinde uthumele isithombe sephepa. 📷

source: Need a reminder about how the daily routine works? You can go through the steps anytime right here. 🕐
nbl: Ufuna ukukhunjuswa ukuthi ihlelo lethu lelanga likhamba njani? Ungalandela amagadango khona la. 🕐

source: I also have lots of ideas for small and large group activities, if you need ideas for how to run a great programme. 👩‍👩‍👧‍👦👩‍👩‍👦‍👦
nbl: Nginemibono eminengi yomsebenzi weenqhema ezincane nezikulu, uma ufuna imibona yokukhambisa ihlelo leli. 👩‍👩‍👧‍👦👩‍👩‍👦‍👦

source: The My League function lets you share photos from your league to increase your points. 🖼
nbl: Umsebenzi we -The My League wenza ukuthi wabe iinthombe zakho bese ikukhuphulela amaphuzu. 🖼

source: I also have lots of helpful contacts like your coach and club members, in case you need some help. 👥
nbl: Nginazo nezinomboIo ezinengi zababanduli namalunga weklabhu nange ungazitlhoga. 👥

source: You can also quickly and easily update your details if you change your number or move locations. 🏘
nbl: Ungaphinda futhi ulungise imininingwana yakho lokha nayingatjintja njengemtato noma indawo yokuhlala.🏘
