Repository: Ari-Ramkilowan/po-files
Catalog: translations/How things work(Release (open))_Venda.po
Languages: ven

source: Back to menu
ven: Kha vha humele murahu kha zwirengomu (Menu)

source: If a new child attends your class you can add them onto the register using WhatsApp. Just follow the instructions and take photos of the relevant documents when necessary.
ven: Arali hu na ṅwana muswa kiḽasini yavho kha vha mu dzhenise kha ridzhisiṱiara vha tshi khou shumisa WhatsApp. Kha vha tevhele ndaela na u dzhia zwifanyiso zwa maṅwalo a ndeme.

source: New child registration
ven: U ṅwalisa ṅwana

source: Let's go!
ven: Kha ri thome!

source: What else can I do here?
ven: Ndi zwifhio zwiṅwe zwine nda nga kona u zwi ita afha?

source: You can tell me if you attended a meeting and received the right info. ℹ
ven: Kha vha mmbudze arali vho dzhenelela muṱangano, vha kona u wana zwidodombedzwa zwa vhukuma. ℹ

source: I might ask you to confirm where your SmartSchool school is by dropping a pin from time to time . 📍
ven: Ndi nga vha humbela uri vha khwaṱhisedze uri tshikolo tshavho tsha SmartStart tshingafhi nga u dzhenisa pin/tsumba vhupo nga murahu ha tshifhinga. 📍

source: First off {{trans.nickname}}, can I show you around?
ven: Tsha u thoma {{trans.dzina ḽa miswaso}}, ndi nga vha sumbedza?

source: SmartStart is designed to have very little paperwork, so you can focus on the kids. The first way we do that is filing the paperwork for you. 📄
ven: SmartStart yo olelwa uri hu songo vha na mushumo wa u shumana na dzibugu, zwenezwo vha nga kona u shuma na vhana zwavhuḓi. Nḓila ya u thoma ya u ita ngauralo ndi u vha ḓadzela dzifomo. 📄

source: You can update your child-attendance registers right here and upload a photo of the paper. 📷
ven: Vha nga kona u shandukisa ridzhisiṱara ya vhana vhavho hanefha vha kona u dzhenisa tshifanyiso. 📷

source: Need a reminder about how the daily routine works? You can go through the steps anytime right here. 🕐
ven: Vha a ṱoḓa u humbudzwa nga ha uri mushumo wa ḓuvha ḽiṅwe na ḽiṅwe u shumiswa hani? Vha nga sedza kha maga tshifhinga tshiṅwe na tshiṅwe hanefha. 🕐

source: I also have lots of ideas for small and large group activities, if you need ideas for how to run a great programme. 👩‍👩‍👧‍👦👩‍👩‍👦‍👦
ven: Ndi na miṅwe mihumbulo minzhi nga ha mishumo ya zwigwada zwiṱuku kana zwihulwane, arali vha tshi ṱoḓa mihumbulo ya uri vha nga shumana hani na mbekanyamushumo khulwane. 👩‍👩‍👧‍👦👩‍👩‍👦‍👦

source: The My League function lets you share photos from your league to increase your points. 🖼
ven: Mushumo wa My League ndi wa uri vha kovhekane zwifanyiso na tshigwada tshavho u itela u engedza poindi dzavho. 🖼

source: I also have lots of helpful contacts like your coach and club members, in case you need some help. 👥
ven: Ndi dovha nda vha na zwidodombedzwa zwa vhukwamani zwinzhi u fana na mugudisi na miraḓo ya kiḽaba, arali vha tshi ṱoḓa thuso. 👥

source: You can also quickly and easily update your details if you change your number or move locations. 🏘
ven: Vha nga dovha vha shandukisa zwidodombedzwa zwavho nga u ṱavhanya, zwo leluwa arali vha nga shandukisa nomboro yavho kana vha pfuluwa. 🏘
