Repository: Ari-Ramkilowan/po-files
Catalog: translations/How things work(Release (open))_Zulu.po
Languages: zul

source: Back to menu
zul: Buyela kumenyu

source: If a new child attends your class you can add them onto the register using WhatsApp. Just follow the instructions and take photos of the relevant documents when necessary.
zul: Uma ingane entsha ifika ekilasini lakho ungayifaka kurejista usebenzisa u-WhatsApp. Vele ulandele imiyalelo bese uthatha isithombe samadokhumenti afanele lapho kunesidingo khona.

source: New child registration
zul: Ukubhaliswa kwengane

source: Let's go!
zul: Azishe!

source: What else can I do here?
zul: Yini enye engingayenza lapha?

source: You can tell me if you attended a meeting and received the right info. ℹ
zul: Ungangitshela ukuthi uhambele umhlangano futhi wathola imininingwane efanele. ℹ

source: I might ask you to confirm where your SmartSchool school is by dropping a pin from time to time . 📍
zul: Ngingase ngikucele ukuba uqinisekise ukuthi i-SmartStart school ikuphi ngokuwisa iphini ekuhambeni kwesikhathi. 📍

source: First off {{trans.nickname}}, can I show you around?
zul: Okokuqala {{trans.nickname}}, ngingakubonisa lapha?

source: SmartStart is designed to have very little paperwork, so you can focus on the kids. The first way we do that is filing the paperwork for you. 📄
zul: I-SmartStart yenzelwe ukuba isebenze ngaphepha kancane kakhulu, ukuze ugxile ezinganeni. Indlela yokuqala esenza ngayo lokho ukuba sikugcwalisele amaphepha. 📄

source: You can update your child-attendance registers right here and upload a photo of the paper. 📷
zul: Ungagcwalisa irejista yezingane ezisekilasini khona lapha bese uloda isithombe sephepha. 📷

source: Need a reminder about how the daily routine works? You can go through the steps anytime right here. 🕐
zul: Udinga isikhumbuzo sokuthi inqubo yansukuzonke isebenza kanjani? Ungafunda izinyathelo noma nini. 🕐

source: I also have lots of ideas for small and large group activities, if you need ideas for how to run a great programme. 👩‍👩‍👧‍👦👩‍👩‍👦‍👦
zul: Futhi nginemibono eminingi yemisebenzi yamaqembu amancane namakhulu, uma udinga imibono emisha yokuthi ungaba kanjani nohlelo oluhlabahlosile. 👩‍👩‍👧‍👦👩‍👩‍👦‍👦

source: The My League function lets you share photos from your league to increase your points. 🖼
zul: I-My League function ikuvumela ukwazi ukwabelana ngezithombe kuligi yakho ukuze unyuse amaphuzu akho. 🖼

source: I also have lots of helpful contacts like your coach and club members, in case you need some help. 👥
zul: Ngiphinde ngibe nezinombolo eziningi ongazishayela njengomqeqeshi wakho namalungu eqembu, uma kwenzeka udinga usizo. 👥

source: You can also quickly and easily update your details if you change your number or move locations. 🏘
zul: Ungaphinde futhi uvuselele ngokushesha nakalula imininingwane yakho uma ushintsha inombolo noma uthutha. 🏘
