Repository: Ari-Ramkilowan/po-files
Catalog: translations/How things work(Release (open))_Pedi; Sepedi;  Northern Sotho.po
Languages: nso

source: Back to menu
nso: Re boela morago go menyu

source: If a new child attends your class you can add them onto the register using WhatsApp. Just follow the instructions and take photos of the relevant documents when necessary.
nso: Ge e ba go na le ngwana yo mofsa ka phapošingborutelo ya gago, o ka mo tsenya retšisetareng ka go šomiša WhatsApp. Latela ditaelo le go tšea diswantšho tša ditokumente tša maleba ge go nyakega.

source: New child registration
nso: Ngwadišo ya bana

source: Let's go!
nso: A re sepele!

source: What else can I do here?
nso: Ke eng se sengwe nka se dirago mo?

source: You can tell me if you attended a meeting and received the right info. ℹ
nso: O ka mpotša ge e le gore o tsenetše kopano le go amogela tshedimošo ya maleba. ℹ

source: I might ask you to confirm where your SmartSchool school is by dropping a pin from time to time . 📍
nso: Nka go kgopela go kgonthiša moo go lego sekolo sa gago sa SmartStart ka go lahlela phini nako le nako. 📍

source: First off {{trans.nickname}}, can I show you around?
nso: Sa pele {{trans.nickname}}, nka go bontšha tikologo?

source: SmartStart is designed to have very little paperwork, so you can focus on the kids. The first way we do that is filing the paperwork for you. 📄
nso: SmartStart e hlametšwe gore e fokotše mošomo wa dipampiri, gore o kgone go bea šedi go bana ba bannyane. Tsela ya mathomo ye re dirago seo ke go beakanyetša dipampiri tša gago ka faeleng. 📄

source: You can update your child-attendance registers right here and upload a photo of the paper. 📷
nso: O ka mpshafatša diretšisetara tša go tsena sekolo gona mo le go apolouta senepe sa pampiri. 📷

source: Need a reminder about how the daily routine works? You can go through the steps anytime right here. 🕐
nso: O nyaka segopotši mabapi le ka moo mešomo ya tšatši ka tšatši e šomago ka gona? O ka latela dikgato nako efe goba efe gona mo. 🕐

source: I also have lots of ideas for small and large group activities, if you need ideas for how to run a great programme. 👩‍👩‍👧‍👦👩‍👩‍👦‍👦
nso: Ke na le dikgopolo tše ntši kudu tša mešomo wa dihlopha tše nnyane le tše kgolo, ge e le gore o nyaka dikgopolo tša ka moo o ka sepetšago lenaneo le legolo. 👩‍👩‍👧‍👦👩‍👩‍👦‍👦

source: The My League function lets you share photos from your league to increase your points. 🖼
nso: Senolofatši sa Lliki ya Ka se go dumelela go abelana ka dinepe go tšwa go lliki ya gago go oketša dintlha tša gago. 🖼

source: I also have lots of helpful contacts like your coach and club members, in case you need some help. 👥
nso: Ke na le tshedimošo ya kgokagano ye bohlokwa go swana le tša mohlahli wa gago le maloko a mokgatlo, ge e le gore o ka nyaka thušo. 👥

source: You can also quickly and easily update your details if you change your number or move locations. 🏘
nso: O ka mpshafatša tshedimošo ya gago ya kgokagano ka potlako le gabonolo ge e le gore o fetoša nomoro ya gago goba mafelo a go sepela. 🏘
