Repository: Ari-Ramkilowan/po-files
Catalog: translations/How things work(Release (open))_Southern Sotho.po
Languages: sot

source: Back to menu
sot: Ho ya ho menu wa sehlooho

source: If a new child attends your class you can add them onto the register using WhatsApp. Just follow the instructions and take photos of the relevant documents when necessary.
sot: Haeba ngwana e motjha a etla tlelaseng ya hao o ka mo kenya rejistareng o sebedisa Whatsapp. Latela feela ditaelo mme o nke difoto tsa ditokomane tse loketseng ha ho hlokeha.

source: New child registration
sot: Ngodiso ya Bana

source: Let's go!
sot: Ha re ye!

source: What else can I do here?
sot: Nka etsang hape mo?

source: You can tell me if you attended a meeting and received the right info. ℹ
sot: O ka mpolella haeba o ile wa ya kopanong mme wa fumana tlhahisoleseding e nepahetseng. ℹ

source: I might ask you to confirm where your SmartSchool school is by dropping a pin from time to time . 📍
sot: Nka nna ka o kopa ho netefatsa moo sekolo sa hao sa SmartStart se leng teng ka ho lahlela pini nako le nako. 📍

source: First off {{trans.nickname}}, can I show you around?
sot: Taba ya pele {{trans.nickname}}, na nka o bontsha sebaka se?

source: SmartStart is designed to have very little paperwork, so you can focus on the kids. The first way we do that is filing the paperwork for you. 📄
sot: SmartStart e radilwe hore ho be le tshebediso e nyane haholo ya pampiri, ele hore o tle o kgone ho tsepamisa maikutlo baneng. Tsela ya pele eo re etsang seo ka yona ke ho o etsetsa mosebetsi wa dipampiri. 📄

source: You can update your child-attendance registers right here and upload a photo of the paper. 📷
sot: O ka nna wa apdeita direjistara tsa ho ba teng ha ngwana hao hona mona mme wa aplouta senepe sa pampiri. 📷

source: Need a reminder about how the daily routine works? You can go through the steps anytime right here. 🕐
sot: O hloka sehopotso bakeng sa kamoo tshebetso ya letsatsi le letsatsi e sebetsang ka teng? O ka nna wa tsamaya mehato eo ka nako efe kapa efe hona mona. 🕐

source: I also have lots of ideas for small and large group activities, if you need ideas for how to run a great programme. 👩‍👩‍👧‍👦👩‍👩‍👦‍👦
sot: Hape ke na le mehopolo e mengata bakeng sa diketsahalo tsa dihlopha tse nyane le tse kgolo, ebang o hloka mehopolo ya kamoo o ka tsamaisang lenaneo le atlehileng ka teng. 👩‍👩‍👧‍👦👩‍👩‍👦‍👦

source: The My League function lets you share photos from your league to increase your points. 🖼
sot: Tshebetso ya Mokgatlo wa ka (My League) e o dumella ho abelana ka dinepe tsa mokgatlo wa hao bakeng sa ho eketsa dintlha tsa hao. 🖼

source: I also have lots of helpful contacts like your coach and club members, in case you need some help. 👥
sot: Hape ke na le batho ba bangata ba thusang jwaloka mokwetlisi wa hao le ditho tsa tlelapo, ebang o hloka thuso. 👥

source: You can also quickly and easily update your details if you change your number or move locations. 🏘
sot: Hape o ka nna wa ntjhafatsa dintlha tsa hao haeba o fetotse nomoro ya hao kapa o dula sebakeng se seng. 🏘
