Repository: Ari-Ramkilowan/po-files
Catalog: translations/League(Release (open))_Pedi; Sepedi;  Northern Sotho.po
Languages: nso

source: Main menu
nso: E ya go menyu

source: Creativity
nso: Boitlhagišetšo

source: Sorry something went wrong, please retry.
nso: Ke maswabi, go na le seo se sa sepelago gabotse, o kgopelwa go leka gape.

source: Taking Action
nso: Go tšea kgato

source: Share activity
nso: Abelana mošomo

source: You can improve your score in the league by sharing photos and stories about your club activities. 🏆
nso: O ka kaonafatša dintlha tša gago ka lliking ka go abelana ka diswantšho le dikanegelo mabapi le mešomo ya mokgatlo wa gago. 🏆

source: Great! I’m excited to see the photo. Can you upload it now please? 📸
nso: Agaa! Ke thabišitšwe ke go bona seswantšho. Naa o ka se apolouta gonabjale? 📸

source: Which category best describes the activity you just did?
nso: Ke legoro lefe leo le hlalošago gabotsebotse mošomo wo o sa tšwago go o dira?

source: That’s a great photo! What’s the story behind it?
nso: Seo ke seswantšho se se botse! Naa ke eng seo se re botšago sona?

source: Thank you for sharing, keep up the good work! 💪
nso: Re leboga go abelana le rena, tšwela pele ka mošomo o mmotse!💪
