Repository: Ari-Ramkilowan/po-files
Catalog: translations/League(Release (open))_Venda.po
Languages: ven

source: Main menu
ven: Go to menu

source: Creativity
ven: Vhukoni

source: Sorry something went wrong, please retry.
ven: Pfarelo, hu na zwi songo tshimbilaho zwavhuḓi, vha nga lingedza hafhu.

source: Taking Action
ven: U dzhia maga

source: Share activity
ven: Kha vhaanḓadze zwiitwa

source: You can improve your score in the league by sharing photos and stories about your club activities. 🏆
ven: Vha nga khwinisa tshikoro tshavho kha ḽigi nga u dzhenisa zwifanyiso na u amba zwiṱori zwavho nga ha mishumo ya kiḽaba yavho. 🏆

source: Great! I’m excited to see the photo. Can you upload it now please? 📸
ven: Ndi zwavhuḓi! Ndi ḓo takalela u vhona tshifanyiso.Vha nga kona u tshi rumela zwino? 📸

source: Which category best describes the activity you just did?
ven: Ndi ifhio khethekanyo ine ya ṱalutshedza zwavhuḓi zwe vha ita?

source: That’s a great photo! What’s the story behind it?
ven: Ndi tshifanyiso tshavhuḓi zwone! Ndi tshifhio tshiṱori nga hatsho?

source: Thank you for sharing, keep up the good work! 💪
ven: Ndi khou livhuwa u kovhelwa mafhung , kha vha dzulele u ita mushumo wavhuḓi ngaurali!💪
