Repository: Ari-Ramkilowan/po-files
Catalog: translations/League(Release (open))_Tsonga.po
Languages: tso

source: Main menu
tso: Ndzi yise eka menyu

source: Creativity
tso: Vutumbuluxi

source: Sorry something went wrong, please retry.
tso: Ndzi khomele, swin'wana a swi fambanga kahle, xana u lava ku ringeta nakambe?

source: Taking Action
tso: Ku teka goza

source: Share activity
tso: Avelano nghingiriko

source: You can improve your score in the league by sharing photos and stories about your club activities. 🏆
tso: U nga antswisa swikoro swa wena eka ligi hi ku avelana hi swifaniso na switori swa migingiriko ya xipano xa wena.🏆

source: Great! I’m excited to see the photo. Can you upload it now please? 📸
tso: Swi kahle ndza tsaka ku vona xifaniso. Xana u nga kota ku xi apuloda sweswi? 📸

source: Which category best describes the activity you just did?
tso: Xana hi wihi nkhetekanyo lowu hlamuselaka nghingiriko lowu wa ha ku wu endlaka hi ku hetiseka?

source: That’s a great photo! What’s the story behind it?
tso: Xexo i xifaniso xa kahle! Xana hi xihi xitori xa xifan,;iso lexi?

source: Thank you for sharing, keep up the good work! 💪
tso: Ndza khensa ku va u ndzi kombe xona, ya na emahlweni na ntirho wa wena wa kahle! 💪
