Repository: Ari-Ramkilowan/po-files
Catalog: translations/League(Release (open))_Southern Sotho.po
Languages: sot

source: Main menu
sot: Eya ho menu

source: Creativity
sot: Boqapi

source: Sorry something went wrong, please retry.
sot: Tshwarelo, ho na le phoso e etsahetseng, ka kopo na o ka leka hape.

source: Taking Action
sot: Ho nka mohato

source: Share activity
sot: Abelana ka ketsahalo

source: You can improve your score in the league by sharing photos and stories about your club activities. 🏆
sot: O ka nna wa ntlafatsa matshwao a hao liking ka ho abelana ka difoto le dipale tse mabapi le diketsahalo tsa tlelapo ya hao. 🏆

source: Great! I’m excited to see the photo. Can you upload it now please? 📸
sot: Ke hantle! Ke thabetse ho bona foto! Na o ka e aplouta hona jwale hle? 📸

source: Which category best describes the activity you just did?
sot: Ke mokgahlelo ofe o hlalosang hantle ketsahalo eo sa tswang ho e etsa?

source: That’s a great photo! What’s the story behind it?
sot: Eo ke foto e ntle haholo! Ditaba tsa yona ke dife?

source: Thank you for sharing, keep up the good work! 💪
sot: Re a leboha ka ho abelana, dula o sebetsa jwalo! 💪
