Repository: Ari-Ramkilowan/po-files
Catalog: translations/League(Release (open))_South Ndebele.po
Languages: nbl

source: Main menu
nbl: Irhelo eliqakathekileko

source: Creativity
nbl: Ubukghwari

source: Sorry something went wrong, please retry.
nbl: Tjhebetjhebe, kukhona okungakakhambi kuhle, ngibawa ulinge godu.

source: Taking Action
nbl: Ukwenza

source: Share activity
nbl: Abelana ngomsebenzi

source: You can improve your score in the league by sharing photos and stories about your club activities. 🏆
nbl: Ungathuthukisa amaphuzu wakho ngokuthumela iinthombe, iinolwana nokhunye enikwenzako. 🏆

source: Great! I’m excited to see the photo. Can you upload it now please? 📸
nbl: Kuhle! Kuyangithokozisa ukubona isithombe. Ungasithumela ngiyabawa? 📸

source: Which category best describes the activity you just did?
nbl: Ngiyiphi ikhathegori echaza kuhle lokhu okwenzile?

source: That’s a great photo! What’s the story behind it?
nbl: Sibawa usitjele bona bekwenzakalani?

source: Thank you for sharing, keep up the good work! 💪
nbl: Siyathokoza ukwaba, ragela phambili ngokwenza umsebenzi omuhle.💪
