Repository: Ari-Ramkilowan/po-files
Catalog: translations/LGroup11(Release (open))_Tswana.po
Languages: tsn

source: Read the notes
tsn: Bala dintlha

source: Back to menu
tsn: Boela kwa mmenyung

source: See what you need
tsn: Bona se o se tlhokang

source: See how it works
tsn: Bona kafa o tshamekiwang ka teng

source: This game develops
tsn: Motshameko o o a tswelela:

source: There’s too much bad news in the newspaper, so let’s cut it up and Make a Papier Mache Bowl. ✂📰= 🥣
tsn: Go na le dikgang tse di maswe di le dintsi mo pampiring ya dikgang, a re e segeng ditokitoki mme re Dire Mogopo wa Sedujwa sa Pampiri.✂📰= 🥣

source: To make 6 bowls of mache you will need: * 2 cups flour * 2 cups of water * 1 tablespoon of salt * A mixing bowl and spoon * Strips of newspaper * Paint to decorate
tsn: Gore o dire megoponyana e le 6 ya sedujwa o tla tlhoka: 1. Dikopi di le 2 tsa boupe 2. Dikopi di le 2 tsa metsi 3. Leswana le le 1 la letswai 4. Mogopo wa go tlhakanyetsa le leswana 5. Ditoki tsa dipampiri 6. Pente ya go kgabisa

source: The most important note is don’t eat out of this bowl, because it will fall apart. Also: 1. You can do this to make bowls for the pretend area, or you can do it as an art activity with each child. Make sure you have enough small bowls for each child. 2. You can make other things out of paper mache: A bee using a balloon and cardboard, or get the children to make a papier mache hat or some funny animals.
tsn: Ntlha ya botlhokwa thata ke gore ga go na yo o tshwanetseng go jela mo mogoponyaneng oo, ka gonne o tla thubega. Gape: 1. O ka dira se go dira megopo ya lefelo la go etsisa, kgotsa o ka dira jalo e le tirwana ya botsweretshi le ngwana mongwe le mongwe. Tlhomamisa gore o na le megoponyana e mennye e e lekaneng gore ngwana mongwe le mongwe a nne le one. 2. O ka dira dilo tse dingwe ka sedujwa se sa pampiri: Notshe o dirisa balune le khatabokoso, kgotsa dira gore bana ba dire hutshe ya sedujwa sa dipampiri kgotsa diphologolo dingwe tse di tshegisang.

source: ✔️Exploring & Finding out ✔️Arm & Hand Control
tsn: ✔️Go batla le go bona ✔️Taolo ya lebogo le seatla

source: I should give you a heads up now, that this is a messy business. 👩🏿‍🎨 1. Tear 5 large pieces of newspaper into strips. 2. Mix flour, water and salt in big bowl to make a paste. 3. Take a small bowl – plastic is best. 4. Dip newspaper strips into the paste and layer over the bowl. 5. Do 3 or 4 more layers. 6. Leave to dry for 2 days, or until it’s hard. 7. Gently press it out the bowl. It will pop out. 8. Paint and decorate.
tsn: Jaanong ke tshwanetse go le tlhagisa, gore tiro eno e tlatsa leswe. ‍ 1. Gagola dipampiri tse dikgolo tsa dipampiri tsa dikgang o di dire diseteripi. 2. Tlhakanya boupe, metsi le letswai mo mogopong o mogolo go dira sedujwa. 3. Tsaya mogopo o monnye - wa polasetiki ke one o o botoka. 4. Tsenya diseteripi tsa pampiri ya dikgang mo sedujweng o bo o di ala mo mogopong. 5. Di ale ga 3 kgotsa ga 4. 6. Tlogela di ome malatsi a le 2, go fitlhela di nna thata. 7. Tobetsa ka bonolo mo mogopong oo. E tla tlolela kwa ntle. 8.Penta o bo o kgabise
