Repository: Ari-Ramkilowan/po-files
Catalog: translations/LGroup10(Release (open))_Tsonga.po
Languages: tso

source: See what you need
tso: Vona leswi u swi lavaka

source: See how it works
tso: Vona leswaku swi tirha njhani

source: Read the notes
tso: Hlaya tinotsi

source: Back to menu
tso: Ku tlhelela eka menyu

source: Put your creativity to the test and build 1 fun creature out of Lego. 🦖It’s best to build it before class so that all of the time is spent on the activity
tso: Kambela vuswikoti bya wena bya vutumbuluxi na ku aka xivumbiwa xi 1 xo tsakia ku suka eka LEGO. 🦖 Swi kahle ku xi aka loko tlilasi yi nga se sungula leswaku nkarhi hinkwawo wu ta tirhiseriwa nghingiriko.

source: This game develops
tso: Ntlangu lowu wu ya emahlweni:

source: See who’s the best explorer with Hide the Toy. 🤠
tso: Vona leswaku i mani loyi a tirhaka ku antswa hi Tumbeta Thoyi. 🤠

source: ✔️Skills for Learning ✔️Songs , Rhymes & Sounds
tso: ✔️Swikili swo dyondza ✔️Tinsimu, tirhayimi na mimpfumawulo

source: Read teh notes
tso: Hlaya tinotsi

source: Once you have your unique creation: 1. Show it to all the children. 2. Choose a child to hide the creature. 3. Tell the other children to go outside or close their eyes while it’s being hidden. 4. When hiding, the top of the creature must be showing to make it easier to find. 5. Bring the other children in to look for the creature. 6. Say “hot”, if anyone comes close to it. 7. Say “cold”, when they are far from it. 8. Sing a finding rhyme as they go. 9. Whoever finds it must shout ‘I found it!’ and the game repeats.
tso: Loko se u ti endlerile xivumbiwa xa wena xo hlawuleka: 1. Xi kombi vana. 2. Hlawula n’wana ku va a tumbeta xivumbiwa. 3. Byela vana lavan’wana ku humela ehandle kumbe ku pfala mahlo ya vona loko xi ri karhi xi tumbetiwa. 4. Loko xi tumbetiwa, ehenhla ka xivumbiwa ku fanele ku vonaka leswaku xi ta kumeka hi ku lova. 5. Nghenisa vana lavan’wana ku lava xivumbiwa. 6. U ku “hisa”, loko un’wana a tshunela ekusuhi na xona. 7. U ku “titimela”, loko va ri ekule na xona. 8. Yimbelela tirhayimi to kuma loko va ri karhi va famba. 9. Loyi a xi kumaka u fanele ku huwelela “Ndzi xi kumile!” kutani ntlangu wu vuyelela.

source: If you don’t have Lego blocks or are running out of time use a funky toy. 👾 Make sure you give lots of children chances to hide the toy and help them by giving them clues. The Finding Rhyme Can you spy, with your little eye The creature that’s hiding away? Look with your eyes and you will see What you will find it today.
tso: Loko u ri hava tibuloko ta LEGO kumbe tiri karhi ti lava ku hela, tirhisa thoyi yo tsakisa. 👾 Tityisisa leswaku u nyika vana vo tala minkarhi yo tumbeta thoyi na ku va pfuna hi ku va nyika vuthala. Ku kuma rhayimi U nga swi kota ku hlola, hi xitihlwana xa wena Xivumbiwa lexi nga tumbela? Languta hi mahlo ya wena u ta vona Leswi u nga ta swi kuma namuntlha.
