Repository: Ari-Ramkilowan/po-files
Catalog: translations/LGroup3(Release (open))_Tswana.po
Languages: tsn

source: Read the notes
tsn: Bala dintlha

source: See what you need
tsn: Bona se o se tlhokang

source: Back to menu
tsn: Boela kwa mmenyung

source: See how it works
tsn: Bona kafa o tshamekiwang ka teng

source: I meant it when I said it was easy. All you need is: 1. A big space to play 2. A blindfold
tsn: Ke ne ke bua boammaaruri fa ke ne ke re go bonolo. Se o se tlhokang fela ke: 1. Lebala le legolo le go ka tshamekelwang mo go lone 2. Sebipamatlho

source: This game develops
tsn: Motshameko o o a tswelela:

source: Here are a few handy hints 1. Walk around with your arms out in front of you so that you don’t bump into anything or anyone. 2. Ask if you are hot 🔥 or cold ❄ so that the children can give you clues. 3. Let the older children have a turn with the blindfold if they want.
tsn: Ditlhabobotlhale dingwe ke tse: 1. Nna o tsamaye mabogo a gago a le fa pele gore o se ka wa thula sepe kgotsa ope. 2. Botsa gore a o mogote kgotsa o tsididi ❄ e le gore bana ba kgone go go tlhaba botlhale. 3. Dira gore bana ba bagolwane ba nne le tshono ya go ipipa sefatlhego fa ba batla.

source: Have you played The Blind Man with the children? It’s really easy. 🙈
tsn: A o kile wa tshameka motshameko wa Monna wa Sefofu le bana? Go bonolo fela.🙈

source: Here’s how you play the game: 1. Tell the children you are going to play The Blind Man. 2. Say that you’re going to put a blindfold on so that you can’t see, and show them the blindfold. 3. Find a big space. 4. Ask the children to find a place to stand. 5. They are not allowed to move from that spot. 6. Move through the space with your blindfold on. 7. If you get close to a child, they must shout “hot!” 8. If you are far away, they must shout “cold!” 9. When you find a child, feel their faces and guess who it is.
tsn: Motshamelo ono o tshamekiwa ka tsela e e latelang: 1. Bolelela bana gore o tlile go tshameka Motshameko wa Sefofu. 2. Ba bolelele gore o tlile go ipipa matlho gore o se ka wa kgona go bona, o bo o ba bontsha sebipamatlho 3. Batla sebaka sa seka lebala. 4. Kopa bana go batla lefelo le ba ka emang mo go lone. 5. Ga ba letlelelwe go tswa mo lefelong leo. 6. Nna o tsamaye mo lefelong leo o tswetse matlho. 7. Fa o atamela ngwana mongwe, ngwana oo o tshwanetse go goa a re “go mogote!” 8. Fa e le gore o kgakala thata, ba tshwanetse go goa ba re “go tsididi thata” 9. Fa o bona ngwana, mo tshware sefatlhego o bo o fopholetsa gore ke mang.

source: ✔️Social ✔️Walking & Moving
tsn: ✔️Bokgoni jwa batho ✔️Go tsamaya le go suta
