Repository: Ari-Ramkilowan/po-files
Catalog: translations/LGroup5(Release (open))_Swati.po
Languages: ssw

source: Read the notes
ssw: Fundza emanotsi

source: Back to menu
ssw: Buyela emuva kumenyu

source: See what you need
ssw: Buka kutsi yini loyidzingako

source: See how it works
ssw: Buka kutsi isebenta njani

source: It’s a fun game that’s a little like tag or touchers, but with a twist — you can’t run. 1. You are Gogo. 2. Stand with your back to everyone. 3. Children line up on the other side of the room. 4. When your back is turned, everyone creeps towards you quietly. 5. When you turn around, everyone must freeze where they are. If anyone moves they have to go back to the beginning. 6. You then turn back and let them and get close to you again. 7. The first person who taps you wins. You can even give other children a turn at being Gogo.
ssw: Ngumdlalo lomnandzi lomcane lofana nekudvonsa ubuye weyame, kodvwa loguculiwe kancane – angeke ugijime. 1. UnguGogo. 2. Mani ubafulatsele bonkhe. 3. Bantfwana batawufola ngakulelinye licele lalendlu. 4. Uma ngabe sewufulatsele, bonkhe batawukhasa bete kuwe ngekuthula. 5. Uma ugucuka, wonkhe umuntfu kufanele eme ntsi lapho akhona khona. Uma ngabe kukhona lonyakatako kufanele babuye emuva ekucaleni. 6. Utawugucuka futsi wentele kutsi basondzele kuwe futsi. 7. Umuntfu wekucala lokushayako uyaphumelela. Unganiketa labanye bantfwana litfuba lekuba nguGogo.

source: And that’s it. Easy peazy.
ssw: Sekuphelela. Kulula kakhulu.

source: This game develops
ssw: Lomdlalo utfutfukisa:

source: Sometimes the simplest game is best, like Tap Gogo! 👵🏾
ssw: Ngalesinye sikhatsi lomdlalo lolula kakhulu ngiwo lokahle, njengalotsi Shaya Gogo! 👵🏾

source: ✔️Walking & Moving ✔️Social
ssw: ✔️Kuhamba nekunyakata ✔️Emakhono ekuphila

source: All you need is a big space to move in!
ssw: Lokudzingako nje yindzawo lenkhulu yekunyakata!
