Repository: Ari-Ramkilowan/po-files
Catalog: translations/LGroup1(Release (open))_Afrikaans.po
Languages: afr

source: Read the notes
afr: Lees die notas

source: See what you need
afr: Kyk wat jy nodig het

source: See how it works
afr: Kyk hoe dit werk

source: Back to menu
afr: Terug na die spyskaart

source: This game develops:
afr: Hierdie speletjie ontwikkel:

source: Let’s try the Finding Challenge. 👀
afr: Kom ons probeer Vind-uitdaging (Finding Challenge). 👀

source: This one is easy to get organised, all you need is toys and items (like the ones in the picture) laid out in your play area. 🤖
afr: Hierdie een is maklik om te reël. Al wat jy nodig het, is speelgoed en items (soos dié in die prent) wat in jou speelgebied uitgelê is. 🤖

source: ✔️Social ✔️Talking & Understanding
afr: ✔️Sosiale vaardighede ✔️Praat en verstaan

source: Once everything is laid out on the floor: 1. Get all the children to stand in a circle around the items on the floor. 2. Tell them they have 20 seconds to find an item that matches the description you’re going to give them. 3. Give them a description like soft, blue, big or small. There are more examples in the extra ideas message. 4. Count up to 20 as they search for the right toy or item. 5. Ask each child to show everyone what they picked up and why it matches what you said. 6. Ask older children to shout out ideas of what to look for next.
afr: Sodra alles op die vloer uitgelê is: 1. Laat al die kinders in ’n sirkel rondom die items op die vloer staan. 2. Sê vir hulle dat hulle 20 sekondes het om ’n item te vind wat pas by die beskrywing wat jy hulle gaan gee. 3. Gee hulle ’n beskrywing soos sag, blou, groot of klein. Daar is nog voorbeelde in die ekstra-idees-boodskap. 4. Tel tot 20 terwyl hulle vir die regte speelding of item soek. 5. Vra elke kind om vir almal te wys wat hulle opgetel het en hoekom dit pas by wat jy gesê het. 6. Vra ouer kinders om idees oor wat volgende gevind moet word, uit te roep.

source: When giving the children descriptions to match the items, try these examples: • Soft 🐶 • Hard 👷 • Smooth 🐚 • Rough 🦔 • Long 🦒 • Red 🔴 • Round ⚽ • Square 💾 • Plastic 📏 If two children go for the same item, suggest another item to one of them.
afr: Wanneer jy die kinders beskrywings van passende items gee, probeer die volgende voorbeelde: • Sag 🐶 • Hard 👷 • Glad 🐚 • Grof 🦔 • Lank 🦒 • Rooi 🔴 • Rond ⚽ • Vierkantig 💾 • Plastiek 📏 As twee kinders dieselfde item kies, stel vir een van hulle ’n ander item voor.
