Repository: Ari-Ramkilowan/po-files
Catalog: translations/LGroup7(Release (open))_Afrikaans.po
Languages: afr

source: Read the notes
afr: Lees die notas

source: Back to menu
afr: Terug na spyskaart

source: See what you need
afr: Kyk wat jy nodig het

source: See how it works
afr: Kyk hoe dit werk

source: Let the kids sit around you and: 1. Put all 8 items on a tray. Eg. a comb , toothbrush, teaspoon, coin, fork, crayon, string, elastic band, peg, egg, stick, stone, leaf, lid, ball, shell etc. 🍭🕶🎾🧦⌚🔋🕯🔑🖍📏🥄🌼🧤🥚 2. Let the children look at the tray for a minute, then cover it with the cloth. 3. Without the children take one item off the tray. 4. Remove the cloth. 5. The children have to guess which item is gone. 6. Repeat with another item and ask questions about each item.
afr: Laat die kinders rondom jou sit en: 1. Plaas al 8 items op ’n skinkbord. Byvoorbeeld: ’n kam, tandeborsel, teelepel, muntstuk, vurk, kryt, tou, rekkie, pen, eier, stok, klip, blaar, deksel, bal, skulp, ens. 🍭🕶🎾🧦⌚🔋🕯🔑🖍📏🥄🌼🧤🥚 2. Laat die kinders vir ’n minuut na die skinkbord kyk, en bedek dit dan met die lap. 3. Sonder dat die kinders sien, verwyder een item uit die skinkbord 4. Verwyder die lap. 5. Die kinders moet raai watter item weg is. 6. Herhaal met ’n ander item en vra vrae oor elke item.

source: To keep the kiddies focussed ask some questions like: 1. What is this? 2. Who has one at home? 3. What do you use it for? 4. Who can show me how to use it?
afr: Om die kindertjies gefokus te hou, vra vrae soos: 1. Wat is dit? 2. Wie het een by die huis? 3. Waarvoor gebruik jy dit? 4. Wie kan my wys hoe om dit te gebruik?

source: This game develops
afr: Hierdie speletjie ontwikkel:

source: If the day has been full of physical activities, you might want to balance it with The Memory Game. 🧠
afr: As die dag vol fisiese aktiwiteite was, wil jy dit dalk met die Geheuespeletjie (The Memory Game) balanseer. 🧠

source: ✔️Skills for Learning ✔️Talking & Understanding
afr: ✔️Vaardighede vir leer ✔️Praat en verstaan

source: Sometimes it’s nice to just sit down with 8 small items, a tray and a cloth. Just kidding, that’s not a thing, but it what you need for this activity.
afr: Soms is dit lekker om net te sit met 8 klein items, ’n skinkbord en ’n lap. Ek grap net, dis nie ’n aktiwiteit nie, maar dis wat jy vir hierdie een nodig het.
