Repository: Ari-Ramkilowan/po-files
Catalog: translations/LGroup9(Release (open))_Venda.po
Languages: ven

source: See how it works
ven: Zwi shumisa hani

source: Read the notes
ven: Kha vha vhale notsi

source: Back to menu
ven: Kha vha humele murahu kha zwirengomu

source: See what you need
ven: Zwine vha ṱoḓa

source: It’s a classic game: Follow the Leader.
ven: Ndi mutambo wa kale na kale: Tevhelani Murangaphanḓa.

source: ✔️Social ✔️Emotional
ven: ✔️Vhukoni kha zwa matshilisano ✔️Vhukoni kha kuhumbulele

source: But it’s not just copying, it’s fun so try using actions and sound effects to make the children laugh. 🤡 Here are some action suggestions: Hop, jump, fly, bend down, turn around, put your hands up, hands crossed, quack, moo.
ven: Fhedzi arali vha sa khou kona u edzisela, zwi a takadza na u lingedza u shumisa nyito na mibvumo u seisa vhana. 🤡 Miṅwe mihumbulo asiyi nga ha nyito: fhufhani nga mulenzhe muthihi, fhufhani nga milenzhe yoṱhe, fhufhani nga zwanḓa, kotamani, monani, imisani zwanḓa, fhambanyisani, lilani sa sekwa, itani moo.

source: All you need is wide, open space, you can even play this outside. 🏞
ven: Zwine vha ṱoda ndi tshikhala tsho vuleaho, vha nga tambela nnḓa. 🏞

source: This game develops
ven: Mutambo u bveledza:

source: Let’s see who’s the best copy cat. 😸 1. Get the children to follow a leader, starting with an adult. 2. They have to copy whatever the leader does as they move around, like hopping, putting hands on heads, jumping, running, skipping, doing silly walks, spinning round, waving their arms. 3. Give every child a chance to be the leader.
ven: Kha ri vhone uri vha nga kona u tevhedzela na. 😸 1. Kha vha ri vhana vha tevhele murangaphanḓa, vha thome nga mualuwa. 2. Vha tea u edzisela tshiṅwe na tshiṅwe tshine murangaphanḓa a ita vha tshi khou tshimbila tshimbila, u fana na u fhufha nga mulenzhe muthihi, u vhea zwanḓa kha ṱhoho, u fhufha nga milenzhe yoṱhe, u dia khadi, u pepeleka, u dzunguluwa, u imisa zwanda. 3. Kha vha ṋee ṅwana muṅwe na muṅwe tshikhala tsha u vha murangaphanḓa.
