Repository: Ari-Ramkilowan/po-files
Catalog: translations/LGroup10(Release (open))_Pedi; Sepedi;  Northern Sotho.po
Languages: nso

source: See what you need
nso: Bona se o se hlokago

source: See how it works
nso: Bona ka moo e šomago ka gona

source: Read the notes
nso: Bala dinoutse

source: Back to menu
nso: Re boela morago go menyu

source: Put your creativity to the test and build 1 fun creature out of Lego. 🦖It’s best to build it before class so that all of the time is spent on the activity
nso: Leka mošomo wa gago wa boitlhagišetšo gomme o age sebopiwa se 1 se segišago ka LEGO. 🦖 Go kaokekaone go e aga pele ga bana gore nako ye e lego gona e di šomišwe godimo ga mošomo.

source: This game develops
nso: Papadi ye e kaonafatša:

source: See who’s the best explorer with Hide the Toy. 🤠
nso: Bona gore ke mang yo a lego monyankolli yo mokaonekaone ka Fihla Sebapadišwa. 🤠

source: ✔️Skills for Learning ✔️Songs , Rhymes & Sounds
nso: ✔️Bokgoni bja go ithuta ✔️Dikoša, merethetho le medumo

source: Read teh notes
nso: Bala dinoutse

source: Once you have your unique creation: 1. Show it to all the children. 2. Choose a child to hide the creature. 3. Tell the other children to go outside or close their eyes while it’s being hidden. 4. When hiding, the top of the creature must be showing to make it easier to find. 5. Bring the other children in to look for the creature. 6. Say “hot”, if anyone comes close to it. 7. Say “cold”, when they are far from it. 8. Sing a finding rhyme as they go. 9. Whoever finds it must shout ‘I found it!’ and the game repeats.
nso: Morago ga gore o be le boitlhagišetšo bja moswananoši: 1. E bontšhe bana ka moka. 2. Kgetha ngwana go yo a swanetšego go fihla sebopiwa. 3. Botša bana ba bangwe go ya ka ntle goba go tswalela mahlo a bona ge go fihlwa sebopiwa. 4. Ge a fihla, bogodimo bja sebopiwa bo swanetše go ba bo bonala gore go be bonolo kudu go se hwetša. 5. Bitša bana ba bangwe gore ba tle ba lebelele sebopiwa. 6. E re “fiwa”, ge mang le mang e tle kgauswi le sona. 7. E re “tonya”, ge ba le kgole le yona. 8. Opela košana ya hwetša ge ba e ya. 9. Mang le mang yo a e hwetšago o swanetše go goeletša “Ke e hweditše!” gomme papadi e bušeletšwe.

source: If you don’t have Lego blocks or are running out of time use a funky toy. 👾 Make sure you give lots of children chances to hide the toy and help them by giving them clues. The Finding Rhyme Can you spy, with your little eye The creature that’s hiding away? Look with your eyes and you will see What you will find it today.
nso: Ge e le gore ga o na dipoloko tša LEGO goba di a fela, šomiša sebapadišwa se segišago. 👾 Kgonthiša gore o fa bontši bja bana dibaka tša go fihla sebapadišwa le go ba thuša ka go ba fa tshedimošo. Košana ya Go hwetša O ka dira tša botlhodi ka mahlo a gago a mannyane Sebopiwa se se khutilego? Lebelela ka mahlo a gago gomme o tla bona Ke eng seo o tla se hwetšago lehono.
