Repository: Ari-Ramkilowan/po-files
Catalog: translations/LGroup5(Release (open))_Tsonga.po
Languages: tso

source: Read the notes
tso: Hlaya tinotsi

source: Back to menu
tso: Ku tlhelela eka menyu

source: See what you need
tso: Vona leswi u swi lavaka

source: See how it works
tso: Vona leswaku swi tirha njhani

source: It’s a fun game that’s a little like tag or touchers, but with a twist — you can’t run. 1. You are Gogo. 2. Stand with your back to everyone. 3. Children line up on the other side of the room. 4. When your back is turned, everyone creeps towards you quietly. 5. When you turn around, everyone must freeze where they are. If anyone moves they have to go back to the beginning. 6. You then turn back and let them and get close to you again. 7. The first person who taps you wins. You can even give other children a turn at being Gogo.
tso: I ntlangu wo tsakisa lowu fanakanyana na xiswathe, kambe wu hambanilenyana na xona – a wu tsutsumi. 1. U Kokwana. 2. Yima u fularhela vanhu hinkwavo. 3. Vana va longoloka etlhelo lerinw’ana ra kamara. 4. Loko nhlana wa wena wu jikisiwa, hinkwavo va nyandlamela va ta eka wen va miyerile. 5. Loko u hundzuluka, hinkwavo va fanele va yima laha va nga kona va nga tshukunyuki, Loko un’wana o famba u fanele ku tlhelela ekusunguleni. 6. Kutani u tlhelela endzhaku u endla leswaku a va ekusuhi na wena nakambe. 7. Munhu wo sungula loyi a ku phakataka wa wina. U nga nyika na vana lavan’wana nkarhi wo va Kokwana.

source: And that’s it. Easy peazy.
tso: Hi swona sweswo. Swi olovile.

source: This game develops
tso: Ntlangu lowu wu ya emahlweni:

source: Sometimes the simplest game is best, like Tap Gogo! 👵🏾
tso: Nkari wun’wana ntlangu wo olova hi wona wo antswa, Ku fana na Kokwana Phakata! 👵🏾

source: ✔️Walking & Moving ✔️Social
tso: ✔️Ku famba na ku fambafamba ✔️Swikili swa vumhunhu

source: All you need is a big space to move in!
tso: U lava ntsena ndhawu leyikulu yo famba eka yona!
