Repository: Ari-Ramkilowan/po-files
Catalog: translations/LGroup11(Release (open))_Southern Sotho.po
Languages: sot

source: Read the notes
sot: Bala dinoutso

source: Back to menu
sot: Kgutlela ho menu

source: See what you need
sot: Sheba seo o se hlokang

source: See how it works
sot: Bona hore e sebetsa jwang

source: This game develops
sot: Papadi ena e ntshetsa pele:

source: There’s too much bad news in the newspaper, so let’s cut it up and Make a Papier Mache Bowl. ✂📰= 🥣
sot: Ho na le ditaba tse ngata tse mpe dikoranteng, kahoo, kahoo ha re di seheng mme re etse Sekotlolo sa Motswako wa Pampiri (Papier Mache Bowl.) ✂📰= 🥣

source: To make 6 bowls of mache you will need: * 2 cups flour * 2 cups of water * 1 tablespoon of salt * A mixing bowl and spoon * Strips of newspaper * Paint to decorate
sot: Ho etsa dikotlolo tse 6 tsa mache o tla hloka: 1. Dikopi tse 2 tsa folouru 2. Dikopi tse 2 tsa metsi 3. Kgaba e 1 ya letswai 4. Sejana sa ho tswaka le kgaba 5. Dikgetjhana tsa koranta 6. Pente bakeng sa ho kgabisa

source: The most important note is don’t eat out of this bowl, because it will fall apart. Also: 1. You can do this to make bowls for the pretend area, or you can do it as an art activity with each child. Make sure you have enough small bowls for each child. 2. You can make other things out of paper mache: A bee using a balloon and cardboard, or get the children to make a papier mache hat or some funny animals.
sot: Ntlha ya bohlokwahadi ke hore ho se be le motho ya jelang ka hara sekotlolo sena, hobane se tla tjhwatleha. Hape: 1. O ka etsa sena ho etsa dikotlolo bakeng sa sebaka sa nketsisane, kapa o ka etsa sena jwaloka ketsahalo ya bonono le ngwana k among. Etsa bonnete ba hore o na le dikotlolwana tse lekaneng bakeng sa ngwana ka mong. 2. O ka nna wa etsa dintho tse ding ka hlama(mache) ya pampiri: Notshi o sebedisa balunu le khateboto, kapa o re bana ba etse katiba ya hlama ya pampiri kapa phoofolo e nngwe feela e qabolang.

source: ✔️Exploring & Finding out ✔️Arm & Hand Control
sot: ✔️Ho sibolla le ho fumana dikarabo ✔️Taolo ya sephaka le letsoho

source: I should give you a heads up now, that this is a messy business. 👩🏿‍🎨 1. Tear 5 large pieces of newspaper into strips. 2. Mix flour, water and salt in big bowl to make a paste. 3. Take a small bowl – plastic is best. 4. Dip newspaper strips into the paste and layer over the bowl. 5. Do 3 or 4 more layers. 6. Leave to dry for 2 days, or until it’s hard. 7. Gently press it out the bowl. It will pop out. 8. Paint and decorate.
sot: Ke lokela ho o eletsa esale jwale, ona ke mosebetsi o silafatsang. 👩🏿‍🎨 1. Tabola dikgetjhana tse 5 tse kgolo tsa koranta o di etse metjeketla. 2. Tswaka folouro, metsi le letswai ka hara sekotlolo se seholo ho etsa hlama. 3. Nka sekotlolo se senyane – sa polasetiki ke sona se lokileng. 4. Qopetsa metjeketla ya koranta ka hara hlama mme o e ale ka hara sekotlolo. 5. Etsa mealo e meng e 3 kapa e 4. 6. E tlohele hore e ome matsatsi a 2, kapa ho fihlela e le thata. 7. E petetse ha bonolo o e ntshe ka sekotlolong. E tla tlolela ka ntle 8. E pente o e kgabise.
