Repository: Ari-Ramkilowan/po-files
Catalog: translations/LGroup2(Release (open))_Zulu.po
Languages: zul

source: See what you need
zul: Bheka ukuthi yini oyidingayo

source: See how it works
zul: Bheka ukuthi kusebenza kanjani

source: Read the notes
zul: Funda amanothi

source: Back to menu
zul: Buyela kumenyu

source: This game develops:
zul: Lo mdlalo uthuthukisa:

source: Why not tell The Feelings Story? 🎭
zul: Kungani ungaxoxi Indaba Yemizwa? 🎭

source: ✔️Social ✔️Emotional
zul: ✔️Amakhono okuphilisana emphakathini ✔️Amakhono emizwelo

source: This game is all about imagination, so all you need is the children, and the story in the notes,or you can use puppets.
zul: Lo mdlalo umayelana nokusabalalisa ingqondo nje, ngakho konke okudingayo yizingane, kanye nendaba esemanothini, noma ungasebenzisa ama-puppet.

source: Get ready for some acting! Lights, camera, action! 🎬 1. Tell the children the story, using puppets if you have them. 2. If not, use lots of actions, facial expressions and different voices to make it exciting. 3. Then ask the children to stand up. 4. Tell them the story again, one line at a time and ask the children to do the actions of the character Mandla. 5. Also encourage them to do facial expressions by saying, “what does a sad face look like?” or “show me a happy face.” 6. Encourage them to take part and do any action they want to, so that they’re a part of the story.
zul: Lungela ukulingisa! Izibani, ikhamera, qhu! 🎬 1. Xoxela izingane indaba, usebenzisa ama-prop uma unawo. 2. Uma kungenjalo, sebenzisa izenzo eziningi, usebenzise ubuso ushintshashintshe iphimbo ukuze wenze kuthathekise.. 3. Bese ucela izingane ukuba zisukume. 4. Phinda uzixoxele indaba futhi, umugqa owodwa ngesikhathi bese ucela izingane zilingise izenzo zomlingiswa uMandla. 5. Phinda uzikhuthaze zilinganise ngobuso uthi, "Ubuso ubudabukayo bunjani?" Noma "Ngibonise ubuso obujabule.” 6. Zikhuthaze ukuba zizibandakanye futhi zenze noma yiziphi izinzo ezifuna ukuzenza, ukuze zibe yingxenye yendaba.

source: 1. Mandla wants to go and play with his friend Lebo (he’s excited) 😃 2. Mandla’s mama says he can go (he’s happy) 🙂 3. Mandla walks to Lebo’s house (he’s walking)🚶 4. When he gets to Lebo’s house she’s not there (he’s sad) 😞 5. So Mandla sits on the step and waits for her (he sits and feels tired) 😓 6. Lebo’s mama arrives (he’s pleased) 😁and Mandla asks where Lebo is (he’s polite) 🗣 7. She says that Lebo has gone to Mandla’s house (he’s surprised) 😱 8. Mandla runs home to find Lebo (he’s running). 🏃 9. She is there and he is happy. 😆 10. He hugs her. 🤗 You can add to the story to make it more exciting and give the children more chances to mime actions or express feelings.
zul: 1. UMandla ufuna ukuhamba ayodlala nomngani wakhe uLebo (ujabule). 😃 2. Unina kaMandla uthi angahamba (weneme). 🙂 3. UMandla uyahamba uya kuba kaLebo (uyahamba).🚶 4. Uma efika kubo kaLebo ufika engekho (uyajabha). 😞 5. Ngakho uMandla uhlala ezitebhisini amlinde (uyahlala azizwe ekhathele). 😓 6. Unina kaLebo uyafika (uyajabula) 😁 uMandla ubuza ukuthi uLebo ukuphi (ubuza ngesizotha). 🗣 7. Uthi uLebo uye kubo kaMandla (uyamangala). 😱 8. UMandla uyagijima uyofuna uLebo (uyagijima). 🏃 9. Umfica khona futhi uyajabula. 😆 10. Uyamgona. 🤗 Ungengeza endabeni ukuze uyenze iba mnandi kakhulu futhi unikeze izingane amanye amathuba okulingisa izenzo nokubonisa imizwa.

source: This is the story, as well as Mandla’s actions and emotions:
zul: Nansi indaba, kanjalo nenzenzo nemizwelo kaMandla:
