Repository: Ari-Ramkilowan/po-files
Catalog: translations/LGroup11(Release (open))_Venda.po
Languages: ven

source: Read the notes
ven: Kha vha vhale notsi

source: Back to menu
ven: Kha vha humele murahu kha zwirengomu

source: See what you need
ven: Zwine vha ṱoḓa

source: See how it works
ven: Zwi shumisa hani

source: This game develops
ven: Mutambo u bveledza:

source: There’s too much bad news in the newspaper, so let’s cut it up and Make a Papier Mache Bowl. ✂📰= 🥣
ven: Hu na mafhungo a si avhuḓi mannzhi kha gurannḓa, zwenezwo kha ri a gere ri ite Tshidongo nga Mabammbiri Nga Suko. ✂📰= 🥣

source: To make 6 bowls of mache you will need: * 2 cups flour * 2 cups of water * 1 tablespoon of salt * A mixing bowl and spoon * Strips of newspaper * Paint to decorate
ven: U ita zwidongo zwa rathi (6)nga suko vha ḓo ṱoḓa: 1. Khaphu mbili (2) dza fuḽauru 2. Khaphu mbili (2) dza maḓi 3. Tshipuni tshiṱuku tshithihi (1)tsha muṋo 4. Tshidongo tsha u ṱanganyisela na lebula 5. Zwibammbiri zwisekene zwa gurannḓa 6. Pennde ya u khavhisa

source: The most important note is don’t eat out of this bowl, because it will fall apart. Also: 1. You can do this to make bowls for the pretend area, or you can do it as an art activity with each child. Make sure you have enough small bowls for each child. 2. You can make other things out of paper mache: A bee using a balloon and cardboard, or get the children to make a papier mache hat or some funny animals.
ven: Tsha ndemesa ndi tshauri a hu na ane a tea u ḽela kha tshidongo itsho, ngauri tshi ḓo pwashekana. Zwiṅwe hafhu: 1. Vha ite izwi u vhumba zwidongo zwa u khavhisa kha vhuṅwe vhupo, kana u zwi ita sa mushumo wa vhutsila na ṅwana muṅwe na muṅwe. Kha vha vhone uri vha na zwidongo zwiṱuku u itela ṅwana muṅwe na muṅwe 2. Vha nga dovha vha ita na zwiṅwe zwithu nga suko iḽi. Ṋotshi vha tshi khou shumisa baḽoni na khathibogisi, kana uri vhana vha ite muṅadzi nga suko kana zwiṅwe zwipuka zwi seisaho.

source: ✔️Exploring & Finding out ✔️Arm & Hand Control
ven: ✔️U ṱoḓisisa na u wanulusa ✔️Ndaulo ya tshanḓa tshoṱhe

source: I should give you a heads up now, that this is a messy business. 👩🏿‍🎨 1. Tear 5 large pieces of newspaper into strips. 2. Mix flour, water and salt in big bowl to make a paste. 3. Take a small bowl – plastic is best. 4. Dip newspaper strips into the paste and layer over the bowl. 5. Do 3 or 4 more layers. 6. Leave to dry for 2 days, or until it’s hard. 7. Gently press it out the bowl. It will pop out. 8. Paint and decorate.
ven: Tsivhudzo ndi ya uri, uyu ndi mushumo wo tangananaho. 👩🏿‍🎨 1. Kha vha dzhie zwipiḓa zwiṱanu (5) zwa gurannḓa vha zwi gere zwi vhe zwi sekene. 2. Kha vha ṱanganyise fulauru, maḓi na muṋo kha tshidongo tshihulwane vha ite bwindi. 3. Kha vha dzhie tshidongo tshiṱuku – tsha puḽasiṱiki ndi tshone tsha khwine. 4. Kha vha mbwandamedze gurannḓa kha bwindi vha ite mbemba nga tshidongo. 5. Kha vha ite ngauralo zwi ite mbemba 3 kana nṋa kana dzi fhiraho idzo. 6. Kha vha litshe zwi ome lwa maḓuvha mavhili, kana u swika vha tshi pfa uri zwo oma. 7. Kha vha bvise zwavhuḓi kha tshidongo. Zwi ḓo bva. 8. Kha vha pennde vha khavhise.
