Repository: Ari-Ramkilowan/po-files
Catalog: translations/LGroup1(Release (open))_Tswana.po
Languages: tsn

source: Read the notes
tsn: Bala dintlha

source: See what you need
tsn: Bona se o se tlhokang

source: See how it works
tsn: Bona kafa o tshamekiwang ka teng

source: Back to menu
tsn: Boela kwa mmenyung

source: This game develops:
tsn: Motshameko o o dira:

source: Let’s try the Finding Challenge. 👀
tsn: A re lekeng motshameko wa Kgwetlho ya go Batla👀

source: This one is easy to get organised, all you need is toys and items (like the ones in the picture) laid out in your play area. 🤖
tsn: O o motlhofo go o rulaganya, se o se tlhokang fela ke dithoye le dilo (tse di tshwanang le tse di mo setshwantshong) di beilwe mo lefelong le le tshamekelang mo go lone. 🤖

source: ✔️Social ✔️Talking & Understanding
tsn: ✔️Bokgoni jwa batho ✔️Go bua le go tlhaloganya

source: Once everything is laid out on the floor: 1. Get all the children to stand in a circle around the items on the floor. 2. Tell them they have 20 seconds to find an item that matches the description you’re going to give them. 3. Give them a description like soft, blue, big or small. There are more examples in the extra ideas message. 4. Count up to 20 as they search for the right toy or item. 5. Ask each child to show everyone what they picked up and why it matches what you said. 6. Ask older children to shout out ideas of what to look for next.
tsn: Fa sengwe le sengwe se sena go bewa mo bodilong. 1. Dira gore bana botlhe ba eme ba dirile mosako go dikologa dilo tse di fa fatshe. 2. Ba bolelele gore ba na le metsotswana e le 20 e ba tshwanetseng go bona selo se se nyalanang le tlhaloso e o tlileng go ba naya yone. 3. Ba neye tlhaloso e e jaaka bonolo, boluo, kgolo kgotsa nnye. Go na le dikai tse dingwe mo molaetseng wa megopolo e mengwe. 4. Bala go fitlha go 20 fa ba ntse ba batla thoye e e tshwanetseng kgotsa selwana. 5. Kopa ngwana mongwe le mongwe gore a bontshe mongwe le mongwe se a se tsereng le gore goreng se nyalana le se o se buileng. 6. Kopa bana gore ba goele kwa godimo megopolo ya se ba tshwanetseng go se batla moragonyana.

source: When giving the children descriptions to match the items, try these examples: • Soft 🐶 • Hard 👷 • Smooth 🐚 • Rough 🦔 • Long 🦒 • Red 🔴 • Round ⚽ • Square 💾 • Plastic 📏 If two children go for the same item, suggest another item to one of them.
tsn: Fa o naya bana ditlhaloso tse di nyalanang le dilo, leka dikai tse di latelang: • Bonolo 🐶 • Thata 👷 • Borethe 🐚 • Magwata 🦔 • Telele 🦒 • Khibidu 🔴 • Kgolokwe ⚽ • Sekwere 💾 • Polasetiki 📏 Fa batho ba babedi ba batla go tsaya selo se le sengwe, akantsha gore yo mongwe a tseye selo se sengwe.
