Repository: Ari-Ramkilowan/po-files
Catalog: translations/LGroup7(Release (open))_Southern Sotho.po
Languages: sot

source: Read the notes
sot: Bala dinoutso

source: Back to menu
sot: Kgutlela ho menu

source: See what you need
sot: Sheba seo o se hlokang

source: See how it works
sot: Bona hore e sebetsa jwang

source: Let the kids sit around you and: 1. Put all 8 items on a tray. Eg. a comb , toothbrush, teaspoon, coin, fork, crayon, string, elastic band, peg, egg, stick, stone, leaf, lid, ball, shell etc. 🍭🕶🎾🧦⌚🔋🕯🔑🖍📏🥄🌼🧤🥚 2. Let the children look at the tray for a minute, then cover it with the cloth. 3. Without the children take one item off the tray. 4. Remove the cloth. 5. The children have to guess which item is gone. 6. Repeat with another item and ask questions about each item.
sot: Ere bana ba dule ba o potapotile mme: 1. Bea dintho kaofela tse 8 hodima tereyi. Ho etsa mohlala, kama, borosolo ya meno, kgaba ya teye, khoine, fereko, kerayone, kgwele, rekere, phekse, lehe, thupa, lejwe, lehlaku, sekwahelo, bolo, kgaketla jj. 🍭🕶🎾🧦⌚🔋🕯🔑🖍📏🥄🌼🧤🥚 2. Ere bana ba shebe tereyi nakwana e nyane, mme o e kwahele ka lesela. 3. Bana ba sa sheba, tlosa ntho e le nngwe tereying. 4. Tlosa lesela. 5. Bana ba lokela ho noha hore ke ntho efe e seng e le siyo. 6. Pheta hape ka ntho e nngwe mme o botse dipotso mabapi le ntho ka nngwe.

source: To keep the kiddies focussed ask some questions like: 1. What is this? 2. Who has one at home? 3. What do you use it for? 4. Who can show me how to use it?
sot: Ho etsa hore bana ba dule ba tsepamisitse maikutlo botsa dipotso tse kang: 1. Ke eng ee? 2. Ke mang ya nang le yona habo? 3. Le e sebedisetsa eng? 4. Ke mang ya ka mpontshang hore e sebediswa jwang?

source: This game develops
sot: Papadi ena e ntshetsa pele:

source: If the day has been full of physical activities, you might want to balance it with The Memory Game. 🧠
sot: Haeba letsatsi le ne le tletse diketsahalo tsa mmele, o ka nna wa batla ho le balansisa ka Papadi ya Kgopolo( Memory Game). 🧠

source: ✔️Skills for Learning ✔️Talking & Understanding
sot: ✔️Bokgoni bakeng sa ho ithuta ✔️Ho bua le ho utlwisisa

source: Sometimes it’s nice to just sit down with 8 small items, a tray and a cloth. Just kidding, that’s not a thing, but it what you need for this activity.
sot: Ka nako tse ding ho monate ho itulela fatshe le dintho tse 8, tereyi le lesela. Ke a swaswa, eo ha se ntho, empa ke ntho eo o e hlokang bakeng sa ketsahalo ena.
