Repository: Ari-Ramkilowan/po-files
Catalog: translations/LGroup5(Release (open))_Pedi; Sepedi;  Northern Sotho.po
Languages: nso

source: Read the notes
nso: Bala dinoutse

source: Back to menu
nso: Re boela morago go menyu

source: See what you need
nso: Bona se o se hlokago

source: See how it works
nso: Bona ka moo e šomago ka gona

source: It’s a fun game that’s a little like tag or touchers, but with a twist — you can’t run. 1. You are Gogo. 2. Stand with your back to everyone. 3. Children line up on the other side of the room. 4. When your back is turned, everyone creeps towards you quietly. 5. When you turn around, everyone must freeze where they are. If anyone moves they have to go back to the beginning. 6. You then turn back and let them and get close to you again. 7. The first person who taps you wins. You can even give other children a turn at being Gogo.
nso: Ka papadi ya boithabišo ye e nyakilego go swana le theke goba dikgwathi, eupša ka go šielana – o ka se kitime. 1. Ke wena Koko. 2. Furalela batho ka moka o eme ka maoto. 3. Bana ba dira mothaladi ka lehlakoreng le lengwe la phapoši. 4. Ge o retologa, batho ka moka ba gagaba ka setu ba lebile go wena. 5. Ge o sokologa, mang le mang o swanetše go gatsela kae le kae moo ba lego gona. Ge yo mongwe a sepela ba swanetše go boela morago mathomong. 6. Gomme o gomela morago gomme wa ba dumelela go go batamela gape. 7. Motho wa mathomo yo a go kgwathago ke mofenyi. O ka fa le bana ba bangwe sebaka sa go ba Koko.

source: And that’s it. Easy peazy.
nso: Ke ka moo e lego ka gona. Easy peazy.

source: This game develops
nso: Papadi ye e kaonafatša:

source: Sometimes the simplest game is best, like Tap Gogo! 👵🏾
nso: Ka dinako tše dingwe go kaone go raloka papadi ye bonolonolo, go swana le Kgwatha Koko! 👵🏾

source: ✔️Walking & Moving ✔️Social
nso: ✔️Go sepela ka maoto le go šutha ✔️Bokgoni bja leago

source: All you need is a big space to move in!
nso: Tšeo o di hlokago ke sekgoba se segolo moo o ka sepelago gona!
