Repository: Ari-Ramkilowan/po-files
Catalog: translations/LGroup5(Release (open))_Xhosa.po
Languages: xho

source: Read the notes
xho: Funda amanqaku

source: Back to menu
xho: Buyela kwimenyu

source: See what you need
xho: Bona okudingayo

source: See how it works
xho: Jonga ukuba isebenza njani

source: It’s a fun game that’s a little like tag or touchers, but with a twist — you can’t run. 1. You are Gogo. 2. Stand with your back to everyone. 3. Children line up on the other side of the room. 4. When your back is turned, everyone creeps towards you quietly. 5. When you turn around, everyone must freeze where they are. If anyone moves they have to go back to the beginning. 6. You then turn back and let them and get close to you again. 7. The first person who taps you wins. You can even give other children a turn at being Gogo.
xho: Ngumdlalo omnandi efana nokuthega okanye ukubamba, kodw kunokujika – awunakubaleka. 1. UnguGogo. 2. Yima ufulathele wonke umntu. 3. Abantwana bame umgca kwelinye icala le ndlu. 4. Xa wena ukuqukile wonke umntu uzokuchwechwela eyhulile. 5. Xa ukuquka, wonke umntu maka frize apho akhoyo. Ukuba omnyeushukumile kufuneka babuyele ekuqaleni. 6. Utsho uguquke ubavumele basondele kuwe kwakhona. 7. Othe wakubamba kuqala ungo phumeleleyo. Unako ukunikeza abanye abantwana ithuba lokuba babengo Gogo nabo.

source: And that’s it. Easy peazy.
xho: Kwaye uko konke. Kulula kakhulu.

source: This game develops
xho: Lo mdlalo uphuhlisa:

source: Sometimes the simplest game is best, like Tap Gogo! 👵🏾
xho: Ngamanye amaxesha umdlalo olula ugqibelele, ofana noChwetha uGogo! 👵🏾

source: ✔️Walking & Moving ✔️Social
xho: ✔️Ukuhamba nokushukuma ✔️Izakhono zasekuhlaleni

source: All you need is a big space to move in!
xho: Konke enikudingayo sisithuba esikhulu ukujikeleza kuso!
