Repository: Ari-Ramkilowan/po-files
Catalog: translations/LGroup11(Release (open))_Pedi; Sepedi;  Northern Sotho.po
Languages: nso

source: Read the notes
nso: Bala dinoutse

source: Back to menu
nso: Re boela morago go menyu

source: See what you need
nso: Bona se o se hlokago

source: See how it works
nso: Bona ka moo e šomago ka gona

source: This game develops
nso: Papadi ye e kaonafatša:

source: There’s too much bad news in the newspaper, so let’s cut it up and Make a Papier Mache Bowl. ✂📰= 🥣
nso: Go na le ditaba tše ntši tše mpe ka kuranteng, ka gona a re e ripe re dire Dira Sebjana sa Pampiri ya Go kgomarela. ✂📰= 🥣

source: To make 6 bowls of mache you will need: * 2 cups flour * 2 cups of water * 1 tablespoon of salt * A mixing bowl and spoon * Strips of newspaper * Paint to decorate
nso: Go dira dibjana tše 6 tša pampiri ya go kgomarela o tla hloka: 1. Komiki tše 2 tša folouru 2. Komiki tše 2 tša meetse 3. Lehwana le 1 la letswai 4. Sebjana sa go hlakanya le lehwana 5. Meseto ya kuranta 6. Pente ya go kgabiša

source: The most important note is don’t eat out of this bowl, because it will fall apart. Also: 1. You can do this to make bowls for the pretend area, or you can do it as an art activity with each child. Make sure you have enough small bowls for each child. 2. You can make other things out of paper mache: A bee using a balloon and cardboard, or get the children to make a papier mache hat or some funny animals.
nso: Ntlha ye bohlokwa ke gore ga go yo a swanetšego go jela ka sebjaneng se, ka lebaka la gore se tla pšhatlega. Gape: 1. O ka dira se go dira dibjana tša lefelo le le akanywago, goba o ka e dira bjalo ka mošomo wa bokgabo le ngwana yo mongwe le yo mongwe. Kgonthiša ngwana yo mongwe le yo mongwe o na le sebjana sa gagwe. 2. O ka dira dilo tše dingwe go tšwa go pampiri ya go kgomarela: Nosi ye e šomišago palune le khatapokisi, goba e re bana ba dire kefa ya pampiri ya go kgomarela goba diphoolofo tše dingwe tše di segišago.

source: ✔️Exploring & Finding out ✔️Arm & Hand Control
nso: ✔️Go nyankolla le go utolla ✔️Taolo ya letsogo le seatla

source: I should give you a heads up now, that this is a messy business. 👩🏿‍🎨 1. Tear 5 large pieces of newspaper into strips. 2. Mix flour, water and salt in big bowl to make a paste. 3. Take a small bowl – plastic is best. 4. Dip newspaper strips into the paste and layer over the bowl. 5. Do 3 or 4 more layers. 6. Leave to dry for 2 days, or until it’s hard. 7. Gently press it out the bowl. It will pop out. 8. Paint and decorate.
nso: Ke swanetše go go fa dintlhakgolo gabjale, gore ye ke kgwebo ya go hlakahlakana. 👩🏿‍🎨 1. Gagola dikarolo tše kgolo tša kuranta tše 5 go ba meseto. 2. Hlakanya folouru, meetse le letswai ka sebjaneng se segolo go dira leraga. 3. Tšea sebjana se se nnyane – sa polastiki ke kaone. 4. Ena meseto ya kuranta ka lerageng gomme o le ale godimo ga sebjana. 5. Dira dillaga tše dingwe tše 3 goba tše 4. 6. Tlogela gore e ome matšatši a 2, goba go fihla e le bothata. 7. E pitle gannyane go tšwa ka sebjaneng. E tla tšwelela. 8. Penta o be o kgabiše.
