Repository: Ari-Ramkilowan/po-files
Catalog: translations/LGroup2(Release (open))_Venda.po
Languages: ven

source: See what you need
ven: Zwine vha ṱoḓa

source: See how it works
ven: Zwi shumisa hani

source: Read the notes
ven: Kha vha vhale notsi

source: Back to menu
ven: Ri khou humela murahu kha zwirengomu

source: This game develops:
ven: Mutambo uyu u bveledza:

source: Why not tell The Feelings Story? 🎭
ven: Ndi ngani vha sa anetsheli tshiṱori tsha vhuḓipfi? 🎭

source: ✔️Social ✔️Emotional
ven: ✔️Vhukoni kha zwa matshilisano ✔️Vhukoni ha zwa muhumbulo/vhuḓipfi

source: This game is all about imagination, so all you need is the children, and the story in the notes,or you can use puppets.
ven: Mutambo uyu u nga ha u humbulela, zwenezwo vha ṱoḓa vhana fhedzi, na notsi dzi re kha tshiṱori, kana vha nga shumisa phaphethe.

source: Get ready for some acting! Lights, camera, action! 🎬 1. Tell the children the story, using puppets if you have them. 2. If not, use lots of actions, facial expressions and different voices to make it exciting. 3. Then ask the children to stand up. 4. Tell them the story again, one line at a time and ask the children to do the actions of the character Mandla. 5. Also encourage them to do facial expressions by saying, “what does a sad face look like?” or “show me a happy face.” 6. Encourage them to take part and do any action they want to, so that they’re a part of the story.
ven: Kha vha ḓidzudzanyele u tamba! Mavhone, Khamera, Nyito! 🎬 1. Kha vha ṱalutshedze vhana tshiṱori, vha tshi khou shumisa phaphethe arali vha nadzo. 2. Arali vha si na, kha vha shumise nyito nnzhi, u fana na tshifaṱuwo na maipfi o fhambanaho u itela uri zwi takadzese. 3. Vha humbele vhana vha ime nga milenzhe. 4. Kha vha dovhe vha vha ṱalutshedze tshiṱori, nga muthihi nga muthihi vha vha humbele vha ite nyito dza mutambi ane a vha Maanḓa. 5. Kha vha dovhe vha vha ṱuṱuwedze na u shumisa tshifhaṱuwo nga u amba uri, “tshifhaṱuwo tsho sinyuwaho tshi vhonala hani?” kana “ntsumedzeni tshifhaṱuwo tsho takalaho.” 6. Kha vha vha ṱuṱuwedze u dzhenelela kha nyito iṅwe na iṅwe ine vha ṱoḓa yone, uri vha kone u dzhenelela kha u vha tshipiḓa tsha tshiṱori.

source: 1. Mandla wants to go and play with his friend Lebo (he’s excited) 😃 2. Mandla’s mama says he can go (he’s happy) 🙂 3. Mandla walks to Lebo’s house (he’s walking)🚶 4. When he gets to Lebo’s house she’s not there (he’s sad) 😞 5. So Mandla sits on the step and waits for her (he sits and feels tired) 😓 6. Lebo’s mama arrives (he’s pleased) 😁and Mandla asks where Lebo is (he’s polite) 🗣 7. She says that Lebo has gone to Mandla’s house (he’s surprised) 😱 8. Mandla runs home to find Lebo (he’s running). 🏃 9. She is there and he is happy. 😆 10. He hugs her. 🤗 You can add to the story to make it more exciting and give the children more chances to mime actions or express feelings.
ven: 1. Maanḓa u khou ṱoḓa u ya u tamba na khonani yawe na khonani yawe Livhu (o takala nga maanḓa). 😃 2. Mme a Maanḓa vho tenda uri a nga ṱuwa (o takalesa). 🙂 3. Maanḓa u dzhena nḓuni ya ha Livhu (u khou tou tshimbila).🚶 4. Musi a tshi dzhena nḓuni ya ha Livhu haho (o vhaisala). 😞 5. Zwenezwo Maanḓa a dzula zwiṱepisini a mu lindela (o dzula fhasi nahone u ḓipfa o neta). 😓 6. Mme a Livhu vha khou dzhena (o takala) 😁 Maanḓa u vhudzisa uri Livhu u ngafhi (o tou khuthala). 🗣 7. Vha mu fhindula uri Livhu o ya ha Maanḓa (u a mangala). 😱 8. Maanḓa u gidimela hayani a wana Livhu (u khou tou gidima). 🏃 9. O mu wana a takalesa. 😆 10 A mu kuvhatedza. 🤗 Vha nga engedza kha tshiṱori itshi uri tshi takadzese na u ṋea vhana zwikhala zwinzhi uri vha edzisele nga nyito kana u sumbedza vhuḓipfi.

source: This is the story, as well as Mandla’s actions and emotions:
ven: Tshiṱori tsho ima ngaurali, khathihi na nyito na vhuḓipfi ha Maanḓa:
