Repository: Ari-Ramkilowan/po-files
Catalog: translations/LGroup5(Release (open))_Afrikaans.po
Languages: afr

source: Read the notes
afr: Lees die notas

source: Back to menu
afr: Terug na spyskaart

source: See what you need
afr: Kyk wat jy nodig het

source: See how it works
afr: Kyk hoe dit werk

source: It’s a fun game that’s a little like tag or touchers, but with a twist — you can’t run. 1. You are Gogo. 2. Stand with your back to everyone. 3. Children line up on the other side of the room. 4. When your back is turned, everyone creeps towards you quietly. 5. When you turn around, everyone must freeze where they are. If anyone moves they have to go back to the beginning. 6. You then turn back and let them and get close to you again. 7. The first person who taps you wins. You can even give other children a turn at being Gogo.
afr: Dit is ’n prettige speletjie wat ’n bietjie soos aan-aan is, maar met ’n kinkel – jy kan nie hardloop nie. 1. Jy is Gogo. 2. Staan met jou rug na almal. 3. Die kinders staan in ’n ry aan die ander kant van die kamer. 4. Wanneer jou rug gedraai is, kruip almal stilletjies na jou toe. 5. Wanneer jy omdraai, moet almal vries waar hulle is. As iemand beweeg, moet hulle teruggaan na die begin. 6. Jy draai dan terug en laat hulle weer nader aan jou kom. 7. Die eerste persoon wat aan jou tik, is die wenner. Jy kan ook vir kinders ’n beurt gee om Gogo te wees.

source: And that’s it. Easy peazy.
afr: En dis dit. Maklik verby.

source: This game develops
afr: Hierdie speletjie ontwikkel:

source: Sometimes the simplest game is best, like Tap Gogo! 👵🏾
afr: Soms is die eenvoudigste speletjie die beste, soos Tik vir Gogo (Tap Gogo)! 👵🏾

source: ✔️Walking & Moving ✔️Social
afr: ✔️Loop en beweeg ✔️Sosiale vaardighede

source: All you need is a big space to move in!
afr: Al wat jy nodig het, is ’n groot ruimte om in te beweeg!
