Repository: Ari-Ramkilowan/po-files
Catalog: translations/LGroup1(Release (open))_Tsonga.po
Languages: tso

source: Read the notes
tso: Hlaya tinotsi

source: See what you need
tso: Vona leswi u swi lavaka

source: See how it works
tso: Vona leswaku swi tirha njhani

source: Back to menu
tso: Ku tlhelela eka menyu

source: This game develops:
tso: Ntlangu lowu wu ya emahlweni:

source: Let’s try the Finding Challenge. 👀
tso: A hi ringeteni Ntlhotlho wo Kuma. 👀

source: This one is easy to get organised, all you need is toys and items (like the ones in the picture) laid out in your play area. 🤖
tso: Leswi swa olova ku swi lulamisa, u lava ntsena tithoyi na tiayitheme (ku fana na leti nga eka xifaniso) leti nga eka ndhawu ya wena yo tlangela. 🤖

source: ✔️Social ✔️Talking & Understanding
tso: ✔️Swikili swo hanyisana na vanhu ✔️Ku vulavula na ku twisisa

source: Once everything is laid out on the floor: 1. Get all the children to stand in a circle around the items on the floor. 2. Tell them they have 20 seconds to find an item that matches the description you’re going to give them. 3. Give them a description like soft, blue, big or small. There are more examples in the extra ideas message. 4. Count up to 20 as they search for the right toy or item. 5. Ask each child to show everyone what they picked up and why it matches what you said. 6. Ask older children to shout out ideas of what to look for next.
tso: Loko hinkwaswo swi veketeriwile ehansi: 1. Endla leswaku vana hinkwavo va yima hi sekele va rhendzela tiayitheme leti nga ehansi. 2. Va byele leswaku va na tisekondi ta 20 ku kuma ayitheme leyi mechaka na nhlamuselo leyi u nga ta va nyika yona. 3. Va nyiki nhlamuselo yo fana na olova, wasi, nkulu kumbe ntsogo. Ku na swikombiso swo tala eka hungu ra mianakanyo yo tatisa. 4. Hlayela ku fika eka 20 loko va ri karhi va secha thoyi leyi lulameleke ayitheme. 5. Byela n’wana un’wana na un’wana ku komba vanhu hinkwavo leswi a swi rholeleke na leswaku hikwalahokayini swi mecha na leswi u nga swi vula. 6. Byela vana lavantsongo ku huwelela mianakanyo ya leswi nga landzelaka ku laviwa.

source: When giving the children descriptions to match the items, try these examples: • Soft 🐶 • Hard 👷 • Smooth 🐚 • Rough 🦔 • Long 🦒 • Red 🔴 • Round ⚽ • Square 💾 • Plastic 📏 If two children go for the same item, suggest another item to one of them.
tso: Loko u nyika vana tinhlamuselo to mechisa na tiaytheme, ringeta swikombiso leswi: • Olova 🐶 • Nonoha 👷 • Rhetela 🐚 • Gwanya 🦔 • Leha 🦒 • Tshwuka 🔴 • Xirhendzevutana ⚽ • Xikwere 💾 • Pulasitiki 📏 Loko vana vambirhi va ya eka ayitheme yin’we, komba n’wana un’wana wa vona ayitheme yin’wana.
