Repository: Ari-Ramkilowan/po-files
Catalog: translations/LGroup6(Release (open))_Tsonga.po
Languages: tso

source: Read the notes
tso: Hlaya tinotsi

source: See what you need
tso: Vona leswi u swi lavaka

source: See how it works
tso: Vona leswaku swi tirha njhani

source: Back to menu
tso: Ku tlhelela eka menyu

source: Horses are great, but not everyone is a pony. 🦄 The kids can pretend to be other animals like elephants, lions, cats, dogs, rabbits etc. Each child can give themselves an animal name. The rhyme you can sing goes like this: Horsie horsie jumping high Horsie horsie touch the sky Horsie horsie go around Horsie horsie touch the ground
tso: Tihanci ti kahle, kambe a hi vanhu hinkwavo va nga hanci yo koma. 🦄 1. Vana va nga encenyeta ku va swihari swin’wana swo fana na tindlopfu, tinghala, swimanga, timbyana, mimpfundla, na swin’wana. 2. N’wana un’wana na un’wana a nga tinyika vito ra xihari. Rhayimi leyi u nga yi yimbelelaka hi leyi: Hanci hanci tlulela ehenhla Hanci hanci khumba xibakabaka Hanci hanci rhendzeleka Hanci hanci khumba ehansi

source: ✔️Songs , Rhymes & Sounds ✔️Walking & Moving
tso: ✔️Tinsimu, Tirhayimi na mimpfumawulo ✔️Ku famba na ku fambafamba

source: Get a small boxes to jump over and a space to move around in. It’s time to see who’s the best horsey. 🎠
tso: Kuma mabokisi lamantsongo mo tlula hi le henhla ka wona na ndhawu yo fambafamba eka yona. I nkarhi wo vona leswaku i mani hanci yo antswa. 🎠

source: This game develops
tso: Ntlangu lowu wu ya emahlweni:

source: If the children have been sitting all morning for the small group activity, it might be nice to get them moving with Jumping Horse. 🐎
tso: Loko ku ri leswaku vana a va tshamile va yimela nghingiriko wa ntlawa lowuntsongo mixo hinkwawo, swi nga va kahle ku endla leswaku va fambafamba hi Hanci yo Tlulatlula. 🐎

source: Start with some basic horse-play🐴 1.Ask the children to stand in a circle and pretend to be a horse. 2. Ask them to make the sound of a horse. 3. Trot around in a circle like horses. 4. Put out a small box and get each child to jump over the box like a horse. 5. Put out a few more boxes for them to jump over. 6. Keep making horse noises as you play. 7.You can add a rhyme if you want.
tso: Sungula hi ntlangu-hanci wa masungulo🐴 1. Byela vana va yima hi sekele va enceyeta ku va hanci. 2. Va byele va endla mpfumawulo wa hanci. 3. Tsutsuma tsutsuma u rhendzeleka hi sekele ku fana na tihanci. 4. Humesa xibokisana kutani u endla leswaku n’wana un’wana na un’wana a xi tlula hi le henhla ku fana na hanci. 5. Humesa mabokisi man’wana mo hlayanyana ku va va tlula hi le henhla ka wona. 6. Yana emahlweni na ku endla mimpfumawulo ya tihanci. 7. U nga engetela rhayimi loko u swi lava
