Repository: Ari-Ramkilowan/po-files
Catalog: translations/LGroup7(Release (open))_Swati.po
Languages: ssw

source: Read the notes
ssw: Fundza emanotsi

source: Back to menu
ssw: Buyela emuva kumenyu

source: See what you need
ssw: Buka kutsi yini loyidzingako

source: See how it works
ssw: Buka kutsi isebenta njani

source: Let the kids sit around you and: 1. Put all 8 items on a tray. Eg. a comb , toothbrush, teaspoon, coin, fork, crayon, string, elastic band, peg, egg, stick, stone, leaf, lid, ball, shell etc. 🍭🕶🎾🧦⌚🔋🕯🔑🖍📏🥄🌼🧤🥚 2. Let the children look at the tray for a minute, then cover it with the cloth. 3. Without the children take one item off the tray. 4. Remove the cloth. 5. The children have to guess which item is gone. 6. Repeat with another item and ask questions about each item.
ssw: Bantfwana abahlale ngakuwe bese: 1. Beka tonkhe letintfo leti-8 kuletreyi. Sibonelo, likamo, sicubho, sipunu, luhlavu lwemali, intsambo, ilasitiki, lipheksi, licandza, indvuku, litje, licembe, simbonyo, ibhola, lugobolondvwe njll. 🍭🕶🎾🧦⌚🔋🕯🔑🖍📏🥄🌼🧤🥚 2. Bantfwana ababuke kuletreyi umzuzwana, bese uyimbonya ngendvwangu. 3. Ngaphandle kwekutsi labantfwana bakubone, susa intfo yinye kuletreyi. 4. Susa lendvwangu. 5. Labantfwana kufanele bacombele kutsi nguyiphi intfo lekhishiwe. 6. Phindza ngalenye intfo bese uyababuta ngentfo ngayinye lekhishiwe.

source: To keep the kiddies focussed ask some questions like: 1. What is this? 2. Who has one at home? 3. What do you use it for? 4. Who can show me how to use it?
ssw: Kugcina labantfwana bahlahlambile kufanele ubabute imibuto lenjengalena: 1. Yini loku? 2. Ngubani lonako ekhaya? 3. Ukusebentiselani? 4. Ngubani longangikhombisa kutsi kusebenta njani?

source: This game develops
ssw: Lomdlalo utfutfukisa:

source: If the day has been full of physical activities, you might want to balance it with The Memory Game. 🧠
ssw: Uma ngabe lilanga lonkhe beneta imisebenti lesebentisa umtimba, ungahle ufune kusimamisa ngekwenta imidlalo yengcondvo. 🧠

source: ✔️Skills for Learning ✔️Talking & Understanding
ssw: ✔️Emakhono ekufundza ✔️Kukhuluma nekuvisisa

source: Sometimes it’s nice to just sit down with 8 small items, a tray and a cloth. Just kidding, that’s not a thing, but it what you need for this activity.
ssw: Ngalesinye sikhatsi kumnandzi kutihlalela netintfo letincane leti-8, itreyi nendvwangu. Utidlalele, loko akusingulutfo, kodvwa ngulotakudzinga kulomsebenti.
