Repository: Ari-Ramkilowan/po-files
Catalog: translations/LGroup6(Release (open))_Zulu.po
Languages: zul

source: Read the notes
zul: Funda amanothi

source: See what you need
zul: Bheka ukuthi yini oyidingayo

source: See how it works
zul: Bheka ukuthi kusebenza kanjani

source: Back to menu
zul: Buyela kumenyu

source: Horses are great, but not everyone is a pony. 🦄 The kids can pretend to be other animals like elephants, lions, cats, dogs, rabbits etc. Each child can give themselves an animal name. The rhyme you can sing goes like this: Horsie horsie jumping high Horsie horsie touch the sky Horsie horsie go around Horsie horsie touch the ground
zul: Amahhashi mahle, kodwa akyena wonke umuntu oyiponi. 🦄 1. Izingane zingazenza ezinye izilwane ezifana nezindlovu, amabhubesi, amakati, izinja, nonogwaja njll. 2. Ingane ngayinye ingaziqamba igama lesilwane. Umlolozelo ongawucula ungathi: Horsie horsie jumping high Horsie horsie touch the sky Horsie horsie go around Horsie horsie touch the ground

source: ✔️Songs , Rhymes & Sounds ✔️Walking & Moving
zul: ✔️Amaculo, imilolozelo nemisindo ✔️Ukuhamba nokunyakaza

source: Get a small boxes to jump over and a space to move around in. It’s time to see who’s the best horsey. 🎠
zul: Thola amabhokisi amancane abazogxuma phezu kwawo nendawo abazonyakaza kuyona. Sekuyisikhathi sokubona ukuthi ubani ihhashi elihamba phambili. 🎠

source: This game develops
zul: Lo mdlalo uthuthukisa:

source: If the children have been sitting all morning for the small group activity, it might be nice to get them moving with Jumping Horse. 🐎
zul: Uma izingane bezilokhu zihlezi kusukela ekuseni ngenxa yomsebenzi weqembu elincane, kungase kube kuhle ukuzinyakazisa nge-Jumping Horse. 🐎

source: Start with some basic horse-play🐴 1.Ask the children to stand in a circle and pretend to be a horse. 2. Ask them to make the sound of a horse. 3. Trot around in a circle like horses. 4. Put out a small box and get each child to jump over the box like a horse. 5. Put out a few more boxes for them to jump over. 6. Keep making horse noises as you play. 7.You can add a rhyme if you want.
zul: Qala ngomdlalo wamahhashi ojwayelekile🐴 1. Tshela izingane zibe isikokela futhi zilingise amahhashi. 2. Zitshele zenze umsindo wehhashi. 3. Telebela uzungeze okwamahhashi. 4. Beka ibhokisi elincane ingane ngayinye ezoleqa njengehhashi. 5. Beka amanye amabhokisi ambalwa abazoweqa. 6. Qhubeka ulokhu wenza umsindo wehhashi ngenkathi kudlalwa. 7. Ungenza nomlolozelo uma uthanda.
