Repository: Ari-Ramkilowan/po-files
Catalog: translations/LGroup1(Release (open))_Zulu.po
Languages: zul

source: Read the notes
zul: Funda amanothi

source: See what you need
zul: Bheka ukuthi yini oyidingayo

source: See how it works
zul: Bheka ukuthi kusebenza kanjani

source: Back to menu
zul: Buyela kumenyu

source: This game develops:
zul: Lo mdlalo uthuthukisa:

source: Let’s try the Finding Challenge. 👀
zul: Ake sizame i-Finding Challenge. 👀

source: This one is easy to get organised, all you need is toys and items (like the ones in the picture) laid out in your play area. 🤖
zul: Lokhu kulula ukukuhlela, konke okudingayo amathoyizi nezinto (njengalezi ezisesithombeni) ezibekwe endaweni yakho yokudlala. 🤖

source: ✔️Social ✔️Talking & Understanding
zul: ✔️Amakhono okuphilisana emphakathini ✔️Ukukhuluma nokuqonda

source: Once everything is laid out on the floor: 1. Get all the children to stand in a circle around the items on the floor. 2. Tell them they have 20 seconds to find an item that matches the description you’re going to give them. 3. Give them a description like soft, blue, big or small. There are more examples in the extra ideas message. 4. Count up to 20 as they search for the right toy or item. 5. Ask each child to show everyone what they picked up and why it matches what you said. 6. Ask older children to shout out ideas of what to look for next.
zul: Uma konke sekubekwe phansi: 1. Tshela zonke izingane zime isikokela zizungeze izinto eziphansi. 2. Zitshele ukuthi zinemizuzwana engama-20 yokuthola into efana nencazelo ozozinika yona. 3. Zinikeze incazelo efana nokuthi ntofontofo, eluhlaza okwesibhakabhaka, enkulu noma encane. Kunezibonelo eziningi emyalezweni owengeziwe wemibono. 4. Bala kuze kufike ku-20 njengoba befuna ithoyizi noma into eyiyo. 5. Cela ingane ngayinye ibonise wonke umuntu ukuthi yini eyithathile nokuthi kungani ihambisana nalokho okushilo. 6. Cela izingane ezindadlana zimemeze imibono yokuthi engabheka elandelayo.

source: When giving the children descriptions to match the items, try these examples: • Soft 🐶 • Hard 👷 • Smooth 🐚 • Rough 🦔 • Long 🦒 • Red 🔴 • Round ⚽ • Square 💾 • Plastic 📏 If two children go for the same item, suggest another item to one of them.
zul: Uma unikeza izingane izincazelo zokufanisa izinto, zama lezi zibonelo: • Ntofontofo 🐶 • Qinile 👷 • Shelelezi 🐚 • Mahhadlahhadla 🦔 • Kude 🦒 • Kubomvu 🔴 • Kuyindilinga ⚽ • Isikwele 💾 • Ipulastiki 📏 Uma izingane ezimbili ziya entweni eyodwa, phakamisa ukuthi enye iye kweyodwa.
