Repository: Ari-Ramkilowan/po-files
Catalog: translations/LGroup10(Release (open))_Xhosa.po
Languages: xho

source: See what you need
xho: Bona okudingayo

source: See how it works
xho: Jonga ukuba isebenza njani

source: Read the notes
xho: Funda amanqaku

source: Back to menu
xho: Buyela kwimenyu

source: Put your creativity to the test and build 1 fun creature out of Lego. 🦖It’s best to build it before class so that all of the time is spent on the activity
xho: Faka ubugcisa bakho kuvavanyo kodwa kwakhe isilwanyana esi 1 kwiLEGO. 🦖 Kuhle ukuyakha ngaphambi kweklasi ukuze lonke ixesha lichithwe kumsebenzi.

source: This game develops
xho: Lo mdlalo uphuhlisa:

source: See who’s the best explorer with Hide the Toy. 🤠
xho: Bona ukuba ngubani umjongisis kaFihla iThoyi. 🤠

source: ✔️Skills for Learning ✔️Songs , Rhymes & Sounds
xho: ✔️Izakhono zokufunda ✔️Ingoma isingqi kunye nesandi

source: Read teh notes
xho: Funda amanqaku

source: Once you have your unique creation: 1. Show it to all the children. 2. Choose a child to hide the creature. 3. Tell the other children to go outside or close their eyes while it’s being hidden. 4. When hiding, the top of the creature must be showing to make it easier to find. 5. Bring the other children in to look for the creature. 6. Say “hot”, if anyone comes close to it. 7. Say “cold”, when they are far from it. 8. Sing a finding rhyme as they go. 9. Whoever finds it must shout ‘I found it!’ and the game repeats.
xho: Xa unendalo yakho eyodwa: 1. Bonisa bonke abantwana. 2. Khetha umntwana ukufihla isidalwa. 3. Xelela abanye abantwana ukuba baphume ngaphandle okanye bavale amehlo abo ngelixa lifihliwe. 4. Xa ukufihla, umphezulu wesidalwa kufuneka ubonakalise ukwenza kube lula ukufumana. 5. Misela abanye abantwana ukuba bajonge isidalwa. 6. Yithi "ashushu", ukuba ubani ufika kufutshane nayo. 7. Yithi "kubanda", xa bekude. 8. Vumani ingoma yokufumana njengoko behamba. 9. Owufumanayo makamemeza athi, "Ndiyifumene!" Kwaye umdlalo uphinda.

source: If you don’t have Lego blocks or are running out of time use a funky toy. 👾 Make sure you give lots of children chances to hide the toy and help them by giving them clues. The Finding Rhyme Can you spy, with your little eye The creature that’s hiding away? Look with your eyes and you will see What you will find it today.
xho: Ukuba awunayo i-LEGO ibhloko okanye uhamba phantsi, sebenzisa ithoyilo elimnandi. 👾 Qinisekisa ukuba unika abantwana abaninzi amathuba okufihla itekityi kwaye uncede ngokubanika izikhombisi. UkuFumana Izingqi Ingaba ungagada, ngeli liso lakho elincinci Isidalwa esizimeleyo? Khangela amehlo akho kwaye uza kubona Yintoni oza kuyifumana namhlanje.
