Repository: Ari-Ramkilowan/po-files
Catalog: translations/LGroup9(Release (open))_South Ndebele.po
Languages: nbl

source: See how it works
nbl: Bona ukuthi isebenza bunjani

source: Read the notes
nbl: Funda amaAwathi

source: Back to menu
nbl: Buyela erhelweni

source: See what you need
nbl: Bona ukuthi utlhoga ini

source: It’s a classic game: Follow the Leader.
nbl: Umdlalo othandekako: Landela umrholi.

source: ✔️Social ✔️Emotional
nbl: ✔️AmakghoAwa aphathelene Awamphakathi ✔️AmakghoAwa aphathelene nemizwa

source: But it’s not just copying, it’s fun so try using actions and sound effects to make the children laugh. 🤡 Here are some action suggestions: Hop, jump, fly, bend down, turn around, put your hands up, hands crossed, quack, moo.
nbl: Kodwana akusikho ukukopa kwaphela, kuzama ukukwenza ngendlela emnandi Awakusebenzisa umdumo ukwenza abantwana bahleke. 🤡 Nakhu okhunye ongakwenza: Yeqa yeqa, yeqa, phapha, gobondela, jika, phakamisa izandla zakho, phambanisa izandla, khwaak, moo.

source: All you need is wide, open space, you can even play this outside. 🏞
nbl: Okutlhogako yindawo ekulu, evulekile, ningadlala nangaphandle. 🏞

source: This game develops
nbl: Umdlalo lo uthuthukisa:

source: Let’s see who’s the best copy cat. 😸 1. Get the children to follow a leader, starting with an adult. 2. They have to copy whatever the leader does as they move around, like hopping, putting hands on heads, jumping, running, skipping, doing silly walks, spinning round, waving their arms. 3. Give every child a chance to be the leader.
nbl: Khesibone bona ngubani okwazi ukukopela ngcoAwa. 😸 1. Tjela abantwana balandele umrholi, kuthome ngomuntu omdala. 2. Kufanele bakopele lokho okwenziwa mrholi nabakhambako, njengokweqa, beka izandla ehloko, ukweqa, ukugijima, ukukhamba kokuhlekisa,phakamisa izandla.. 3. Nikela woke umntwana ithuba lokuba ngumrholi.
