Repository: Ari-Ramkilowan/po-files
Catalog: translations/LGroup5(Release (open))_Tswana.po
Languages: tsn

source: Read the notes
tsn: Bala dintlha

source: Back to menu
tsn: Boela kwa mmenyung

source: See what you need
tsn: Bona se o se tlhokang

source: See how it works
tsn: Bona kafa o tshamekiwang ka teng

source: It’s a fun game that’s a little like tag or touchers, but with a twist — you can’t run. 1. You are Gogo. 2. Stand with your back to everyone. 3. Children line up on the other side of the room. 4. When your back is turned, everyone creeps towards you quietly. 5. When you turn around, everyone must freeze where they are. If anyone moves they have to go back to the beginning. 6. You then turn back and let them and get close to you again. 7. The first person who taps you wins. You can even give other children a turn at being Gogo.
tsn: Ke motshameko o o jesang monate o o tshwanang le theke kgotsa bakgomi, mme o na le pharologanyonyana – ga wa tshwanela go siana. 1. Ke wena Nkoko. 2. Ema o hularetse mongwe le mongwe. 3. Bana ba tlhomagana mo moleng ka kwa ntlheng e nngwe ya phaposi ya borutelo. 4. Fa o ba hularetse, mongwe le mongwe o nanabelela kwa go wena. 5. Fa o gadima, mongwe le mongwe o tshwanetse go gatsela a sa sute fa a leng teng. Fa mongwe a ka tshikhinyega o tshwanetse go boela kwa tshimologong. 6. O tla bo o bahularela gape o ba letla go go atamela gape. 7. Motho wa ntlha yo o go kgomang ke ene mofenyi. Ebile o ka naya bana ba bangwe tshono ya go nna Nkoko.

source: And that’s it. Easy peazy.
tsn: Mme ke one motshameko oo. O bonolo fela jalo.

source: This game develops
tsn: Motshameko o o a tswelela:

source: Sometimes the simplest game is best, like Tap Gogo! 👵🏾
tsn: Fa gongwe motshameko o o bonolo thata ke one o o siameng, o o tshwanang le Kgoma Nkoko! 👵🏾

source: ✔️Walking & Moving ✔️Social
tsn: ✔️Go tsamaya le go suta ✔️Bokgoni jwa batho

source: All you need is a big space to move in!
tsn: Se o se tlhokang fela ke sebaka se segolo gore le tsamaye tsamaye mo go sone!
