Repository: Ari-Ramkilowan/po-files
Catalog: translations/LGroup7(Release (open))_Pedi; Sepedi;  Northern Sotho.po
Languages: nso

source: Read the notes
nso: Bala dinoutse

source: Back to menu
nso: Re boela morago go menyu

source: See what you need
nso: Bona se o se hlokago

source: See how it works
nso: Bona ka moo e šomago ka gona

source: Let the kids sit around you and: 1. Put all 8 items on a tray. Eg. a comb , toothbrush, teaspoon, coin, fork, crayon, string, elastic band, peg, egg, stick, stone, leaf, lid, ball, shell etc. 🍭🕶🎾🧦⌚🔋🕯🔑🖍📏🥄🌼🧤🥚 2. Let the children look at the tray for a minute, then cover it with the cloth. 3. Without the children take one item off the tray. 4. Remove the cloth. 5. The children have to guess which item is gone. 6. Repeat with another item and ask questions about each item.
nso: E re digotlane di dule fase di go raretše gomme o: 1. Tsenye didirišwa ka moka tše 8 ka thereying. Mohlala. sekamo, poraše ya meno, lehwana la teye, tšheletetshipi, foroko, khrayone, thapo, rekere, phekisi, lee, phate, lehlare, sekhurumelo, kgwele, legapi, bjalobjalo. 🍭🕶🎾🧦⌚🔋🕯🔑🖍📏🥄🌼🧤🥚 2. E re bana ba lebelele ka thereying motsotso o tee, gomme o e khupetše ka lešela. 3. Ge bana ba se ba go lebelela, ntšha sedirišwa se tee ka thereying. 4. Tloša lešela. 5. Bana ba swanetše go akanya gore ke sedirišwa sefe se se tlošitšwego. 6. Bušeletša ka sedirišwa se sengwe le go botšiša dipotšišo mabapi le sedirišwa se sengwe le se sengwe.

source: To keep the kiddies focussed ask some questions like: 1. What is this? 2. Who has one at home? 3. What do you use it for? 4. Who can show me how to use it?
nso: Gore digotlane di dule di hlwaile tsebe, botšiša dipotšišo tše bjalo ka: 1. Naa se ke eng? 2. Ke mang yo a nago le yona ka gae? 3. Naa le e šomišetša eng? 4. Ke mang yo a ka mpontšhago ka moo e šomago ka gona?

source: This game develops
nso: Papadi ye e kaonafatša:

source: If the day has been full of physical activities, you might want to balance it with The Memory Game. 🧠
nso: Ge e le gore e bile letšatši le be le tletše ka mešomo ye e nyakago maatla, o ka nyaka go e fokotša ka Papadi ya Kakanyo. 🧠

source: ✔️Skills for Learning ✔️Talking & Understanding
nso: ✔️Bokgoni bja go ithuta ✔️Go bolela le go kwešiša

source: Sometimes it’s nice to just sit down with 8 small items, a tray and a cloth. Just kidding, that’s not a thing, but it what you need for this activity.
nso: Ka dinako tše dingwe go bose go dula fela ka didirišwa tše nnyane tše 8, thereyi le lešela. Ke a swaswa, ga go ka tsela yeo, eupša ke eng se o se hlokago go mošomo wo.
