Repository: Ari-Ramkilowan/po-files
Catalog: translations/LGroup9(Release (open))_Southern Sotho.po
Languages: sot

source: See how it works
sot: Bona hore e sebetsa jwang

source: Read the notes
sot: Bala dinoutso

source: Back to menu
sot: Kgutlela ho menu

source: See what you need
sot: Sheba seo o se hlokang

source: It’s a classic game: Follow the Leader.
sot: Ke papadi ya kgale: Latela Moetapele (Follow the Leader).

source: ✔️Social ✔️Emotional
sot: ✔️Bokgoni ho tsa phedisano ✔️Bokgoni ba ho laola maikutlo

source: But it’s not just copying, it’s fun so try using actions and sound effects to make the children laugh. 🤡 Here are some action suggestions: Hop, jump, fly, bend down, turn around, put your hands up, hands crossed, quack, moo.
sot: Empa ha se ho kopitsa feela, ho monate ho sebedisa diketso le medumo e itseng ho etsa hore bana ba tshehe. 🤡 Ditlhahiso tsa diketso tse itseng ke tsena: Qhoma, tlola, fofa, inama, tjhetjha, phahamisa matsoho, phutha matsoho, lla jwaloka letata, lla jwaloka kgomo.

source: All you need is wide, open space, you can even play this outside. 🏞
sot: Seo o se hlokang ke sebaka se batsi, se bulehileng, le ka nna la bapala papadi ena ka ntle. 🏞

source: This game develops
sot: Papadi ena e ntshetsa pele:

source: Let’s see who’s the best copy cat. 😸 1. Get the children to follow a leader, starting with an adult. 2. They have to copy whatever the leader does as they move around, like hopping, putting hands on heads, jumping, running, skipping, doing silly walks, spinning round, waving their arms. 3. Give every child a chance to be the leader.
sot: Ha re boneng hore bonketsisane ke bomang. 😸 1. Ere bana ba sale moetapele morao, ba qala ka motho e moholo. 2. Ba lokela ho kopitsa seo moetapele a se etsang ha ba ntse ba tsamaya hohle, jwaloka ho tlolatlola, ho bea matsoho hloohong, ho tlola, ho matha, qhomaqhoma, ho tsamaya ka tsela e qabolang, ho potapota, ho phekutsa matsoho. 3. Nea ngwana e mong le e mong monyetla wa ho ba moetapele.
