Repository: Ari-Ramkilowan/po-files
Catalog: translations/LGroup1(Release (open))_Swati.po
Languages: ssw

source: Read the notes
ssw: Fundza emanotsi

source: See what you need
ssw: Buka kutsi yini loyidzingako

source: See how it works
ssw: Buka kutsi isebenta njani

source: Back to menu
ssw: Buyela emuva kumenyu

source: This game develops:
ssw: Lomdlalo utfutfukisa:

source: Let’s try the Finding Challenge. 👀
ssw: Ase sizame kutfola inselele. 👀

source: This one is easy to get organised, all you need is toys and items (like the ones in the picture) laid out in your play area. 🤖
ssw: Lona ulula kuwuhlela, konkhe lokudzingako ngemathoyisi netintfo (njengaleti letikulesitfombe) letiboniswe kulendzawo yakho yekudlala. 🤖

source: ✔️Social ✔️Talking & Understanding
ssw: ✔️Emakhono ekuphila ✔️Kukhuluma nekuvisisa

source: Once everything is laid out on the floor: 1. Get all the children to stand in a circle around the items on the floor. 2. Tell them they have 20 seconds to find an item that matches the description you’re going to give them. 3. Give them a description like soft, blue, big or small. There are more examples in the extra ideas message. 4. Count up to 20 as they search for the right toy or item. 5. Ask each child to show everyone what they picked up and why it matches what you said. 6. Ask older children to shout out ideas of what to look for next.
ssw: Uma konkhe sekundlalwe phansi: 1. Bantfwana bonkhe abeme kundingilizi batungeletele letintfo letibekwe phansi. 2. Batjele kutsi banemasekhondi lange-20 kutsi batfole intfo lehambisana nalenchazelo lotabanika yona. 3. Banikete inchazelo lefana nekutsi kutsambile, kulingangane, kukhulu noma kuncane. Kunetibonelo letinyenti kulomlayeto wemibono lengetiwe. 4. Bala ufike ku-20 ngalesikhatsi babuka lelithoyisi lekungilo. 5. Cela umntfwana ngamunye kutsi akhombise wonkhe umuntfu kutsi kungani ifana naloku lokushilo. 6. Cela bantfwana labadzala kutsi bamemete imibono yekutsi yini lekufanele bakubuke ngalokulandzelako.

source: When giving the children descriptions to match the items, try these examples: • Soft 🐶 • Hard 👷 • Smooth 🐚 • Rough 🦔 • Long 🦒 • Red 🔴 • Round ⚽ • Square 💾 • Plastic 📏 If two children go for the same item, suggest another item to one of them.
ssw: Uma ngabe uniketa bafundzi inchazelo yekucatsanisa letintfo, zama letibonelo: • Kutsambile 🐶 • Kucinile 👷 • Kuyashelela 🐚 • Kulukhuni 🦔 • Kudze 🦒 • Kubovu 🔴 • Kuyindingilizi ⚽ • Sikwele 💾 • Iplastiki 📏 Uma ngabe bantfwana lababili baya entfweni lefanako, ncoma kutsi munye wabo aye kulenye intfo.
