Repository: Ari-Ramkilowan/po-files
Catalog: translations/LGroup6(Release (open))_Southern Sotho.po
Languages: sot

source: Read the notes
sot: Bala dinoutso

source: See what you need
sot: Sheba seo o se hlokang

source: See how it works
sot: Bona hore e sebetsa jwang

source: Back to menu
sot: Kgutlela ho menu

source: Horses are great, but not everyone is a pony. 🦄 The kids can pretend to be other animals like elephants, lions, cats, dogs, rabbits etc. Each child can give themselves an animal name. The rhyme you can sing goes like this: Horsie horsie jumping high Horsie horsie touch the sky Horsie horsie go around Horsie horsie touch the ground
sot: Dipere di lokile haholo, empa ha se bohle bao e leng diponi. 🦄 1. Bana ba ka iketsa eka ke diphoolo tse kang ditlou, ditau, dikatse, dintja, meutlwanyane, jj. 2. Ngwana ka mong a ka nna a fa phoofolo ya hae lebitso. Raeme eo le ka e binang e tjena: Pere Pere tlolela hodimo Pere Pere thetsa marung Pere Pere potoloha hohle Pere Pere thetsa lefatshe

source: ✔️Songs , Rhymes & Sounds ✔️Walking & Moving
sot: ✔️Dipina, diraeme le medumo ✔️Ho tsamaya le ho sisinyeha

source: Get a small boxes to jump over and a space to move around in. It’s time to see who’s the best horsey. 🎠
sot: Batla mabokoso a manyane a ka tlolwang le sebaka seo ho ka tsamauwang ha bonolo ho sona. Ke nako ya ho bona hore ke mang ya ka bang pere e lokileng ho fetang. 🎠

source: This game develops
sot: Papadi ena e ntshetsa pele:

source: If the children have been sitting all morning for the small group activity, it might be nice to get them moving with Jumping Horse. 🐎
sot: Haeba bana haesale ba dula ho tloha hoseng bakeng sa ketsahalo ya dihlotshwana, ho ka ba hotle ho ba etsa mafolofolo ka Pere e Tlolang (Jumping Horse). 🐎

source: Start with some basic horse-play🐴 1.Ask the children to stand in a circle and pretend to be a horse. 2. Ask them to make the sound of a horse. 3. Trot around in a circle like horses. 4. Put out a small box and get each child to jump over the box like a horse. 5. Put out a few more boxes for them to jump over. 6. Keep making horse noises as you play. 7.You can add a rhyme if you want.
sot: Qala ka papadi e bobebe ya dipere🐴 1. Kopa bana ho ema ka sedikadikwe mme ba iketse eka pere. 2. Ere ba etse modumo wa pere. 3. Tshethemang le potoloha sedikadikwe jwaloka dipere. 4. Ntsha lebokoso le lenyane mme o re ngwana ka mong a tlolele ka nqane ho lebokoso jwaloka pere. 5. Ntsha mabokoso a mang hape hore ba a tlole. 6. Dulang le ntse le etsa medumo yap ere ha le ntse le bapala. 7. O ka nna wa kenyeletsa le raeme haeba o batla.
