Repository: Ari-Ramkilowan/po-files
Catalog: translations/LGroup6(Release (open))_Venda.po
Languages: ven

source: Read the notes
ven: Kha vha vhale notsi

source: See what you need
ven: Zwine vha ṱoḓa

source: See how it works
ven: Zwi shumisa hani

source: Back to menu
ven: Kha vha humele murahu kha menyu

source: Horses are great, but not everyone is a pony. 🦄 The kids can pretend to be other animals like elephants, lions, cats, dogs, rabbits etc. Each child can give themselves an animal name. The rhyme you can sing goes like this: Horsie horsie jumping high Horsie horsie touch the sky Horsie horsie go around Horsie horsie touch the ground
ven: Bere ndi dzavhuḓi, fhedzi a si dzoṱhe dzine dza vha dziphony. 🦄 1. Vhana vha nga ḓiita u nga dziṅwe phukha u fana na nḓou, ndau, zwimange, mmbwa, mivhuḓa na zwiṅwevho. 2. Ṅwana muṅwe na muṅwe a nga ḓiṋea dzina ḽa tshipuka. Mutevhetsindo u nga vha nga nḓila i tevhelaho: Bere bere fhufhela nṱha Bere bere fara makole Bere bere monamona Bere bere kanda fhasi

source: ✔️Songs , Rhymes & Sounds ✔️Walking & Moving
ven: ✔️Nyimbo, mitevhetsindo na mibvumo ✔️U tshimbila na u sudzuluwa

source: Get a small boxes to jump over and a space to move around in. It’s time to see who’s the best horsey. 🎠
ven: Kha vha wane tshibogisi tshiṱuku tsha u fhufha nga nṱha na tshikhala tsha u gidimagidima khatsho. Ndi tshifhinga tsha u vhona uri ndi nnyi ane a gada bere lwa khwine. 🎠

source: This game develops
ven: Mutambo u bveledza:

source: If the children have been sitting all morning for the small group activity, it might be nice to get them moving with Jumping Horse. 🐎
ven: Arali vhana vho vha vho dzula tsha matsheloni kha mishumo ya tshigwada tshiṱuku, zwi nga takadza arali vha nga ita uri vha ime ime nga u ita Bere i a Gada. 🐎

source: Start with some basic horse-play🐴 1.Ask the children to stand in a circle and pretend to be a horse. 2. Ask them to make the sound of a horse. 3. Trot around in a circle like horses. 4. Put out a small box and get each child to jump over the box like a horse. 5. Put out a few more boxes for them to jump over. 6. Keep making horse noises as you play. 7.You can add a rhyme if you want.
ven: Kha vha thome nga u tamba bere🐴 1. Kha vha humbele vhana vha ime nga tshidanga vha ḓiite u ngari vha bere. 2. Kha vha vha humbele vha lile sa bere. 3. Kha vha gade vha tshi mona na tshidanga sa bere. 4. Kha vha vhee tshibogisi tshiṱuku uri vhana vha tshi fhufhe u fana na bere. 5. Kha vha engedze maṅwe mabogisi a si gathi vha vha vhudze vha fhufhe nga nṱha hao. 6. Kha bvele phanḓa na u lila sa bere musi vha tshi khou tamba. 7. Vha nga engedza mutevhetsindo arali vha tshi ṱoḓa u ita ngauralo.
