Repository: Ari-Ramkilowan/po-files
Catalog: translations/LGroup8(Release (open))_South Ndebele.po
Languages: nbl

source: Read the notes
nbl: Funda amaAwathi

source: Back to menu
nbl: Buyela erhelweni

source: See what you need
nbl: Bona ukuthi utlhoga ini

source: See how it works
nbl: Bona ukuthi isebenza bunjani

source: The most important thing about this list is that there has to be one per child so that no one feels left out. 1. Clothing for dress up 2. 1 hat per child 3. 1 scarf per child 4. 1 necklace per child 5. 1 pair of sunglasses per child 6. Whatever else you have, as long as there is one per child 7. Music 8. Space to dance
nbl: Into eqakathekileko ngerhelo leli kukuthi kufanele umntwana Awamntwana kufuze abe neyakhe kwenzele bona kungazuba khona abasalela ngaphandle. 1. Itjhila lokwembatha 2. Isgqoko si -1 umntwana ngamunye 3. Isikhafu si – 1 umntwana ngamunye 4. Umncamo mu – 1 umntwana ngamunye 5. Ipara yi – 1 yeembuko zelanga umntwana ngamunye 6. Awama ngabe khuyini, kodwana nakuzoba khona yinye umntwana ngamunye. 7. Umvumo 8. Indawo yokujida

source: There’s nothing like a getting Dressed Up. 💅🏿
nbl: Akukho okumnandi njengokuMbatha - Dressed Up. 💅🏿

source: This game develops
nbl: Umdlalo lo uthuthukisa:

source: ✔️Social ✔️Songs , Rhymes & Sounds
nbl: ✔️AmakghoAwa aphathelene Awamphakathi ✔️Umvumo, amaculo Awamdumo

source: Parents love this game because it teaches children how to dress themselves. 1. Choose 5 types of clothing or props, and make sure there’s enough for each child to have one. 2. Put the items in the middle of the room. 3. Make the children form a circle around the pile of clothes and props. 4. Sing a rhyme or play music. 5. Get the children to dance around. When the music stops, name an item. 6. Each child has to grab one of what you’ve said and put it on, then keep dancing. 7. Carry on until they’re all dressed up.
nbl: Ababelethi bayawuthanda umdlalo lo ngombana ufundisa abantwana ukwembatha. 1. Khetha imihlobo emi – 5 yezembatho uqinisekise bona boke abantwana banazo. 2. Zibeke phakathi nendawo ngekamereni. 3. Ithi abantwana benze isiyingi bazombeleze intundu yeempahla 4. Cula Awama udlale umvumo. 5. Thana abantwana bajide. Umvumo nawuphelako bese babiza into ngegama. 6. Omunye Awamunye umntwana kufanele athathe ambathe bese uragela phambili Awakujida. 7. Niragele phambili baze baphelele bambathe boke.

source: Here are some clothing ideas:👓👛🧥👒👚👖👔👙👠🧦🧤🎩👕🧣👟🧢👜🕶🎒👗 A rhyme you can sing: We are getting dressed We must look our best Dance dance dance And now’s you last chance To put your ___________ ON!
nbl: Nasi eminye imiboAwa yezambatho: 👓👛🧥👒👚👖👔👙👠🧦🧤🎩👕🧣👟🧢👜🕶🎒👗 Iculo ongalicula: Siyembatha Kufuze sibe bahle Jida jida jida Nje lithuba lakho lokugcina Ukwembatha i ___________!
