Repository: Ari-Ramkilowan/po-files
Catalog: translations/LGroup3(Release (open))_South Ndebele.po
Languages: nbl

source: Read the notes
nbl: Funda amaAwathi

source: See what you need
nbl: Bona ukuthi utlhoga ini

source: Back to menu
nbl: Buyela erhelweni

source: See how it works
nbl: Bona ukuthi isebenza bunjani

source: I meant it when I said it was easy. All you need is: 1. A big space to play 2. A blindfold
nbl: Bengiqinisile nangithi ilula. Okutlhogako ngilokhu: 1. Indawo ekulu yokudlala 2. Itjhila lokuvala amehlo

source: This game develops
nbl: Umdlalo lo uthuthukisa:

source: Here are a few handy hints 1. Walk around with your arms out in front of you so that you don’t bump into anything or anyone. 2. Ask if you are hot 🔥 or cold ❄ so that the children can give you clues. 3. Let the older children have a turn with the blindfold if they want.
nbl: Nazi izeluleko ezimbalwa: 1. Khamba ukhuphele izandla zakho phambili wenzela bona ungazokutjhayisa izinto Awama abantu. 2. Buza ukuthi uyatjhisa 🔥 Awama umakhaza ❄ bazokwazi ukukuyelelisa. 3. Abantwana abakhulu bangambatha nabo itjhila nabafunako.

source: Have you played The Blind Man with the children? It’s really easy. 🙈
nbl: Uke wadlala umdlalo othi – Indoda engaboni - The Blind Man nabantwana? Ilula khulu. 🙈

source: Here’s how you play the game: 1. Tell the children you are going to play The Blind Man. 2. Say that you’re going to put a blindfold on so that you can’t see, and show them the blindfold. 3. Find a big space. 4. Ask the children to find a place to stand. 5. They are not allowed to move from that spot. 6. Move through the space with your blindfold on. 7. If you get close to a child, they must shout “hot!” 8. If you are far away, they must shout “cold!” 9. When you find a child, feel their faces and guess who it is.
nbl: Nasi indlela odlalwa ngayo lo mdlalo: 1. Tjela abantwana ukuthi uzodlala umdlalo i- The Blind Man. 2. Itjho bona uzokuvala amehlo ngetjhila wenzele ukuthi ungaboni, batjengise itjhila lokuvala amehle. 3. Thola indawo ekulu. 4. Bawa abantwana ukuthi bathole indawo abazojama kiyo. 5. Abakavumeleki uktjhida lapho. 6. Khamba wembethe itjhila. 7. Nawufika duze Awamntwana, kufanele baklewule ‘uyatjhisa!’ 8. Nawukude kufanele baklewule ‘umakhaza!’ 9. Nawuthola umntwana, mthinte ubuso bese uqagela ukuthi ngubani.

source: ✔️Social ✔️Walking & Moving
nbl: ✔️AmakghoAwa aphathelene Awamphakathi ✔️Ukukhamba Awakusikinyeka
