Repository: Ari-Ramkilowan/po-files
Catalog: translations/LGroup3(Release (open))_Southern Sotho.po
Languages: sot

source: Read the notes
sot: Bala dinoutso

source: See what you need
sot: Sheba seo o se hlokang

source: Back to menu
sot: Kgutlela ho menu

source: See how it works
sot: Bona hore e sebetsa jwang

source: I meant it when I said it was easy. All you need is: 1. A big space to play 2. A blindfold
sot: Ke ne ke tiile ha ke ne ke re ho bonolo. Seo o se hlokang ke: 1. Sebaka se seholo sa ho bapala 2. Lesela le tlamang mahlo

source: This game develops
sot: Papadi ena e ntshetsa pele:

source: Here are a few handy hints 1. Walk around with your arms out in front of you so that you don’t bump into anything or anyone. 2. Ask if you are hot 🔥 or cold ❄ so that the children can give you clues. 3. Let the older children have a turn with the blindfold if they want.
sot: Dikeletso tse mmalwa ke tsena tse ka o thusang: 1. Potoloha phaposi o otlollotse matsoho a hao ka pela hao ele hore o se ke wa thula dintho kapa batho. 2. Ba botse hore ebe o a tjhesa 🔥 kapa o a bata ❄ ele hore bana bat le ba o fe mehlala. 3. Ere bana ba baholwanyane ba fumane sebaka sa ho rwala lesela le foufatsang haeba ba batla jwalo.

source: Have you played The Blind Man with the children? It’s really easy. 🙈
sot: Na o kile wa bapala Monna wa Sefofu mmoho le bana? Ho bonolo ka nnete. 🙈

source: Here’s how you play the game: 1. Tell the children you are going to play The Blind Man. 2. Say that you’re going to put a blindfold on so that you can’t see, and show them the blindfold. 3. Find a big space. 4. Ask the children to find a place to stand. 5. They are not allowed to move from that spot. 6. Move through the space with your blindfold on. 7. If you get close to a child, they must shout “hot!” 8. If you are far away, they must shout “cold!” 9. When you find a child, feel their faces and guess who it is.
sot: Ena ke tsela ya ho bapala papadi ena: 1. Bolella bana hore le tlo bapala Monna wa Sefofu. 2. Ere o tlo kwala mahlo a hao ka lesela ele hore o se ke wa bona, mme o ba bontshe lesela le foufatsang. 3. Batla sebaka se seholo. 4. Ere bana ba batle sebaka seo ba ka emang ho sona. 5. Ha ba a dumellwa ho tloha sebakeng seo ba leng ho sona. 6. Tsamaya hara dibaka o ntse o kwetse mahlo ka lesela. 7. Ha o ka atamela ho ngwana ya itseng, o lokela ho hoeletsa “tjhesa!” 8. Haeba o le hole, o lokela ho hoeletsa “bata!” 9. Ha o ka fumana ngwana, phopholetsa sefahleho sa hae mme o nohe hore ke mang.

source: ✔️Social ✔️Walking & Moving
sot: ✔️Bokgoni ho tsa phedisano ✔️Ho tsamaya le ho sisinyeha
