Repository: Ari-Ramkilowan/po-files
Catalog: translations/LGroup10(Release (open))_Tswana.po
Languages: tsn

source: See what you need
tsn: Bona se o se tlhokang

source: See how it works
tsn: Bona kafa o tshamekiwang ka teng

source: Read the notes
tsn: Bala dintlha

source: Put your creativity to the test and build 1 fun creature out of Lego. 🦖It’s best to build it before class so that all of the time is spent on the activity
tsn: Leka boitlhamedi jwa gago o bo o bopa sebopiwa se le 1 se se tshegisang ka LEGO. 🦖 Go botoka go se dira fa pele ga tlelase gore nako yotlhe e dirisiwe go dirwa tirwana eo.

source: This game develops
tsn: Motshameko o o a tswelela:

source: See who’s the best explorer with Hide the Toy. 🤠
tsn: Bona gore ke mang yo o kgonang go tlhotlhomisa thata ka motshameko wa Fitlha Thoye.🤠

source: ✔️Skills for Learning ✔️Songs , Rhymes & Sounds
tsn: ✔️Bokgoni jwa go ithuta ✔️Dipina , merumo le medumo

source: Read teh notes
tsn: Bala dintlha

source: Once you have your unique creation: 1. Show it to all the children. 2. Choose a child to hide the creature. 3. Tell the other children to go outside or close their eyes while it’s being hidden. 4. When hiding, the top of the creature must be showing to make it easier to find. 5. Bring the other children in to look for the creature. 6. Say “hot”, if anyone comes close to it. 7. Say “cold”, when they are far from it. 8. Sing a finding rhyme as they go. 9. Whoever finds it must shout ‘I found it!’ and the game repeats.
tsn: Fa o na le setlhamiwa sa gago se se sa tshwaneng le sepe 1. Se bontshe bana botlhe. 2. Tlhopha ngwana mongwe gore a fitlhe sebopiwa. 3. Bolelela bana ba bangwe gore ba ye kwa ntle kgotsa ba tswale matlho fa sebopiwa se fitlhiwa. 4. Fa sebopiwa se fitlhilwe, se tshwanetse go ntsha tlhogo gore go nne bonolo go se bona. 5. Bitsa bana ba bangwe gore ba tle go batla sebopiwa. 6. E re “go a fisa”, fa mongwe a tla gaufi le sone. 7. E re “go tsididi”, fa ba le kgakala le sone. 8. Opela morumo wa go batla jaaka ba ntse ba batla. 9. Ope fela yo o se bonang o tshwanetse go goa a re “Ke se bone!” motshameko o bo o boelediwa gape.

source: If you don’t have Lego blocks or are running out of time use a funky toy. 👾 Make sure you give lots of children chances to hide the toy and help them by giving them clues. The Finding Rhyme Can you spy, with your little eye The creature that’s hiding away? Look with your eyes and you will see What you will find it today.
tsn: Fa e le gore ga o na diboloko tsa LEGO kgotsa di go felela, dirisa thoye e e tlwaelegileng fela. 👾 Tlhomamisa gore o naya bana ba le bantsi ditshono tsa go fitlha thoye mme o ba thuse ka go ba tlhaba botlhale. Morumo wa go Batla A o ka nna setlhola, ka matlhonyana Sebopiwa se se iphitlhileng? Leba ka matlho mme o tla bona O tla bona eng gompieno.
