Repository: Ari-Ramkilowan/po-files
Catalog: translations/LGroup3(Release (open))_Venda.po
Languages: ven

source: Read the notes
ven: Kha vha vhale notsi

source: See what you need
ven: Zwine vha ṱoḓa

source: Back to menu
ven: Kha vha humele murahu kha zwirengomu

source: See how it works
ven: Zwi shumisa hani

source: I meant it when I said it was easy. All you need is: 1. A big space to play 2. A blindfold
ven: Zwine nda amba musi ndi tshi uri wo leluwa. Zwine vha ṱoḓa ndi: 1. Tshikhala tshihulwane tsha u tambela 2. Labi ḽa u thivha maṱo

source: This game develops
ven: Mutambo uyu u bveledza:

source: Here are a few handy hints 1. Walk around with your arms out in front of you so that you don’t bump into anything or anyone. 2. Ask if you are hot 🔥 or cold ❄ so that the children can give you clues. 3. Let the older children have a turn with the blindfold if they want.
ven: Dziṅwe tsivhudzo asidzi: 1. Kha vha tshimbile tshimbile zwanḓa zwavho zwo ya phanḓa uri vha songo kuḓana na muthu kana tshiṅwe tshithu. 2. Kha vha vhudzise arali vha tshi khou fhisa kana u rothola u itela uri vhana vha vha ṋee tsivhudzo. 3. Kha vha ri vhana vhahulwane vha rembuluwe na labi ḽa u thivha maṱo arali vha tshi ṱoḓa u ita ngauralo.

source: Have you played The Blind Man with the children? It’s really easy. 🙈
ven: Vho no vhuya vha tamba Munna wa Bofu na vhana? Zwo leluwa nga maanḓa. 🙈

source: Here’s how you play the game: 1. Tell the children you are going to play The Blind Man. 2. Say that you’re going to put a blindfold on so that you can’t see, and show them the blindfold. 3. Find a big space. 4. Ask the children to find a place to stand. 5. They are not allowed to move from that spot. 6. Move through the space with your blindfold on. 7. If you get close to a child, they must shout “hot!” 8. If you are far away, they must shout “cold!” 9. When you find a child, feel their faces and guess who it is.
ven: Vha tamba mutambo uyu nga nḓila i tevhelaho: 1. Kha vha vhudze vhana uri vha khou ya u tamba Munna wa Bofu. 2. Kha vha vha vhudze uri vha khou ya u vha thivha maṱo nga labi uri vha sa kone u vhona, na u vha sumbedza labi iḽo. 3. Kha vha wane tshikhala tshihulwane. 4. Kha vha humbele vhana vha wane fhethu hune vha nga ima hone. 5. A vho ngo tendelwa u sudzuluwa he vha ima hone. 6. Kha vha tshimbile fhethu afho vho vhofha maṱo nga labi. 7. Arali vha tshi swika tsini na ṅwana, vha vhedzelelele. “hu khou fhisa!” 8. Arali vha tshe kule, vha tea u vhidzelelela uri “hu a rothola!” 9. Musi vha tshi wana ṅwana, kha vha phuphuledze zwifhaṱuwo zwavho vha humbulele uri hu nga vha hu nnyi.

source: ✔️Social ✔️Walking & Moving
ven: ✔️Vhukoni kha zwa matshilisano ✔️U tshimbila na u sudzuluwa
