Repository: Ari-Ramkilowan/po-files
Catalog: translations/LGroup8(Release (open))_Tsonga.po
Languages: tso

source: Read the notes
tso: Hlaya tinotsi

source: Back to menu
tso: Ku tlhelela eka menyu

source: See what you need
tso: Vona leswi u swi lavaka

source: See how it works
tso: Vona leswaku swi tirha njhani

source: The most important thing about this list is that there has to be one per child so that no one feels left out. 1. Clothing for dress up 2. 1 hat per child 3. 1 scarf per child 4. 1 necklace per child 5. 1 pair of sunglasses per child 6. Whatever else you have, as long as there is one per child 7. Music 8. Space to dance
tso: Xa nkoka hi nxaxamelo lowu hi leswaku ku fanele ku vana na xin’we xa swilo hinkwaswo xa n’wana un’wana na un’wana leswaku ku nga vi na loyi a titwaka a hlawuriwa. 1. Swambalo swo bomba 2. Xidloko xi 1 hi n’wana 3. Xikhafu xi 1 hi n’wana 4. Chayeni yi 1 ya le nhan’wini hi n’wana 5. Phere yi 1 ya manghilazi ya mahlo hi n’wana 6. Hinkwaswo leswi u nga naswona, ntsena loko ku va na xin’we hi n’wana 7. Vuyimbeleri 8. Ndhawu yo chinela eka yona

source: There’s nothing like a getting Dressed Up. 💅🏿
tso: Ku hava ku Mbala u Bomba. 💅🏿

source: This game develops
tso: Ntlangu lowu wu ya emahlweni:

source: ✔️Social ✔️Songs , Rhymes & Sounds
tso: ✔️Swikili swo hanyisana na vanhu ✔️Tinsimu, tirhayimi na mipfumawulo

source: Parents love this game because it teaches children how to dress themselves. 1. Choose 5 types of clothing or props, and make sure there’s enough for each child to have one. 2. Put the items in the middle of the room. 3. Make the children form a circle around the pile of clothes and props. 4. Sing a rhyme or play music. 5. Get the children to dance around. When the music stops, name an item. 6. Each child has to grab one of what you’ve said and put it on, then keep dancing. 7. Carry on until they’re all dressed up.
tso: Vatswari va rhandza ntlangu lowu hikuva wu dyondzisa vana ku timbarisa. 1. Hlawula 5 wa tinxaka ta swambalo kumbe swiseketelo, na ku vona leswaku ku na swo ringana ku va n’wana un’wana na un’wana a va na xona. 2. Veka tiayitheme exikarhi ka kamara. 3. Endla leswaku vana va endla sekele ku rhendzeleka na nhulu ya swambalo na swiseketelo. 4. Yimbelela rhayimi kumbe u tlangisa vuyimbeleri. 5. Endla leswaku vana va cina va rhendzeleka. Loko vuyimbeleri byi yima, vula vito ra ayitheme. 6. N’wana un’wana na un’wana u fanele ku teka xin’wana xa leswi u nga swi vula a xi mbala, kutani a ya emahlweni no cina. 7. Yana emahlweni ku fikela loko va mbarile hinkwavo.

source: Here are some clothing ideas:👓👛🧥👒👚👖👔👙👠🧦🧤🎩👕🧣👟🧢👜🕶🎒👗 A rhyme you can sing: We are getting dressed We must look our best Dance dance dance And now’s you last chance To put your ___________ ON!
tso: Hi leyi mianakanyo yin’wana ya swo mbala: 👓👛🧥👒👚👖👔👙👠🧦🧤🎩👕🧣👟🧢👜🕶🎒👗 Rhayimi leyi u nga yi yimbelelaka: Ha mbala Hi fanele hi languteka kahle Cina cina cina Sweswi i nkarhi wa wena Wo MBALA ___________ swa wena!
