Repository: Ari-Ramkilowan/po-files
Catalog: translations/LGroup8(Release (open))_Afrikaans.po
Languages: afr

source: Read the notes
afr: Lees die notas

source: Back to menu
afr: Terug na spyskaart

source: See what you need
afr: Kyk wat jy nodig het

source: See how it works
afr: Kyk hoe dit werk

source: The most important thing about this list is that there has to be one per child so that no one feels left out. 1. Clothing for dress up 2. 1 hat per child 3. 1 scarf per child 4. 1 necklace per child 5. 1 pair of sunglasses per child 6. Whatever else you have, as long as there is one per child 7. Music 8. Space to dance
afr: Die belangrikste aspek van hierdie lys is dat daar een van alles per kind moet wees sodat niemand voel hulle word uitgelaat nie. 1. Klere vir aantrek 2. 1 hoed per kind 3. 1 serp per kind 4. 1 halssnoer per kind 5. 1 sonbril per kind 6. Wat jy ook al het, solank daar een vir elke kind is 7. Musiek 8. Ruimte om te dans

source: There’s nothing like a getting Dressed Up. 💅🏿
afr: Daar is niks soos Speel-speel Aantrek (Dressed Up) nie. 💅🏿

source: This game develops
afr: Hierdie speletjie ontwikkel:

source: ✔️Social ✔️Songs , Rhymes & Sounds
afr: ✔️Sosiale vaardighede ✔️Liedjies, rympies en klanke

source: Parents love this game because it teaches children how to dress themselves. 1. Choose 5 types of clothing or props, and make sure there’s enough for each child to have one. 2. Put the items in the middle of the room. 3. Make the children form a circle around the pile of clothes and props. 4. Sing a rhyme or play music. 5. Get the children to dance around. When the music stops, name an item. 6. Each child has to grab one of what you’ve said and put it on, then keep dancing. 7. Carry on until they’re all dressed up.
afr: Ouers hou van hierdie speletjie omdat dit kinders leer hoe om hulself aan te trek. 1. Kies 5 soorte klere of rekwisiete, en maak seker daar’s genoeg vir elke kind om een van alles te hê. 2. Plaas die items in die middel van die kamer. 3. Laat die kinders ’n sirkel rondom die stapel klere en rekwisiete vorm. 4. Sing ’n rympie of speel musiek. 5. Laat die kinders ronddans. Wanneer die musiek stop, noem ’n item. 6. Elke kind moet een van die items gryp wat jy genoem het en dit aantrek, en dan aanhou dans. 7. Hou aan totdat hulle almal aangetrek is.

source: Here are some clothing ideas:👓👛🧥👒👚👖👔👙👠🧦🧤🎩👕🧣👟🧢👜🕶🎒👗 A rhyme you can sing: We are getting dressed We must look our best Dance dance dance And now’s you last chance To put your ___________ ON!
afr: Hier is ’n paar idees vir klere: 👓👛🧥👒👚👖👔👙👠🧦🧤🎩👕🧣👟🧢👜🕶🎒👗 ’n Rympie wat jy kan sing: Ons trek aan Ons moet ons beste lyk Dans dans dans En nou is jou laaste kans Om jou ___________ aan te trek!
