Repository: Ari-Ramkilowan/po-files
Catalog: translations/LGroup3(Release (open))_Swati.po
Languages: ssw

source: Read the notes
ssw: Fundza emanotsi

source: See what you need
ssw: Buka kutsi yini loyidzingako

source: Back to menu
ssw: Buyela emuva kumenyu

source: See how it works
ssw: Buka kutsi isebenta njani

source: I meant it when I said it was easy. All you need is: 1. A big space to play 2. A blindfold
ssw: Bengicinisile uma ngitsi kulula. Udzinga loku: 1. Indzawo lenkhulu yekudlalela 2. Kwekuvala buso

source: This game develops
ssw: Lomdlalo utfutfukisa:

source: Here are a few handy hints 1. Walk around with your arms out in front of you so that you don’t bump into anything or anyone. 2. Ask if you are hot 🔥 or cold ❄ so that the children can give you clues. 3. Let the older children have a turn with the blindfold if they want.
ssw: Naku lokutecwayiso longakusebentisa: 1. Hamba hamba uvule tandla tingembikwakho kute kutsi ungatishayisi noma ushayise umuntfu. 2. Buta kwekutsi ngabe uyashisa 🔥 noma uyabandza ❄ kute kutsi labantfwana bakunikete emasu. 3. Labantfwana lesebabadzadlana nabo bangativala emehlo uma ngabe bafuna.

source: Have you played The Blind Man with the children? It’s really easy. 🙈
ssw: Uke wadlala Indzodza Leyimphumphutse nalabantfwana? Kulula kakhulu. 🙈

source: Here’s how you play the game: 1. Tell the children you are going to play The Blind Man. 2. Say that you’re going to put a blindfold on so that you can’t see, and show them the blindfold. 3. Find a big space. 4. Ask the children to find a place to stand. 5. They are not allowed to move from that spot. 6. Move through the space with your blindfold on. 7. If you get close to a child, they must shout “hot!” 8. If you are far away, they must shout “cold!” 9. When you find a child, feel their faces and guess who it is.
ssw: Lomdlalo udlalwa ngaloluhlobo: 1. Tjela bantfwana kutsi nitawudlala Indvodza Leyimphumphutse. 2. Batjele kutsi utativala emehlo ngendvwangu kute kutsi ungaboni, bese ubabonisa loku lotativala ngako. 3. Tfola indzawo lenkhulu. 4. Cela labantfwana batfole indzawo labatawuma kuyo. 5. Abakavumeleki kutsi basuke kuleyo ndzawo. 6. Hamba hamba kuleyo ndzawo uvalwe emehlo. 7. Uma sewusedvute nemtfwana, kufanele bamemete batsi “kuyashisa!” 8. Uma ukhashane kakhulu, kufanele bamemete batsi “kuyabandza!” 9. Uma utfola umntfwana, bamba buso babo bese uyacambela kutsi ngubani.

source: ✔️Social ✔️Walking & Moving
ssw: ✔️Emakhono ekuphila ✔️Kuhamba nekunyakata
