Repository: Ari-Ramkilowan/po-files
Catalog: translations/LGroup8(Release (open))_Pedi; Sepedi;  Northern Sotho.po
Languages: nso

source: Read the notes
nso: Bala dinoutse

source: Back to menu
nso: Re boela morago go menyu

source: See what you need
nso: Bona se o se hlokago

source: See how it works
nso: Bona ka moo e šomago ka gona

source: The most important thing about this list is that there has to be one per child so that no one feels left out. 1. Clothing for dress up 2. 1 hat per child 3. 1 scarf per child 4. 1 necklace per child 5. 1 pair of sunglasses per child 6. Whatever else you have, as long as there is one per child 7. Music 8. Space to dance
nso: Selo se bohlokwa mabapi le lenaneo le ke gore ngwana yo mongwe le yo mongwe o swanetše a be le e tee dilo ka moka gore go se be le yoo a iponago a kgethollotšwe. 1. Diaparo tša go aparwa 2. Kefa e 1 go ngwana o mongwe le o mongwe 3. Sekhafo se 1 go ngwana yo mongwe le yo mongwe 4. Phela ya molaleng e 1 go ngwana yo mongwe le yo mongwe 5. Dipeketsane di 1 go ngwana yo mongwe le yo mongwe 6. Se sengwe le se sengwe seo o nago le sona, ge feela e le gore bana ka moka ba na le tšona 7. Mmino 8. Sekgoba sa go bina

source: There’s nothing like a getting Dressed Up. 💅🏿
nso: Ga go na selo seo se swanago le go ipeakanyetša Go apara. 💅🏿

source: This game develops
nso: Papadi ye e kaonafatša:

source: ✔️Social ✔️Songs , Rhymes & Sounds
nso: ✔️Bokgoni bja leago ✔️Dikoša, merethetho le medumo

source: Parents love this game because it teaches children how to dress themselves. 1. Choose 5 types of clothing or props, and make sure there’s enough for each child to have one. 2. Put the items in the middle of the room. 3. Make the children form a circle around the pile of clothes and props. 4. Sing a rhyme or play music. 5. Get the children to dance around. When the music stops, name an item. 6. Each child has to grab one of what you’ve said and put it on, then keep dancing. 7. Carry on until they’re all dressed up.
nso: Batswadi ba rata papadi ye ka lebaka la gore e ruta bana ka moka go ikapeša. 1. Kgetha mehuta ye 5 ya diarapo goba dikokwane, le go kgonthiša gore ke tše ntši go lekanela ngwana yo mongwe yo mongwe. 2. Bea didirišwa mo bogareng bja phapoši. 3. E re bana ba hlame sediko go rarela mokgobo wa diaparo le dikokwane. 4. Opela košana goba raloka mmino. 5. E re bana ba bine go rarela. Ge mmino o ema, efa leina la sedirišwa. 6. Ngwana yo mongwe le yo mongwe o swanetše go goga ye nngwe ya seo o se boletšego le go e bea ka go yona, gona tšwela pele go bina. 7. Tšwela pele go fihla ge le apere ka moka.

source: Here are some clothing ideas:👓👛🧥👒👚👖👔👙👠🧦🧤🎩👕🧣👟🧢👜🕶🎒👗 A rhyme you can sing: We are getting dressed We must look our best Dance dance dance And now’s you last chance To put your ___________ ON!
nso: Mo go latela tše dingwe tša dikgopolo tša diaparo: 👓👛🧥👒👚👖👔👙👠🧦🧤🎩👕🧣👟🧢👜🕶🎒👗 Košana ye o ka e opelago: Re a apara Re swanetše go tšeo re di kgonago kudu Bina bina bina Gomme gabjale ke sebaka sa gago sa mafelelo Go APARA ___________ ya gago!
