Repository: Ari-Ramkilowan/po-files
Catalog: translations/LGroup3(Release (open))_Pedi; Sepedi;  Northern Sotho.po
Languages: nso

source: Read the notes
nso: Bala dinoutse

source: See what you need
nso: Bona se o se hlokago

source: Back to menu
nso: Re boela morago go menyu

source: See how it works
nso: Bona ka moo e šomago ka gona

source: I meant it when I said it was easy. All you need is: 1. A big space to play 2. A blindfold
nso: Ke be ke rereša ge ke be ke re e be e le bonolo. Tšeo o di hlokago ke: 1. Sekgoba se segolo sa go ralokela 2. Seširasefahlogo

source: This game develops
nso: Papadi ye e kaonafatša:

source: Here are a few handy hints 1. Walk around with your arms out in front of you so that you don’t bump into anything or anyone. 2. Ask if you are hot 🔥 or cold ❄ so that the children can give you clues. 3. Let the older children have a turn with the blindfold if they want.
nso: Mo go latela maele a mmalwa a bohlokwa: Sepelasepela o beile matsogo ka pele ga gago gore o se thule se sengwe goba mang goba mang. Botšiša ge e ba o a fiša 🔥 goba o a tonya ❄ gore bana ba go fe maele. E re bana ba bagolo ba šielane go apara seširasefahlogo ge ba nyaka.

source: Have you played The Blind Man with the children? It’s really easy. 🙈
nso: Naa o ralokile papadi ya Monna wa Sefofu le bana? E tloga e le bonolo kudu. 🙈

source: Here’s how you play the game: 1. Tell the children you are going to play The Blind Man. 2. Say that you’re going to put a blindfold on so that you can’t see, and show them the blindfold. 3. Find a big space. 4. Ask the children to find a place to stand. 5. They are not allowed to move from that spot. 6. Move through the space with your blindfold on. 7. If you get close to a child, they must shout “hot!” 8. If you are far away, they must shout “cold!” 9. When you find a child, feel their faces and guess who it is.
nso: Papadi e bapalwa ka tsela ye: 1. Botša bana gore ba tlile go diragatša papadi ya Monna wa Sefofu. 2. Bolela gore o tlile go šira sefahlogo gore o se kgone go bona, le go ba bontšha seširasefahlogo. 3. Hwetša sekgoba se segolo. 4. Kgopela bana go hwetša lefelo leo ba ka emago. 5. Ga se ba dumelelwa go šutha lefelong leo. 6. Sepelasepela gare ga sekgoba o apere seširasefahlogo. 7. Ge o batamela kgauswi le ngwana, ba swanetše go goeletša ka gore “fiša!” 8. Ge o le kgole le ngwana, ba swanetše go goeletša ka gore “tonya!” 9. Ge o hwetša ngwana, ba phophole difahlogo le go akanya gore ke bomang.

source: ✔️Social ✔️Walking & Moving
nso: ✔️Bokgoni bja leago ✔️Go sepela ka maoto le go šutha
