Repository: Ari-Ramkilowan/po-files
Catalog: translations/LGroup10(Release (open))_Zulu.po
Languages: zul

source: See what you need
zul: Bheka ukuthi yini oyidingayo

source: See how it works
zul: Bheka ukuthi kusebenza kanjani

source: Read the notes
zul: Funda amanothi

source: Back to menu
zul: Buyela kumenyu

source: Put your creativity to the test and build 1 fun creature out of Lego. 🦖It’s best to build it before class so that all of the time is spent on the activity
zul: Hlola ubuciko bakho wakhe okuthile oku-1 ngama- LEGO. 🦖 Kungcono ukuyakha ngaphambi kwekilasi ukuze sonke isikhathi sichithwe kwenziwa umsebenzi.

source: This game develops
zul: Lo mdlalo uthuthukisa:

source: See who’s the best explorer with Hide the Toy. 🤠
zul: Asibone ukuthi ubani okwazi ukuhlola kahle Ngomafihla Ithoyizi. 🤠

source: ✔️Skills for Learning ✔️Songs , Rhymes & Sounds
zul: ✔️Amakhono okufunda ✔️Amaculo, imilolozelo nemisindo

source: Read teh notes
zul: Funda amanothi

source: Once you have your unique creation: 1. Show it to all the children. 2. Choose a child to hide the creature. 3. Tell the other children to go outside or close their eyes while it’s being hidden. 4. When hiding, the top of the creature must be showing to make it easier to find. 5. Bring the other children in to look for the creature. 6. Say “hot”, if anyone comes close to it. 7. Say “cold”, when they are far from it. 8. Sing a finding rhyme as they go. 9. Whoever finds it must shout ‘I found it!’ and the game repeats.
zul: Uma usunaso sidalwa sakho sekhethelo: 1. Khombisa izingane zonke. 2. Khetha ingane ezofihla isidalwa esakhiwe. 3. Tshela enye ingane iphumele phandle noma ivale amehlo ngenkathi sifihlwa. 4. Lapho sifihlwa, isingenhla sesidalwa kufanele sibonakale ukuze kube lula ukusithola. 5. Letha ezinye izingane ukuze zizofuna isidalwa. 6. Yithi “kuyashisa”, uma kukhona osondele ekusitholeni. 7. Yithi “kuyabanda”, uma bekude kakhulu naso. 8. Cula umlolozelo wokuthola ngenkathi behamba. 9. Noma ubani ositholayo kufanele amemeze athi “ngisitholile!” umdlalo uqhubeke kanjalo.

source: If you don’t have Lego blocks or are running out of time use a funky toy. 👾 Make sure you give lots of children chances to hide the toy and help them by giving them clues. The Finding Rhyme Can you spy, with your little eye The creature that’s hiding away? Look with your eyes and you will see What you will find it today.
zul: Uma ungenawo amabhuloki e-LEGO noma esembalwa, sebensiza i-funky toy. 👾 Qinisekisa ukuthi unikeza izingane eziningi ithuba lokufihla ithoyizi ngokubanikeza okungazisiza ukuthola impendulo. I-Finding Rhyme Uyahlola, ngeso lakho elincane Isidalwa esicashile? Buka ngamehlo akho uzobona Ozokuthola namhlanje.
