Repository: Ari-Ramkilowan/po-files
Catalog: translations/LGroup11(Release (open))_Zulu.po
Languages: zul

source: Read the notes
zul: Funda amanothi

source: Back to menu
zul: Buyela kumenyu

source: See what you need
zul: Bheka ukuthi yini oyidingayo

source: See how it works
zul: Bheka ukuthi kusebenza kanjani

source: This game develops
zul: Lo mdlalo uthuthukisa:

source: There’s too much bad news in the newspaper, so let’s cut it up and Make a Papier Mache Bowl. ✂📰= 🥣
zul: Kunezindaba eziningi ezimbi ephephandabeni, ngakho masilisike sense i-Papier Mache Bowl. ✂📰= 🥣

source: To make 6 bowls of mache you will need: * 2 cups flour * 2 cups of water * 1 tablespoon of salt * A mixing bowl and spoon * Strips of newspaper * Paint to decorate
zul: UKwenza izindishi eziyisi-6 ze-mache uzodinga: 1. Izinkomishi ezi-2 zikafulawa 2. Izinkomishi ezi-2 zamanzi 3. Isipuni esi-1 sikasawoti 4. Indishi yokuxovela nesipuni 5. Imicu yephephandaba 6. Upende wokuhlobisa

source: The most important note is don’t eat out of this bowl, because it will fall apart. Also: 1. You can do this to make bowls for the pretend area, or you can do it as an art activity with each child. Make sure you have enough small bowls for each child. 2. You can make other things out of paper mache: A bee using a balloon and cardboard, or get the children to make a papier mache hat or some funny animals.
zul: Okufanele ukuqaphele okubalulekile ukuthi akukho muntu okufanele adlele kule ndishi, ngoba izobhidlika. Futhi: 1. Ungakwenza lokhu ukwenza izindishi zendawo yokulingisa, noma ungakwenza njengomsebenzi wobuciko nengane ngayinye. Qinisekisa ukuthi unezindishi ezanele zengane ngayinye. 2. Ungenza ezinye izinto nge-paper mache: Inyosi usebenzisa ibhelunde nekhalibhothi, noma utshele izingane zenze isigqoko se-papier mache noma isilwane esihlekisayo.

source: ✔️Exploring & Finding out ✔️Arm & Hand Control
zul: ✔️Amakhono okufunafuna ✔️Amakhono okulawula izingalo nezandla

source: I should give you a heads up now, that this is a messy business. 👩🏿‍🎨 1. Tear 5 large pieces of newspaper into strips. 2. Mix flour, water and salt in big bowl to make a paste. 3. Take a small bowl – plastic is best. 4. Dip newspaper strips into the paste and layer over the bowl. 5. Do 3 or 4 more layers. 6. Leave to dry for 2 days, or until it’s hard. 7. Gently press it out the bowl. It will pop out. 8. Paint and decorate.
zul: Kumele ngikuxwayise manje, lokhu umsebenzi ongcolisayo kakhulu. 👩🏿‍🎨 1. Dabula izingcezu ezinkulu eziyisi-5 zephephandaba libe yimicu. 2. Hlanganisa ufulawa, amanzi nosawoti endishini enkulu ukuze wenze inhlama. 3. Thatha indishi encane – eyepulastiki iyona engcono. 4. Cwilisa imicu yephephandaba enhlameni bese ubeka phezu kwendishi. 5. Yenza ungwengwesi olu-3 noma olu-4. 6. Kushiye kome izinsuku ezi-2, nom akuze kube sekuqinile. 7. Cindezela ngesineke endishini. Kuzophuma. 8. Penda uhlobise.
