Repository: Ari-Ramkilowan/po-files
Catalog: translations/LGroup8(Release (open))_Xhosa.po
Languages: xho

source: Read the notes
xho: Funda amanqaku

source: Back to menu
xho: Buyela kwimenyu

source: See what you need
xho: Bona okudingayo

source: See how it works
xho: Jonga ukuba isebenza njani

source: The most important thing about this list is that there has to be one per child so that no one feels left out. 1. Clothing for dress up 2. 1 hat per child 3. 1 scarf per child 4. 1 necklace per child 5. 1 pair of sunglasses per child 6. Whatever else you have, as long as there is one per child 7. Music 8. Space to dance
xho: Into ebalulekile ngoluluhlu kukuba kufuneka kubekho into ibenye kwinto yonke umntwana ngamnye ukuze ngabikho ozibona evaleleke ngapandle. 1. Impahla zokunxiba kakuhle 2. Umngqwazi om1 kumntwana ngamnye 3. Isikhafu esi 1 umntwana ngamnye 4. Ineyiklesi eyi 1 umntwana ngamnye 5. Ipere yespekisi eyi 1 umntwana ngamnye 6. Nantoni onayo, kuphela nje umntwana ngamnye abenayo 7. Umculo 8. Indawo yokudanisa

source: There’s nothing like a getting Dressed Up. 💅🏿
xho: Akhonto efana nokuNxiba Kakuhle. 💅🏿

source: This game develops
xho: Lo mdlalo uphuhlisa:

source: ✔️Social ✔️Songs , Rhymes & Sounds
xho: ✔️Izakhono zasekuhlaleni ✔️Ingoma isingqi kunye nesandi

source: Parents love this game because it teaches children how to dress themselves. 1. Choose 5 types of clothing or props, and make sure there’s enough for each child to have one. 2. Put the items in the middle of the room. 3. Make the children form a circle around the pile of clothes and props. 4. Sing a rhyme or play music. 5. Get the children to dance around. When the music stops, name an item. 6. Each child has to grab one of what you’ve said and put it on, then keep dancing. 7. Carry on until they’re all dressed up.
xho: Abazali bayawu thanda lomdlalo kuba ufundisa abantwana ukuba mabazi nxibise njani. 1. Khetha indidi ezi 5 zamalaphu, kwaye uqinisekise ukuba wonke umntwana uyafuman. 2. Beka izinto esphakathini sendlu. 3. Yenza abantwana benze isangqa bejikeleze umqulu wee mpahla nee props. 4. Cula into okanye udlale umculo. 5. Funa abantwana badanise. Xa umculo uyeka babize into. 6. Umntwana ngamnye kufuneka abambe into ubuyi bizile yinxibe, aqhubeleke adanise. 7. Qhubeleka de bonke banxibe ngokupheleleyo.

source: Here are some clothing ideas:👓👛🧥👒👚👖👔👙👠🧦🧤🎩👕🧣👟🧢👜🕶🎒👗 A rhyme you can sing: We are getting dressed We must look our best Dance dance dance And now’s you last chance To put your ___________ ON!
xho: Nazi ezinye izimvo ngempahla: 👓👛🧥👒👚👖👔👙👠🧦🧤🎩👕🧣👟🧢👜🕶🎒👗 Isingqi ongasicula: Siyanxiba Kufuneka sibukeke sibahle ngokugqibeleleyo Danisa Danisa Danisa Ngoku lithuba lakho lokugqibela Ukufaka i ___________ Yakho!
