Repository: Ari-Ramkilowan/po-files
Catalog: translations/LGroup3(Release (open))_Xhosa.po
Languages: xho

source: Read the notes
xho: Funda amanqaku

source: See what you need
xho: Bona okudingayo

source: Back to menu
xho: Buyela kwimenyu

source: See how it works
xho: Jonga ukuba isebenza njani

source: I meant it when I said it was easy. All you need is: 1. A big space to play 2. A blindfold
xho: Bendinyanisile xa bendisihi ilula. Konke okudingayo: 1. Isithuba esikhulu 2. Ukuvalwa emehlweni

source: This game develops
xho: Lo mdlalo uphuhlisa:

source: Here are a few handy hints 1. Walk around with your arms out in front of you so that you don’t bump into anything or anyone. 2. Ask if you are hot 🔥 or cold ❄ so that the children can give you clues. 3. Let the older children have a turn with the blindfold if they want.
xho: Nazi iinkukacha ezimbalwa ezinokunceda: 1. Hamba ujikeleze ngeengalo zakho phambi kwakho ukuze ungabi nantoni na okanye nabani na. 2. Buza ukuba ushushu 🔥 okanye yabanda ❄ ukuze abantwana bakunikeze intluva. 3. Vumela abantwana abadala babenethuba nokuvala amahle kuba bayafuna.

source: Have you played The Blind Man with the children? It’s really easy. 🙈
xho: Ingaba ukhe wayidlala Indoda eyiMfama nabantwana? Ilula kakhulu. 🙈

source: Here’s how you play the game: 1. Tell the children you are going to play The Blind Man. 2. Say that you’re going to put a blindfold on so that you can’t see, and show them the blindfold. 3. Find a big space. 4. Ask the children to find a place to stand. 5. They are not allowed to move from that spot. 6. Move through the space with your blindfold on. 7. If you get close to a child, they must shout “hot!” 8. If you are far away, they must shout “cold!” 9. When you find a child, feel their faces and guess who it is.
xho: Nantsi indlela odlala ngayo umdlalo: 1. Tshela abantwana oza kudlala I-Blind Man. 2. Yithi uya kubeka imbobo ukuze ungaboni, kwaye ubonise imbopheleleko. 3. Fumana isikhala esikhulu. 4. Buza abantwana ukuba bafumane indawo yokuma. 5. Abavunyelwe ukuba bathabathe kuloo ndawo. 6. Hambisa kwi-space kunye nesambatho sakho. 7. Ukuba usondela kumntwana, maye amemezele "ashushu!" 8. Ukuba ude, kufuneka bamemeza "kubanda!" 9. Xa ufumana umntwana, uzive ubuso bawo uze ucinge ukuba ngubani.

source: ✔️Social ✔️Walking & Moving
xho: ✔️Izakhono zasekuhlaleni ✔️Ukuhamba nokushukuma
