Repository: Ari-Ramkilowan/po-files
Catalog: translations/LGroup2(Release (open))_Tsonga.po
Languages: tso

source: See what you need
tso: Vona leswi u swi lavaka

source: See how it works
tso: Vona leswaku swi tirha njhani

source: Read the notes
tso: Hlaya tinotsi

source: Back to menu
tso: Ku tlhelela eka menyu

source: This game develops:
tso: Ntlangu lowu wu ya emahlweni:

source: Why not tell The Feelings Story? 🎭
tso: Hikokwalahokayini u nga va byeli Xitori xa Matitwelo? 🎭

source: ✔️Social ✔️Emotional
tso: ✔️Swikili swo hanyisana na vanhu ✔️Swikili swa ntlhaveko

source: This game is all about imagination, so all you need is the children, and the story in the notes,or you can use puppets.
tso: Ntlangu lowu wu hi ku anakanya, leswi u swi lavaka i vana, na xitori lexi nga eka tinotsi, kumbe u nga tirhisa tiphaphete.

source: Get ready for some acting! Lights, camera, action! 🎬 1. Tell the children the story, using puppets if you have them. 2. If not, use lots of actions, facial expressions and different voices to make it exciting. 3. Then ask the children to stand up. 4. Tell them the story again, one line at a time and ask the children to do the actions of the character Mandla. 5. Also encourage them to do facial expressions by saying, “what does a sad face look like?” or “show me a happy face.” 6. Encourage them to take part and do any action they want to, so that they’re a part of the story.
tso: Tilulamisele ku tlanga! Mavoni, khamera, ntlangu! 🎬 1. Byela vana xitori, u tirhisa tiphaphete loko u ri na tona. 2. Loko u ri hava, tirhisa swendlo swo tala, ku vulavula hi xikandza marito yo hambana hambana ku endla leswaku swi nyanyula. 3. Kutani u byela vana ku suka va yima. 4. Va byeli xitori nakambe, layini yin’we hi nkarhi wun’we kutani u byela vana ku tlanga ximunuhatwa Mandla. 5. Tlhela u va khutaza ku vulavula hi xikandza hikuva u ku, “Xana xikandza lexi nga tsana xi languteka njhani?” kumbe “Ndzi kombe xikandza lexi nga tsaka.” 6. Va khutazi ku va na xiave na ku endla ntlangu wihi kumbe wihi lowu va tsakelaka ku wu endla, leswaku va va xiphemu xa xitori.

source: 1. Mandla wants to go and play with his friend Lebo (he’s excited) 😃 2. Mandla’s mama says he can go (he’s happy) 🙂 3. Mandla walks to Lebo’s house (he’s walking)🚶 4. When he gets to Lebo’s house she’s not there (he’s sad) 😞 5. So Mandla sits on the step and waits for her (he sits and feels tired) 😓 6. Lebo’s mama arrives (he’s pleased) 😁and Mandla asks where Lebo is (he’s polite) 🗣 7. She says that Lebo has gone to Mandla’s house (he’s surprised) 😱 8. Mandla runs home to find Lebo (he’s running). 🏃 9. She is there and he is happy. 😆 10. He hugs her. 🤗 You can add to the story to make it more exciting and give the children more chances to mime actions or express feelings.
tso: 1. Mandla u lava ku ya huhwa na munghana wa yena Lebo (u nyanyukile). 😃 2. Mhani wa Mandla va ri a nga famba (u tsakile). 🙂 3. Mandla u ya endlwini ya ka va Lebo (u le ku fambeni).🚶 4. Loko a fika endlwini ya ka va Lebo u kuma a nga ri kona (wa tsana).😞 5. Kutani Mandla u tshama eswitepisini a n’wi yimela kona (wa tshama na ku twa a karhele). 😓 6. Mhana Lebo wa fika (u tsakile) 😁kutani Mandla a vutisa leswaku Lebo u kwihi (u komba xichavo). 🗣 7. U ri Lebo u ye endlwini ya ka va Mandla (wa hlamala). 😱 8. Mandla u tsustsumela ekaya ku ya kuma Lebo (u le ku tsutsumeni). 🏃 9. U kuma a ri kona kutani wa tsaka. 😆 10. Wa n’wi angarha. 🤗 U nga ha engetela swin’wana eka xitori ku endla leswaku xi tsakisa na ku nyika vana mikarhi yo tala yo encenyeta swendlo na ku kombisa matitwelo ya vona.

source: This is the story, as well as Mandla’s actions and emotions:
tso: Hi lexi xitori, xikan’we na swendlo swa Mandla na mitlhaveko:
