Repository: Ari-Ramkilowan/po-files
Catalog: translations/LGroup9(Release (open))_Zulu.po
Languages: zul

source: See how it works
zul: Bheka ukuthi kusebenza kanjani

source: Read the notes
zul: Funda amanothi

source: Back to menu
zul: Buyela kumenyu

source: See what you need
zul: Bheka ukuthi yini oyidingayo

source: It’s a classic game: Follow the Leader.
zul: Umdlalo omdala owaziwayo: Landela Umholi.

source: ✔️Social ✔️Emotional
zul: ✔️Amakhono okuphilisana emphakathini ✔️Amakhono ezinzwa

source: But it’s not just copying, it’s fun so try using actions and sound effects to make the children laugh. 🤡 Here are some action suggestions: Hop, jump, fly, bend down, turn around, put your hands up, hands crossed, quack, moo.
zul: Kodwa akukona nje ukulingisa kuphela, kumnandi ukwenza izenzo ezithile nemisindo ukuze uhlekise izingane. 🤡 Nansi imibono yezenzo ezingenziwa: Ukuxoxoma, ukujomba, ukundiza, ukugob aphansi, ukujikeleza, ukuphakamisa izandla zakho, ukusonga izandla, ukukhalisa okwedada, ukukhalisa okwenkomo.

source: All you need is wide, open space, you can even play this outside. 🏞
zul: Udinga indawo evulekile, enkulu, ungadlala ngisho nasemnyango. 🏞

source: This game develops
zul: Lo mdlalo uthuthukisa:

source: Let’s see who’s the best copy cat. 😸 1. Get the children to follow a leader, starting with an adult. 2. They have to copy whatever the leader does as they move around, like hopping, putting hands on heads, jumping, running, skipping, doing silly walks, spinning round, waving their arms. 3. Give every child a chance to be the leader.
zul: Ake sibone ukuthi ubani okwazi ukukopela kahle. 😸 1. Tshela izingane zilandele umholi, kuqala ngomuntu omdala. 2. Kufanele zilingise konke okwenziwa umholi njengoba zihamba, njengokuxoxoma, ukubeka izandla ekhanda, ukujomba, ukugijima, ukweqa, ukwenza iminyakazo ehlekisayo, ukuzungeza, ukuvayiza izingalo zabo. 3. Nikeza yonke ingane ithuba lokuba umholi.
