Repository: Ari-Ramkilowan/po-files
Catalog: translations/LGroup2(Release (open))_Tswana.po
Languages: tsn

source: See what you need
tsn: Bona se o se tlhokang

source: See how it works
tsn: Bona kafa o tshamekiwang ka teng

source: Read the notes
tsn: Bala dintlha

source: Back to menu
tsn: Boela kwa mmenyung

source: This game develops:
tsn: Motshameko o o a tswelela:

source: Why not tell The Feelings Story? 🎭
tsn: Goreng le sa bolele Setori sa Maikutlo? 🎭

source: ✔️Social ✔️Emotional
tsn: ✔️Bokgoni jwa batho ✔️Bokgoni jwa maikutlo

source: This game is all about imagination, so all you need is the children, and the story in the notes,or you can use puppets.
tsn: Motshameko o ke wa go itlhamela fela, jalo se o se tlhokang fela ke bana, le setori se se kwadilweng, kgotsa o ka dirisa dipopae..

source: Get ready for some acting! Lights, camera, action! 🎬 1. Tell the children the story, using puppets if you have them. 2. If not, use lots of actions, facial expressions and different voices to make it exciting. 3. Then ask the children to stand up. 4. Tell them the story again, one line at a time and ask the children to do the actions of the character Mandla. 5. Also encourage them to do facial expressions by saying, “what does a sad face look like?” or “show me a happy face.” 6. Encourage them to take part and do any action they want to, so that they’re a part of the story.
tsn: Ipaakanyetse go diragatsa! Dipone, khamera, diragatsa! 🎬 1. Bolelela bana setori, o dirisa dipopae fa e le gore o na le tsone. 2. Fa o se na tsone, dirisa ditiragatso tse dintsi, go bontsha maikutlo ka sefatlhego le mantswe a a farologaneng go dira gore go kgatlhise. 3. O bo o kopa bana gore ba eme ka dinao. 4. O bo o ba bolelela setori gape, mola o le mongwe ka nako e le nngwe o bo o botsa bana go diragatsa ditiro dingwe tsa moanelwa Mandla. 5. Gape ba kgothaletse go dirisa dipontsho ka difatlhego ka go re, “S“Sefatlhego se se hutsafetseng se lebega jang?”Mpontsheng sefatlhego se se itumetseng.” 6. Ba kgothaletse go tsaya karolo le go dira tiragatso epe e ba e batlang, gore ba nne karolo ya setori.

source: 1. Mandla wants to go and play with his friend Lebo (he’s excited) 😃 2. Mandla’s mama says he can go (he’s happy) 🙂 3. Mandla walks to Lebo’s house (he’s walking)🚶 4. When he gets to Lebo’s house she’s not there (he’s sad) 😞 5. So Mandla sits on the step and waits for her (he sits and feels tired) 😓 6. Lebo’s mama arrives (he’s pleased) 😁and Mandla asks where Lebo is (he’s polite) 🗣 7. She says that Lebo has gone to Mandla’s house (he’s surprised) 😱 8. Mandla runs home to find Lebo (he’s running). 🏃 9. She is there and he is happy. 😆 10. He hugs her. 🤗 You can add to the story to make it more exciting and give the children more chances to mime actions or express feelings.
tsn: 1. Mandla o batla go tsamaya go ya go tshameka le tsala ya gagwe Lebo (ga a tshwarege). 😃 2. Mmaagwe Mandla a re o ka tsamaya (o itumetse) 🙂 3. Mandla o tsamaya ka dinao go ya kwa ntlong ya ga Lebo (o tsamaya ka dinao)🚶 4. Fa a ya kwa ntlong ya gabo Lebo o fitlhela a seyo (o hutsafetse) 😞 5. Jalo Mandla o nna mo setepising a mo letile (o nna fa fatshe a ikutlwa a lapile) 😓 6. Mamaago Lebo o a goroga (o itumeletse seo) 😁mme Mandla o botsa gore Lebo o kae (o maitseo). 🗣 7. A re Lebo o ile kwa gaabo Mandla(o gakgametse). 😱 8. Mandla o tabogela kwa gae go batla Lebo (o tabogile) 🏃 9. O mo fitlhela koo mme o itumetse.😆 9. O a mo tlamparela ka lorato.🤗 O ka oketsa setori seno go se dira gore se itumedise thata mme o neye bana ditshono tse dingwe tsa go etsisa ditiragatso kgotsa go bontsha maikutlo a bone.

source: This is the story, as well as Mandla’s actions and emotions:
tsn: Se ke setori, gammogo le ditiragatso tsa ga Mandla le maikutlo.
