Repository: Ari-Ramkilowan/po-files
Catalog: translations/LGroup10(Release (open))_South Ndebele.po
Languages: nbl

source: See what you need
nbl: Bona ukuthi utlhoga ini

source: See how it works
nbl: Bona ukuthi isebenza bunjani

source: Read the notes
nbl: Funda amaAwathi

source: Back to menu
nbl: Buyela erhelweni

source: Put your creativity to the test and build 1 fun creature out of Lego. 🦖It’s best to build it before class so that all of the time is spent on the activity
nbl: Hlola ubukghwari bakho bese wakha isidalwa si – 1 ngeLEGO.🦖 KungcoAwa ukusakha ngaphambi kokuthoma kwesifundo wenzele bona uzoba nesikhathi esaneleko sesifundo.

source: This game develops
nbl: Umdlalo lo uthuthukisa:

source: See who’s the best explorer with Hide the Toy. 🤠
nbl: Qala ukuthi ngubani okwazi ukuhlola nge - Hide the Toy. 🤠

source: ✔️Skills for Learning ✔️Songs , Rhymes & Sounds
nbl: ✔️AmakghoAwa wokufunda ✔️Umvumo, amaculo Awamdumo

source: Read teh notes
nbl: Funda amaAwathi

source: Once you have your unique creation: 1. Show it to all the children. 2. Choose a child to hide the creature. 3. Tell the other children to go outside or close their eyes while it’s being hidden. 4. When hiding, the top of the creature must be showing to make it easier to find. 5. Bring the other children in to look for the creature. 6. Say “hot”, if anyone comes close to it. 7. Say “cold”, when they are far from it. 8. Sing a finding rhyme as they go. 9. Whoever finds it must shout ‘I found it!’ and the game repeats.
nbl: Nasele unakho okwakhileko kwakho wedwa: 1. Tjengisa boke abantwana. 2. Khetha umntwana ozakufihla isidalwa leso. 3. Tjela abanye abantwana baye ngaphandle Awaba bavale amehlo nasifihlwako. 4. Nasifihlwako ingaphezulu laso kufanele livele kuzoba lula ukusifumana. 5. Tjela abanye abantwana bangne bazosifuna. 6. Thana “uyatjhisa”, nakukhona osendelako. 7. Thana “umakhaza”, nabasekudeni naso. 8. Cula ingoma yokufumana nabasafuna njalo. 9. Oyitholileko kufanele aklewule “Ngiyitholile!” bese umdlalo uyaphinda.

source: If you don’t have Lego blocks or are running out of time use a funky toy. 👾 Make sure you give lots of children chances to hide the toy and help them by giving them clues. The Finding Rhyme Can you spy, with your little eye The creature that’s hiding away? Look with your eyes and you will see What you will find it today.
nbl: Nangabe awunawo amabhlogo we - LEGO Awama ayaphela, sebenzis ithoyisi elihlekisako. 👾 Qinisekisa ukuthi unikela abantwana ngobunengi ithuba lokufihla ithoyisi, ubarhelebhe ngokubanika umtlhala. Iculo lokufumana - The Finding Rhyme Ungahlola, ngamehlwakho amancane Isidalwa esibhacile? Qala ngamehlwakho, uzakubona Ukuthi uzotholani namhlanjesi.
