Repository: Ari-Ramkilowan/po-files
Catalog: translations/LGroup5(Release (open))_Venda.po
Languages: ven

source: Read the notes
ven: Kha vha vhale notsi

source: Back to menu
ven: Kha vha humele murahu kha menyu

source: See what you need
ven: Zwine vha ṱoḓa

source: See how it works
ven: Zwi shumisa hani

source: It’s a fun game that’s a little like tag or touchers, but with a twist — you can’t run. 1. You are Gogo. 2. Stand with your back to everyone. 3. Children line up on the other side of the room. 4. When your back is turned, everyone creeps towards you quietly. 5. When you turn around, everyone must freeze where they are. If anyone moves they have to go back to the beginning. 6. You then turn back and let them and get close to you again. 7. The first person who taps you wins. You can even give other children a turn at being Gogo.
ven: Ndi mutambo u takadzaho une wa nga u swaṱa zwiṱuku kana u fara, fhedzi arali vha nga fariwa – a vha koni u shavha. 1. Vhone vha Makhulu. 2. Kha vha ime vho vha furalela vhana. 3. Vhana vha ime kha luṅwe lurumbu lwa kiḽasi. 4. Musi vha tshi tou rembuluwa, muṅwe na muṅwe u a nangavhedza a tshi khou ḓa khavho a sa iti phosho. 5. Musi vha tshi tou rembuluwa, muṅwe na muṅwe u ima a sokou dzii! Hune a vha hone. Arali hu nga vha na ane a sudzuluwa vhoṱhe vha tea u humela murahu vha tou thomolola. 6. Vha ḓo kona u rembuluwa vha vha litsha uri vha swike khavho. 7. Muthu wa u thoma ane a vha swaṱa ndi ene o winaho. Vha nga ṋeavho na vhaṅwe vhana tshipiḓa tsha u vha Makhulu.

source: And that’s it. Easy peazy.
ven: Ndi zwenezwo. Zwi tou vha mukapu.

source: This game develops
ven: Mutambo uyu u bveledza:

source: Sometimes the simplest game is best, like Tap Gogo! 👵🏾
ven: Tshiṅwe tshifhinga mutambo wo leluwaho ndi wone wa khwine, u fana na swaṱani Makhulu! 👵🏾

source: ✔️Walking & Moving ✔️Social
ven: ✔️U tshimbila na u sudzuluwa ✔️Vhukoni kha zwa matshilisano

source: All you need is a big space to move in!
ven: Zwine vha ṱoda ndi tshikhala tshihulwane tsha u tshimbila tshimbila!
