Repository: Ari-Ramkilowan/po-files
Catalog: translations/LGroup4(Release (open))_Swati.po
Languages: ssw

source: See how it works
ssw: Buka kutsi isebenta njani

source: See what you need
ssw: Buka kutsi yini loyidzingako

source: Read the notes
ssw: Fundza emanotsi

source: Back to menu
ssw: Buyela emuva kumenyu

source: This game develops
ssw: Lomdlalo utfutfukisa:

source: Why not end the day with a song like Head and Shoulders?
ssw: Kungani ungavali lusuku lwakho ngengoma lefana nalena letsi Emahlombe Nenhloko?

source: All you need is the song and some cute kids to teach them to. 🎵🎶
ssw: Konkhe lokudzingako nguleliculo kanye nebantfwana labahle longabafundzisa. 🎵🎶

source: ✔️Songs , Rhymes & Sounds ✔️Walking & Moving
ssw: ✔️Tingoma, tilandzelo nemisindvo ✔️Kuhamba nekunyakata

source: The song goes a little something like this: Heads, shoulders, knees and toes, knees and toes Heads, shoulders, knees and toes, knees and toes And eyes and ears and mouth and nose Heads and shoulders, knees and toes, knees and toes. You can sing in your own language too. And remember to point to each body part as you say it.
ssw: Lengoma itawuculwa ngaloluhlobo: Inhloko, emahlombe, emadvolo netintwane, emadvolo netintwane Inhloko, emahlombe, emadvolo netintwane, emadvolo netintwane Nemehlo netindlebe nemlomo nemphumulo Inhloko, emahlombe, emadvolo netintwane, emadvolo netintwane. Ungacula ngelulwimi lwakho nawufuna. Kantsi khumbula kukhoma sitfo semtimba ngasinye ngalesikhatsi ucula.

source: Sing the song: ‘Head and Shoulders’ (which you can find in the notes) and do these actions. 1. Tap each body part as you sing it. (Tap your head when you sing “head” and shoulders when you sing “shoulders”. 2. The second time you sing the song leave out the head and don’t tap it. Instead replace the body part with “hmmm”. 3. The third time you sing the song, replace the shoulders with “hmmm” instead of the head. Each time you sing, replace the next body part with “hmmm” and no tapping so that each body part gets left out once.
ssw: Cula leliculo: “Inhloko nemahlombe” (utalitfola emanotsini) bese wenta lemishukumo. 1. Shaya sitfo semtimba sinye ngalesikhatsi uhlabela. (shaya inhloko ngalesikhatsi utsi “inhloko” nemahlombe ngalesikhatsi utsi “emahlombe”). 2. Kwesibili nawucula leliculo, yekela lenhloko ungayishayi. Kunaloko faka esikhundleni salesitfo semtimba lamagama “hmmm”. 3. Kwesitsatfu nawucula leliculo, faka esikhundleni semahlombe lamagama “hmmm” kunekufaka emahlombe. 4. Njalo uma ucula, faka esikhundleni salesitfo semtimba lamagama “hmmm” kantsi awushayi ndzawo kute kutsi sitfo semtimba ngasinye siyashiywa kube kanye.
