Repository: Ari-Ramkilowan/po-files
Catalog: translations/LGroup1(Release (open))_South Ndebele.po
Languages: nbl

source: Read the notes
nbl: Funda amaAwathi

source: See what you need
nbl: Bona ukuthi utlhoga ini

source: See how it works
nbl: Bona ukuthi isebenza bunjani

source: Back to menu
nbl: Buyela erhelweni

source: This game develops:
nbl: Umdlalo lo uthuthukisa:

source: Let’s try the Finding Challenge. 👀
nbl: Asizame ukuthula isiqabo. 👀

source: This one is easy to get organised, all you need is toys and items (like the ones in the picture) laid out in your play area. 🤖
nbl: Lena ilula ukuyihlela, okutlhogako mathoyisi nezinto (njengalezi ezisesithombeni) ezkhona endawenakho yokudlala. 🤖

source: ✔️Social ✔️Talking & Understanding
nbl: ✔️AmakghoAwa aphathelene Awamphakathi ✔️Ukukhuluma Awakuzwisisana

source: Once everything is laid out on the floor: 1. Get all the children to stand in a circle around the items on the floor. 2. Tell them they have 20 seconds to find an item that matches the description you’re going to give them. 3. Give them a description like soft, blue, big or small. There are more examples in the extra ideas message. 4. Count up to 20 as they search for the right toy or item. 5. Ask each child to show everyone what they picked up and why it matches what you said. 6. Ask older children to shout out ideas of what to look for next.
nbl: Nasele undlale konke phasi: 1. Abantwana abajame isiyingi bazombeleze izinto eziphasi. 2. Batjele ukuthi banemizuzu engama – 20 ukuthola into efana Awakuchaziweko ozobanika yona. 3. Bachazele ngokuthi ithambile, ihlaza, ikulu Awama incane. Kuneembonelo ezinengiezizakulandela. 4. Bala ukufika ku - 20 nabafuna ithoyiselo elifaneleko. 5. Tjela woke umntwana ukuthi atjengise loko akutholile Awakuthi atjho bona kuyafana nalokhu okushwile. 6. Bawa abantwana abakhulu ukuthi bamemeze eyabo imiboAwa yezinto abafuna zifunwe.

source: When giving the children descriptions to match the items, try these examples: • Soft 🐶 • Hard 👷 • Smooth 🐚 • Rough 🦔 • Long 🦒 • Red 🔴 • Round ⚽ • Square 💾 • Plastic 📏 If two children go for the same item, suggest another item to one of them.
nbl: Nawubachazelako ukuthi bafune ini, zama nazi iimbonelo: • Thambile 🐶 • Qinile 👷 • Butjhelelezi 🐚 • Makghwakghwa 🦔 • Yide 🦒 • Ibovu 🔴 • Rondo⚽ • Skwere 💾 • Plastiki 📏 Abantwana ababili nabakhetha into eyodwa, nikela omunye enye.
