Repository: Ari-Ramkilowan/po-files
Catalog: translations/LGroup7(Release (open))_South Ndebele.po
Languages: nbl

source: Read the notes
nbl: Funda amaAwathi

source: Back to menu
nbl: Buyela erhelweni

source: See what you need
nbl: Bona ukuthi utlhoga ini

source: See how it works
nbl: Bona ukuthi isebenza bunjani

source: Let the kids sit around you and: 1. Put all 8 items on a tray. Eg. a comb , toothbrush, teaspoon, coin, fork, crayon, string, elastic band, peg, egg, stick, stone, leaf, lid, ball, shell etc. 🍭🕶🎾🧦⌚🔋🕯🔑🖍📏🥄🌼🧤🥚 2. Let the children look at the tray for a minute, then cover it with the cloth. 3. Without the children take one item off the tray. 4. Remove the cloth. 5. The children have to guess which item is gone. 6. Repeat with another item and ask questions about each item.
nbl: Ithi abantwana bahlale qadi kwakho: 1. Beka zonke izinto ezi – 8 ethreyini. Isibonelo, ikama, ibhratjhi yamazinyo, ithispuni, ihlamvu, iforogo, ikhrayoni, intambo, irege, ipeksi, iqanda, induku, ilitje, itlhari, isivalo,ibholo, iqephe njll. 🍭🕶🎾🧦⌚🔋🕯🔑🖍📏🥄🌼🧤🥚 2. Balise baqale ithreyi umzuzzu owodwa bese uyivala ngetjhila. 3. Bangakaqali, khupha kunye ethreyini. 4. Susa itjhila. 5. Abantwana kufanele baqagele bona ngiyiphi into ekhutjhiwe. 6. Phinda ukhuphe enye godu bese ubuza imibuzo ephathelene nento ngayinye.

source: To keep the kiddies focussed ask some questions like: 1. What is this? 2. Who has one at home? 3. What do you use it for? 4. Who can show me how to use it?
nbl: Ukubagcina banqophile, babuze imibuzo enjenga le: 1. Khuyini lokhu? 2. Ngubani onayo ekhabo? 3. Niyisebenzisela ini? 4. Ngubani ongangitjengisa bona isebenza njani?

source: This game develops
nbl: Umdlalo lo uthuthukisa:

source: If the day has been full of physical activities, you might want to balance it with The Memory Game. 🧠
nbl: Nangabe ilange belizele iimfundo ezisikinyisa umzimba, ungafuna ukwenza uMdlalo woMkhumbuloIf - The Memory Game. 🧠

source: ✔️Skills for Learning ✔️Talking & Understanding
nbl: ✔️AmakghoAwa wokufunda ✔️Ukukhuluma Awakuzwisisana

source: Sometimes it’s nice to just sit down with 8 small items, a tray and a cloth. Just kidding, that’s not a thing, but it what you need for this activity.
nbl: Kwesinye isikhathi kumnandi nje ukuhlala phasi nezinto ezi – 8 ezincani, ithreyi netjhila. Ngiyazidlalela nje, akusilitho kodwa ngilokho okutlhogako.
