Repository: Ari-Ramkilowan/po-files
Catalog: translations/LGroup2(Release (open))_Xhosa.po
Languages: xho

source: See what you need
xho: Bona okudingayo

source: See how it works
xho: Jonga ukuba isebenza njani

source: Read the notes
xho: Funda amanqaku

source: Back to menu
xho: Buyela kwimenyu

source: This game develops:
xho: Lo mdlalo uphuhlisa:

source: Why not tell The Feelings Story? 🎭
xho: Kutheni ungabalisi ibali leemvakalelo? 🎭

source: ✔️Social ✔️Emotional
xho: ✔️Izakhono zasekuhlaleni ✔️Izakhono zasemoyeni

source: This game is all about imagination, so all you need is the children, and the story in the notes,or you can use puppets.
xho: Lo mdlalo wonke umalunga nokuboniswa, kungoko konke oya kudinga ngabantwana, kunye nebali kumanqaku okanye ungasebenzisa abalinganisi.

source: Get ready for some acting! Lights, camera, action! 🎬 1. Tell the children the story, using puppets if you have them. 2. If not, use lots of actions, facial expressions and different voices to make it exciting. 3. Then ask the children to stand up. 4. Tell them the story again, one line at a time and ask the children to do the actions of the character Mandla. 5. Also encourage them to do facial expressions by saying, “what does a sad face look like?” or “show me a happy face.” 6. Encourage them to take part and do any action they want to, so that they’re a part of the story.
xho: Lungiselela ukulinganisa! Iibane, ikhamera, nentshukumo! 🎬 1. Balisela abantwana ibali, usebenzisa iiphaphethi ukuba unazo. 2. Ukuba akunjalo, sebenzisa ezininzi izenzo, ubuso bomzimba kunye namazwi ahlukeneyo ukwenza kube mnandi. 3. Emva koko bacele abantwana ukuba bame. 4. Baxelele ibali kwakhona, umgca omnye ngexesha kwaye ucele abantwana ukuba benze izenzo zomdlali uMandla. 5. Bakhuthaze nabo ukuba benze ubuso besimo ngokuthi, "Ubuso obubuhlungu bubukeka bunjani?" okanye, "Ndibonise ubuso obonwabileyo." 6. Bakhuthaze ukuba bathathe inxaxheba baze benze nantoni na into abayifunayo, ukuze bayingxenye yebali.

source: 1. Mandla wants to go and play with his friend Lebo (he’s excited) 😃 2. Mandla’s mama says he can go (he’s happy) 🙂 3. Mandla walks to Lebo’s house (he’s walking)🚶 4. When he gets to Lebo’s house she’s not there (he’s sad) 😞 5. So Mandla sits on the step and waits for her (he sits and feels tired) 😓 6. Lebo’s mama arrives (he’s pleased) 😁and Mandla asks where Lebo is (he’s polite) 🗣 7. She says that Lebo has gone to Mandla’s house (he’s surprised) 😱 8. Mandla runs home to find Lebo (he’s running). 🏃 9. She is there and he is happy. 😆 10. He hugs her. 🤗 You can add to the story to make it more exciting and give the children more chances to mime actions or express feelings.
xho: 1. UMandla ufuna ukuhamba kwaye adlale nomhlobo wakhe Lebo (uyavuya).😃 2. Umama kaMandla uthi unokuya (uyavuya). 3. UMandla uhamba waya endlwini kaLebo (uhamba).🚶 4. Xa efika endlwini kaLebo akekho (ukhathazekile).😞 5. Ke ngoko uMandla uhlala kwizistephu amlinde (uyahlala azive ediniwe). 😓 6. Umama kaLebo uyafika (uyonwaba) 😁kwaye uMandla uyabuza ukuba uphi uLebo (Ngokuchubeka). 🗣 7. Uthi uLebouye kuloMandla (Uyothuka). 😱 8. UMandla uyabaleka uya ekhaya uyokukhangela uLebo (uyabaleka). 🏃 9. Uphaya kwaye uyavuya. 😆 10. Uyamanga. 🤗 Unokongeza kwimbali ukwenza kube mnandi ngakumbi kwaye unike abantwana ithuba lokuba benze izinto okanye babonise iimvakalelo.

source: This is the story, as well as Mandla’s actions and emotions:
xho: Eli libali, kunye nezenzo zikaMandla kunye neemvakalelo:
