Repository: Ari-Ramkilowan/po-files
Catalog: translations/LGroup6(Release (open))_Pedi; Sepedi;  Northern Sotho.po
Languages: nso

source: Read the notes
nso: Bala dinoutse

source: See what you need
nso: Bona se o se hlokago

source: See how it works
nso: Bona ka moo e šomago ka gona

source: Back to menu
nso: Re boela morago go menyu

source: Horses are great, but not everyone is a pony. 🦄 The kids can pretend to be other animals like elephants, lions, cats, dogs, rabbits etc. Each child can give themselves an animal name. The rhyme you can sing goes like this: Horsie horsie jumping high Horsie horsie touch the sky Horsie horsie go around Horsie horsie touch the ground
nso: Dipere di a thabiša, eupša ga se batho ka moka ba katišago dipere. 🦄 Digotlane di ka itira tšona diphoofolo tše dingwe go swana ditlou, ditau, dikatse, dimpša, mebutla, bjalobjalo. Ngwana a ba ipha leina la phoofolo. Košana ye o ka e opelago e ka tsela ye: Pere pere e fofela godimo Pere pere e kgwatha lefaufau Pere pere e a rarelararela Pere pere e kgwatha fase

source: ✔️Songs , Rhymes & Sounds ✔️Walking & Moving
nso: ✔️Dikoša, merethetho le medumo ✔️Go sepela ka maoto le go šutha

source: Get a small boxes to jump over and a space to move around in. It’s time to see who’s the best horsey. 🎠
nso: Hwetša mapokisi a mannyane ao a tla tshelwago le sekgoba sa go rarela ka ona. Ke nako ya go bona yo a nago le bokgoni bja godimodimo ka mekato ya dipere. 🎠

source: This game develops
nso: Papadi ye e kaonafatša:

source: If the children have been sitting all morning for the small group activity, it might be nice to get them moving with Jumping Horse. 🐎
nso: Ge e le gore ba be ba dutše mesong ka moka go dira mošomo wa dihlopha tše nnyane, go ka ba kaone ge o ka dira gore ba itšhikinye ka Pere ye e Fofago. 🐎

source: Start with some basic horse-play🐴 1.Ask the children to stand in a circle and pretend to be a horse. 2. Ask them to make the sound of a horse. 3. Trot around in a circle like horses. 4. Put out a small box and get each child to jump over the box like a horse. 5. Put out a few more boxes for them to jump over. 6. Keep making horse noises as you play. 7.You can add a rhyme if you want.
nso: Thomiša ka mekatišo ya dipere ya tlwaelo🐴 1. Kgopela bana go ema ka sediko le go itira bona dipere. 2. Ba kgopele gore ba dire modumo wo o swanago le wa pere. 3. Hlehla o rarela go swana le dipere. 4. Bea lepokisi le le nnyane le gore ngwana yo mongwe le yo mongwe a tabogele ka lepokising bjalo ka pere. 5. Ba beele mapokisi a mantši gore ba tabogele ka go ona. 6. Tšwela pele go dira mašata a dipere ge le le gare le raloka. 7. O ka tsenya košana ge o nyaka.
