Repository: Ari-Ramkilowan/po-files
Catalog: translations/LGroup10(Release (open))_Venda.po
Languages: ven

source: See what you need
ven: Zwine vha ṱoḓa

source: See how it works
ven: Zwi shumisa hani

source: Read the notes
ven: Kha vha vhale notsi

source: Back to menu
ven: Kha vha humele murahu kha menyu

source: Put your creativity to the test and build 1 fun creature out of Lego. 🦖It’s best to build it before class so that all of the time is spent on the activity
ven: Kha vha shumise vhuṱali vha fhaṱe tshithu tshithihi tshine tsha seisa vha tshi khou shumisa LEGO. Ndi zwa khwine u tshi ita musi kiḽasi i sa athu u thoma uri tshifhinga tshi kone u shumiswa kha mushumo.

source: This game develops
ven: Mutambo uyu u bveledza:

source: See who’s the best explorer with Hide the Toy. 🤠
ven: Kha vha sedze uri ndi nnyi ane a kona u ṱoḓulusa kha Dzumbani Tshitambiswa. 🤠

source: ✔️Skills for Learning ✔️Songs , Rhymes & Sounds
ven: ✔️Vhukoni ha u guda ✔️Nyimbo, mutevhetsindo na miuungo

source: Read teh notes
ven: Kha vha vhale notsi

source: Once you have your unique creation: 1. Show it to all the children. 2. Choose a child to hide the creature. 3. Tell the other children to go outside or close their eyes while it’s being hidden. 4. When hiding, the top of the creature must be showing to make it easier to find. 5. Bring the other children in to look for the creature. 6. Say “hot”, if anyone comes close to it. 7. Say “cold”, when they are far from it. 8. Sing a finding rhyme as they go. 9. Whoever finds it must shout ‘I found it!’ and the game repeats.
ven: Musi vho no vha na tshithu itsho: 1. Kha vha sumbedze vhana vhothe. 2. Kha vha nange ṅwana a dzumbe tshithu itsho. 3. Kha vha vhudze vhaṅwe vhana vha bvele nnḓa kana vha bonye maṱo avho musi tshi tshi khou dzumbiwa. 4. Musi vha tshi khou dzumba, nga nnṱha ha tshithu itsho hu tea u vhonala nyana u itela uri zwi leluwe u tshi wana. 5. Kha vha vhidze vhaṅwe vhana vha tshi ṱoḓe. 6. Kha vha ri “hu khou fhisa”, arali muthu a tshi swika tsini natsho. 7. Kha vha ri “hu khou rothola”, musi vha kule natsho. 8. Kha vha ambe mutevhetsindo wa u ṱoḓa musi vha tshi khou ya u ṱoḓa. 9. Ane a tshi wana u tea u vhidzelela “Ndo tshi wana!” mutambo u dovholole.

source: If you don’t have Lego blocks or are running out of time use a funky toy. 👾 Make sure you give lots of children chances to hide the toy and help them by giving them clues. The Finding Rhyme Can you spy, with your little eye The creature that’s hiding away? Look with your eyes and you will see What you will find it today.
ven: Arali vha si na zwibuloko zwa LEGO kana zwi tshi khou fhela, kha vha shumise tshitambiswa. 👾 Kha vha vhone uri vha ṋea vhana tshikhala tshinzhi uri vha dzumbe tshitambiswa vha vha thuse nga u vha ṋea tsivhudzo. U Wana Mutevhetsindo Ni a kona u ṱola nga iṱo lanu ḽiṱuku Tshithu tsho dzumbama? Sedzani nga maṱo aṋu ni ḓo tshi vhona Ni ḓo wana mini ṋamusi.
