Repository: Ari-Ramkilowan/po-files
Catalog: translations/LGroup8(Release (open))_Swati.po
Languages: ssw

source: Read the notes
ssw: Fundza emanotsi

source: Back to menu
ssw: Buyela emuva kumenyu

source: See what you need
ssw: Buka kutsi yini loyidzingako

source: See how it works
ssw: Buka kutsi isebenta njani

source: The most important thing about this list is that there has to be one per child so that no one feels left out. 1. Clothing for dress up 2. 1 hat per child 3. 1 scarf per child 4. 1 necklace per child 5. 1 pair of sunglasses per child 6. Whatever else you have, as long as there is one per child 7. Music 8. Space to dance
ssw: Intfo lebaluleke kakhulu ngaloluhla kwekutsi kufanele kube nakunye kwako konkhe kwemntfwana ngamunye kute kutsi kungabi khona lotiva angakanakwa. 1. Timphahla tekudlala kugcoka 2. Sigcoko 1 semntfwana ngamunye 3. Sikhafu 1 semntfwana ngamunye 4. Umgaco 1 wemntfwana ngamunye 5. Emagogozi 1 emntfwana ngamunye 6. Noma ngabe yini lonayo, inkhani nje uma utawuba nakunye kwemntfwana ngamunye 7. Umculo 8. Indzawo yekudansela

source: There’s nothing like a getting Dressed Up. 💅🏿
ssw: Akukho lokufana neKudlala Kugcoka. 💅🏿

source: This game develops
ssw: Lomdlalo utfutfukisa:

source: ✔️Social ✔️Songs , Rhymes & Sounds
ssw: ✔️Emakhono ekuphila ✔️Tingoma, tilandzelo nemisindvo

source: Parents love this game because it teaches children how to dress themselves. 1. Choose 5 types of clothing or props, and make sure there’s enough for each child to have one. 2. Put the items in the middle of the room. 3. Make the children form a circle around the pile of clothes and props. 4. Sing a rhyme or play music. 5. Get the children to dance around. When the music stops, name an item. 6. Each child has to grab one of what you’ve said and put it on, then keep dancing. 7. Carry on until they’re all dressed up.
ssw: Batali bayawutsandza lomdlalo ngoba ufundzisa bantfwana kutsi batigcokise njani. 1. Khetsa luhlobo lwetimphahla leti-5, ucinisekisa kutsi kunaletenele kutsi umntfwana ngamunye abe nato. 2. Beka letintfo emkhatsini kulelikamelo. 3. Tsani bantfwana abente indingilizi batungeletele letimphahla letiyincumbi. 4. Cula silandzelo noma udlale umculo. 5. Tsani bantfwana abadanse batungeletele. Uma ngabe lomculo uphela, bita intfo letsite. 6. Umntfwana ngamunye kufanele atsatse kunye kwaloku lokushilo akugcoke, bese niyachubeka niyadansa. 7. Chubekani badzimate bonkhe bagcoke.

source: Here are some clothing ideas:👓👛🧥👒👚👖👔👙👠🧦🧤🎩👕🧣👟🧢👜🕶🎒👗 A rhyme you can sing: We are getting dressed We must look our best Dance dance dance And now’s you last chance To put your ___________ ON!
ssw: Nakha lamanye emasu etintfo tekugcoka: 👓👛🧥👒👚👖👔👙👠🧦🧤🎩👕🧣👟🧢👜🕶🎒👗 Silandzelo longasicula: Siyagcoka Kufanele sibe bahle Sidanse sidanse sindanse Kantsi nyalo litfuba lakho lekugcina Kugcoka i ___________ YAKHO!
