Repository: Ari-Ramkilowan/po-files
Catalog: translations/LGroup1(Release (open))_Pedi; Sepedi;  Northern Sotho.po
Languages: nso

source: Read the notes
nso: Bala dinoutse

source: See what you need
nso: Bona se o se hlokago

source: See how it works
nso: Bona ka moo e šomago ka gona

source: Back to menu
nso: Re boela morago go menyu

source: This game develops:
nso: Papadi ye e kaonafatša:

source: Let’s try the Finding Challenge. 👀
nso: A re leke Go hwetša Tlhohlo. 👀

source: This one is easy to get organised, all you need is toys and items (like the ones in the picture) laid out in your play area. 🤖
nso: Ye ke tsela ye bonolo ya go ipeakanya, ka moka tše o di hlokago ke dibapadišwa le didirišwa (go swana le tšeo di lego seswantšhong) tše di adilwego ka lefelong leo le ralokelago go lona. 🤖

source: ✔️Social ✔️Talking & Understanding
nso: ✔️Bokgoni bja leago ✔️Go bolela le go kwešiša

source: Once everything is laid out on the floor: 1. Get all the children to stand in a circle around the items on the floor. 2. Tell them they have 20 seconds to find an item that matches the description you’re going to give them. 3. Give them a description like soft, blue, big or small. There are more examples in the extra ideas message. 4. Count up to 20 as they search for the right toy or item. 5. Ask each child to show everyone what they picked up and why it matches what you said. 6. Ask older children to shout out ideas of what to look for next.
nso: Morago ga gore se sengwe le se sengwe se alwe mo lebatong: 1. E re bana ka moka ba eme ba dirile sediko go rarela dilo tše di lego lebatong. 2. Ba botše gore ba na le metsotswana ye 20 go hwetša selo se swanetšanago le tlhalošo yeo o tlilego go ba fa yona. 3. Ba fe tlhalošo ya go swana le boleta, kgolo goba nnyane. Go na le mehlala ye mentši go molaetša wa dikgopolo tše ntši. 4. Balela go fihla ka 20 ge ba le gare ba nyakana le sebapadišwa sa maleba. 5. Kgopela ngwana yo mongwe le yo mongwe go bontšha mang le mang seo ba se topilego le gore ke ka lebaka la eng se swanetšana le seo o se boletšego. 6. Kgopela bana ba bagolo go goeletša dikgopolo tša seo se swanetšego go nyakwa go latela.

source: When giving the children descriptions to match the items, try these examples: • Soft 🐶 • Hard 👷 • Smooth 🐚 • Rough 🦔 • Long 🦒 • Red 🔴 • Round ⚽ • Square 💾 • Plastic 📏 If two children go for the same item, suggest another item to one of them.
nso: Ge o le gare o e fa bana ditlhalošo tša go swanetšana le dilo, leka mehlala ye: • Boleta 🐶 • Bothata 👷 • Boreledi 🐚 • Makgwakgwa 🦔 • Telele 🦒 • Khwibidu 🔴 • Nkgokolo ⚽ • Sekwere 💾 • Polastiki 📏 Ge e le gore bana ba babedi ba kgetha selo se swanago, kgethela yo mongwe selo se sengwe.
