Repository: Ari-Ramkilowan/po-files
Catalog: translations/LGroup5(Release (open))_Zulu.po
Languages: zul

source: Read the notes
zul: Funda amanothi

source: Back to menu
zul: Buyela kumenyu

source: See what you need
zul: Bheka ukuthi yini oyidingayo

source: See how it works
zul: Bheka ukuthi kusebenza kanjani

source: It’s a fun game that’s a little like tag or touchers, but with a twist — you can’t run. 1. You are Gogo. 2. Stand with your back to everyone. 3. Children line up on the other side of the room. 4. When your back is turned, everyone creeps towards you quietly. 5. When you turn around, everyone must freeze where they are. If anyone moves they have to go back to the beginning. 6. You then turn back and let them and get close to you again. 7. The first person who taps you wins. You can even give other children a turn at being Gogo.
zul: Umdlalo omnandi ofana ne-tag noma touchers, kodwa uhlukile – awuvunyelwe ukubaleka. 1. UnguGogo. 2. Yima ufulathele wonke umuntu. 3. Izingane zima ulayini kolunye uhlangothi lwegumbi. 4. Uma ufulathele, wonke umuntu uyakunyonyobela buthule. 5. Uma uphenduka, wonke umuntu kufanele ame anganyakazi lapho ekhona. Uma kukhon aoke wanyakaza kufanele aphinde emuva aqale phansi. 6. Uyaphenduka futhi ubayeke basondele futhi. 7. Umuntu wokuqala ozokuthinta uyawina. Unganikeza ngisho nezinye izingane ithuba lokuba uGogo.

source: And that’s it. Easy peazy.
zul: Yilokho nje. Kulula kakhulu.

source: This game develops
zul: Lo mdlalo uthuthukisa:

source: Sometimes the simplest game is best, like Tap Gogo! 👵🏾
zul: Kwesinye isikhathi umdlalo olula yiwo ohamba phambili, njengo-Tap Gogo! 👵🏾

source: ✔️Walking & Moving ✔️Social
zul: ✔️Ukuhamba nokunyakaza ✔️Amakhono okuphilisana emphakathini

source: All you need is a big space to move in!
zul: Udinga indawo enkulu ozokwazi ukunyakaza kuyona!
