Repository: Ari-Ramkilowan/po-files
Catalog: translations/LGroup8(Release (open))_Tswana.po
Languages: tsn

source: Read the notes
tsn: Bala dintlha

source: Back to menu
tsn: Boela kwa mmenyung

source: See what you need
tsn: Bona se o se tlhokang

source: See how it works
tsn: Bona kafa o tshamekiwang ka teng

source: The most important thing about this list is that there has to be one per child so that no one feels left out. 1. Clothing for dress up 2. 1 hat per child 3. 1 scarf per child 4. 1 necklace per child 5. 1 pair of sunglasses per child 6. Whatever else you have, as long as there is one per child 7. Music 8. Space to dance
tsn: Selo sa botlhokwa thata ka lenaane le ke gore ngwana mongwe le mongwe o tshwanetse go nna le sengwe le sengwe sa tsone gore ope a se ka a ikutlwa a sa tshwane le ba bangwe. 1. Diaparo tsa go apara 2. Hutshe e le 1 ngwana mongwe le mongwe 3. Sekafo se le 1 ngwana mongwe le mongwe 4. Sebaga se le 1 ngwana mongwe le mongwe 5. Digalase tsa letsatsi di le 1 ngwana mongwe le mongwe 6. Lefa e le eng se sengwe se o nang le sone, fa fela e le gore ngwana mongwe o na le sone 7. Mmino 8. Sebaka se go binelwang mo go sone

source: There’s nothing like a getting Dressed Up. 💅🏿
tsn: Ga go na sepe se se tshwanang le Go Apara. 💅🏿

source: This game develops
tsn: Motshameko o o a tswelela:

source: ✔️Social ✔️Songs , Rhymes & Sounds
tsn: ✔️Bokgoni jwa batho ✔️Dipina , merumo le medumo

source: Parents love this game because it teaches children how to dress themselves. 1. Choose 5 types of clothing or props, and make sure there’s enough for each child to have one. 2. Put the items in the middle of the room. 3. Make the children form a circle around the pile of clothes and props. 4. Sing a rhyme or play music. 5. Get the children to dance around. When the music stops, name an item. 6. Each child has to grab one of what you’ve said and put it on, then keep dancing. 7. Carry on until they’re all dressed up.
tsn: Bana ba rata motshameko o ka gonne o ruta bana go ikapetsa. 1. Tlhopha mefuta e le 5 ya diaparo kgotsa didirisiwa tsa motshameko, mme o tlhomamise gore go na le tse di lekaneng gore ngwana mongwe le mongwe a nne le tsone. 2. Baya dilwana fa gare ga phaposi ya borutelo. 3. Tlhomamisa gore bana ba dira sekele go dikologa thoto ya diaparo le didirisiwa mo motshamekong ono. 4. Opela morumo kgotsa letsa mmino. 5. Dira gore bana ba bine ba dikologa. Fa mmino o ema, bitsa selwana. 6. Ngwana mongwe le mongwe o tsaya selo se le sengwe se o se buileng a ba a se apara, a ba a nna a bina. 7. Tswelela jalo go fitlhela botlhe ba apere.

source: Here are some clothing ideas:👓👛🧥👒👚👖👔👙👠🧦🧤🎩👕🧣👟🧢👜🕶🎒👗 A rhyme you can sing: We are getting dressed We must look our best Dance dance dance And now’s you last chance To put your ___________ ON!
tsn: Megopolo mengwe ya go apara ke e: 👓👛🧥👒👚👖👔👙👠🧦🧤🎩👕🧣👟🧢👜🕶🎒👗 Morumo o o ka o opelang: Re a apara Re tshwanetse go nna bantle: Bina Bina Bina Jaanong ke tshono ya gago ya bofelo Go APARA ___________ ya gago!
