Repository: Ari-Ramkilowan/po-files
Catalog: translations/LGroup7(Release (open))_Xhosa.po
Languages: xho

source: Read the notes
xho: Funda amanqaku

source: Back to menu
xho: Buyela kwimenyu

source: See what you need
xho: Bona okudingayo

source: See how it works
xho: Jonga ukuba isebenza njani

source: Let the kids sit around you and: 1. Put all 8 items on a tray. Eg. a comb , toothbrush, teaspoon, coin, fork, crayon, string, elastic band, peg, egg, stick, stone, leaf, lid, ball, shell etc. 🍭🕶🎾🧦⌚🔋🕯🔑🖍📏🥄🌼🧤🥚 2. Let the children look at the tray for a minute, then cover it with the cloth. 3. Without the children take one item off the tray. 4. Remove the cloth. 5. The children have to guess which item is gone. 6. Repeat with another item and ask questions about each item.
xho: Vumela abantwana bahlala bekujikelezile kwaye: 1. Faka izinto zakho ezisi 8 etreyini. Umzekelo. Ikama, ibrashi yokuxukuxa, itispuni, ikhoyini, ifolokhwe, ikrayoni, intambo, irabha, iphegi, iqanda, ukhuni, ilitye, igqabi,ipenilothi, ibhola, iqokobhe njalo njalol.. 🍭🕶🎾🧦⌚🔋🕯🔑🖍📏🥄🌼🧤🥚 2. Vumela abantwana bajonge kwi treyi umzuzwana, wakugqiba uyivale nge laphu. 3. Bengaku jonganga abantwana, kupha into ibenye kwi treyi. 4. Susa ilaphu. 5. Abantwana kufuneka baqikelele ukuba yeyiphi engekhoyo. 6. Phinda ngenye into utsho ubuze imibuzo ngento nganye.

source: To keep the kiddies focussed ask some questions like: 1. What is this? 2. Who has one at home? 3. What do you use it for? 4. Who can show me how to use it?
xho: Ukugcina abantwana bethe qwa buza imibuzo efana nale: 1. Yintoni le? 2. Ngubani nay ekhaya? 3. Uyisebenzisela ntoni? 4. Ngubani ngandibonisa isetyenziswa njani?

source: This game develops
xho: Lo mdlalo uphuhlisa:

source: If the day has been full of physical activities, you might want to balance it with The Memory Game. 🧠
xho: Ukuba usuku beligcwele zizenzo zomzimba, ungathanda ukuyizinzisa ngeMidlalo yeNgqondo. 🧠

source: ✔️Skills for Learning ✔️Talking & Understanding
xho: ✔️Izakhono zokufunda ✔️Ukuthetha kunye nokuqonda

source: Sometimes it’s nice to just sit down with 8 small items, a tray and a cloth. Just kidding, that’s not a thing, but it what you need for this activity.
xho: Ngamanye amaxesha kumnandi uvele uhlale phantsi ngezinto ezisi 8 ezincinci, itreyi nelapu. Ndiyadlala iyiyo lonto kodwa okudingayo kulo mdlalo.
