Repository: Ari-Ramkilowan/po-files
Catalog: translations/LGroup6(Release (open))_Xhosa.po
Languages: xho

source: Read the notes
xho: Funda amanqaku

source: See what you need
xho: Bona okudingayo

source: See how it works
xho: Jonga ukuba isebenza njani

source: Back to menu
xho: Buyela kwimenyu

source: Horses are great, but not everyone is a pony. 🦄 The kids can pretend to be other animals like elephants, lions, cats, dogs, rabbits etc. Each child can give themselves an animal name. The rhyme you can sing goes like this: Horsie horsie jumping high Horsie horsie touch the sky Horsie horsie go around Horsie horsie touch the ground
xho: Amahashe alungile, kodwa hayi wonke umntu yiponi. 🦄 1. Abatwana bangenza ingathi bazezinye izilwanyana ezifana nendlovu, iingonyama, iikati, izinja, imivundla he kids can pretend to be other animals njl njl. 2. Umntwna ngamnye angazinika igama lesilwanyana. Isingi ongasicula sihamba kanje : Hashe hashe tsiba phezulu Hashe hashe bamba isibhakabhaka Hashe hashe go around Hashe hashe bamba umhlaba

source: ✔️Songs , Rhymes & Sounds ✔️Walking & Moving
xho: ✔️Ingoma isingqi kunye nesandi ✔️Ukuhamba nokushukuma

source: Get a small boxes to jump over and a space to move around in. It’s time to see who’s the best horsey. 🎠
xho: Fumana ii bhokisi ezincinane zoku tsibatsiba nesithuba sokuhamba hamba. Lixesha likubona ukuba ngubani ihashe eligqibeleleyo.🎠

source: This game develops
xho: Lo mdlalo uphuhlisa:

source: If the children have been sitting all morning for the small group activity, it might be nice to get them moving with Jumping Horse. 🐎
xho: Ukuba abantwana bebehleli kumsebenzi weqela intsasa yonke, kungakuhle ukuba ubashukumise nge Hashe eLitsibayo.🐎

source: Start with some basic horse-play🐴 1.Ask the children to stand in a circle and pretend to be a horse. 2. Ask them to make the sound of a horse. 3. Trot around in a circle like horses. 4. Put out a small box and get each child to jump over the box like a horse. 5. Put out a few more boxes for them to jump over. 6. Keep making horse noises as you play. 7.You can add a rhyme if you want.
xho: Qala ngomdlalo nje wehashe 🐴 1. Buza abantwana ukuba bajonge kwisangqa baze bazenze ihashe. 2. Buza ukuba benze isandi sehashe. 3. Gqungquthela isangqa njengamahashe. 4. Yenza ibhokisi elincinci kwaye ufumane umntwana ngamnye ukuba angene phezu kwebhokisi njengebhashe. 5. Beka iibhokisi ezimbalwa ukuze baxhamle. 6. Qhubeka ukwenza umsindo wehashe njengoko udlala. 7. Ungongeza isingeniso ukuba ufuna.
