Repository: Ari-Ramkilowan/po-files
Catalog: translations/LGroup10(Release (open))_Afrikaans.po
Languages: afr

source: See what you need
afr: Kyk wat jy nodig het

source: See how it works
afr: Kyk hoe dit werk

source: Read the notes
afr: Lees die notas

source: Back to menu
afr: Terug na spyskaart

source: Put your creativity to the test and build 1 fun creature out of Lego. 🦖It’s best to build it before class so that all of the time is spent on the activity
afr: Plaas jou kreatiwiteit op die proef en bou 1 prettige kreatuur uit LEGO. 🦖 Dit sal beter wees om dit te bou voor die klas begin sodat al die tyd aan die aktiwiteit bestee word.

source: This game develops
afr: Hierdie speletjie ontwikkel:

source: See who’s the best explorer with Hide the Toy. 🤠
afr: Kyk wie is die beste ontdekkingsreisiger met Steek die Speelding Weg (Hide the Toy). 🤠

source: ✔️Skills for Learning ✔️Songs , Rhymes & Sounds
afr: ✔️Vaardighede vir leer ✔️Liedjies, rympies en klanke

source: Read teh notes
afr: Lees die notas

source: Once you have your unique creation: 1. Show it to all the children. 2. Choose a child to hide the creature. 3. Tell the other children to go outside or close their eyes while it’s being hidden. 4. When hiding, the top of the creature must be showing to make it easier to find. 5. Bring the other children in to look for the creature. 6. Say “hot”, if anyone comes close to it. 7. Say “cold”, when they are far from it. 8. Sing a finding rhyme as they go. 9. Whoever finds it must shout ‘I found it!’ and the game repeats.
afr: Sodra jy jou unieke kreatuur het: 1. Wys dit aan al die kinders. 2. Kies ’n kind om die kreatuur weg te steek. 3. Sê vir die ander kinders om buitentoe te gaan of hul oë toe te maak terwyl dit weggesteek word. 4. Wanneer dit weggesteek word, moet die bokant van die kreatuur uitsteek om dit makliker te maak om te vind. 5. Laat die ander kinders inkom om die kreatuur te soek. 6. Sê “warm” wanneer iemand naby dit kom. 7. Sê “koud” wanneer hulle ver weg daarvan is. 8. Sing ’n vindrympie terwyl hulle soek. 9. Die een wat dit vind moet “Ek het dit gevind!” skree en dan word die speletjie herhaal.

source: If you don’t have Lego blocks or are running out of time use a funky toy. 👾 Make sure you give lots of children chances to hide the toy and help them by giving them clues. The Finding Rhyme Can you spy, with your little eye The creature that’s hiding away? Look with your eyes and you will see What you will find it today.
afr: As jy nie LEGO-blokke het nie of te min het, gebruik ’n oulike speelding. 👾 Maak seker dat baie kinders ’n beurt kry om die speelding weg te steek en help hulle deur leidrade te gee. Die Vindrympie (Finding Rhyme) Kan jy met jou kleine ogie Die kreatuur sien wat wegkruip? Kyk met jou ogies en jy sal sien Wat vandag sal opduik.
