Repository: Ari-Ramkilowan/po-files
Catalog: translations/LGroup5(Release (open))_South Ndebele.po
Languages: nbl

source: Read the notes
nbl: Funda amaAwathi

source: Back to menu
nbl: Buyela erhelweni

source: See what you need
nbl: Bona ukuthi utlhoga ini

source: See how it works
nbl: Bona ukuthi isebenza bunjani

source: It’s a fun game that’s a little like tag or touchers, but with a twist — you can’t run. 1. You are Gogo. 2. Stand with your back to everyone. 3. Children line up on the other side of the room. 4. When your back is turned, everyone creeps towards you quietly. 5. When you turn around, everyone must freeze where they are. If anyone moves they have to go back to the beginning. 6. You then turn back and let them and get close to you again. 7. The first person who taps you wins. You can even give other children a turn at being Gogo.
nbl: Umdlalo omnandi ofana Awakuthi faka Awama thinta kodwana ehlukile – angeze ukghone ukubaleka. 1. Ungu Gogo. 2. Jama ufulathele boke. 3. Abantwana bajama kelinye ihlangothi. 4. Nawufulathele, boke bayakunyonyobela. 5. Nawujikaka boke kufanele bajame banganyakazi lapho bakhona. 6.Nakukhona onyakazako kufanele abuyele emuva. Ekuthomeni. 7.Uyafulathela godu bese bayasondela. Wokuthoma ozokuthinta, uthumbile, Unganikeza nabanye abantwana ithuba lokuba ngu- Gogo.

source: And that’s it. Easy peazy.
nbl: Ngilokho. Ilula khulu.

source: This game develops
nbl: Umdlalo lo uthuthukisa:

source: Sometimes the simplest game is best, like Tap Gogo! 👵🏾
nbl: Kwesinye isikhathi umdlalo olula ungongcoAwa njenge: Betha Gogo! - Tap Gogo! 👵🏾

source: ✔️Walking & Moving ✔️Social
nbl: ✔️Ukukhamba Awakusikinyeka ✔️AmakghoAwa aphathelene Awamphakathi

source: All you need is a big space to move in!
nbl: Okutlhogako indawo ekulu eningakhamba kiyo!
