Repository: Ari-Ramkilowan/po-files
Catalog: translations/LGroup6(Release (open))_South Ndebele.po
Languages: nbl

source: Read the notes
nbl: Funda amaAwathi

source: See what you need
nbl: Bona ukuthi utlhoga ini

source: See how it works
nbl: Bona ukuthi isebenza bunjani

source: Back to menu
nbl: Buyela erhelweni

source: Horses are great, but not everyone is a pony. 🦄 The kids can pretend to be other animals like elephants, lions, cats, dogs, rabbits etc. Each child can give themselves an animal name. The rhyme you can sing goes like this: Horsie horsie jumping high Horsie horsie touch the sky Horsie horsie go around Horsie horsie touch the ground
nbl: Amapere mahle, kodwana akusiwo woke amaponi.🦄 1. Abafundi bangenza ingasuthi ngezinye izilwana njengendlovu, ibhubezi, abokatsu, izinja, iintenetjha njll. 2. Umntwana ngamunye angizipha ibizo lesilwane. Iculo ongaliculo: Pere pere yeqela phezulu Pere pere yeqela emkayini Pere pere iyaronda Pere pere ithinta phasi

source: ✔️Songs , Rhymes & Sounds ✔️Walking & Moving
nbl: ✔️Umvumo, amaculo Awamdumo ✔️Ukukhamba Awakusikinyeka

source: Get a small boxes to jump over and a space to move around in. It’s time to see who’s the best horsey. 🎠
nbl: Thola amabhokisi wokweqa nendawo yokukhambakhamba. Sikhathi sokubona bona ngubani ipere engcoAwa. 🎠

source: This game develops
nbl: Umdlalo lo uthuthukisa:

source: If the children have been sitting all morning for the small group activity, it might be nice to get them moving with Jumping Horse. 🐎
nbl: Nangabe abantwana gade bahleli kusukela ekuseni esiqhemeni esincane, kungaba kuhle bayeqa yeqe ngePere Eyeqako – Jumping Horse.🐎

source: Start with some basic horse-play🐴 1.Ask the children to stand in a circle and pretend to be a horse. 2. Ask them to make the sound of a horse. 3. Trot around in a circle like horses. 4. Put out a small box and get each child to jump over the box like a horse. 5. Put out a few more boxes for them to jump over. 6. Keep making horse noises as you play. 7.You can add a rhyme if you want.
nbl: Thoma ngomdlalo waphasi i- horse-play🐴 1. Bawa abantwana ukuthi bajame isiyingi benze ngasuthi ipera. 2. Babawe benze itjhada lepere. 3. Zungelezani nizombeleze njengepere. 4. Beka ibhokisi bese uthi umntwana ngamunye eqe ibhokselo njengepere. 5. Beka amanye amabhokisi bese uthi baweqe. 6. Ragela phambili wenze itjhada lepere. 7. Ungafaka umvumo nawuthandako.
