Repository: Ari-Ramkilowan/po-files
Catalog: translations/LGroup2(Release (open))_South Ndebele.po
Languages: nbl

source: See what you need
nbl: Bona ukuthi utlhoga ini

source: See how it works
nbl: Bona ukuthi isebenza bunjani

source: Read the notes
nbl: Funda amaAwathi

source: Back to menu
nbl: Buyela erhelweni

source: This game develops:
nbl: Umdlalo lo uthuthukisa:

source: Why not tell The Feelings Story? 🎭
nbl: Kuba yini ungacoci iAwalwana yeMizwa - The Feelings Story? 🎭

source: ✔️Social ✔️Emotional
nbl: ✔️AmakghoAwa aphathelene Awamphakathi ✔️Emotional skills

source: This game is all about imagination, so all you need is the children, and the story in the notes,or you can use puppets.
nbl: Umdlalo lo uphathelene Awamcabango, ye ke okutlhogako bentwana kwaphela, neAwalwana esemaAwathini Awama usebenzise aboAwaspopana.

source: Get ready for some acting! Lights, camera, action! 🎬 1. Tell the children the story, using puppets if you have them. 2. If not, use lots of actions, facial expressions and different voices to make it exciting. 3. Then ask the children to stand up. 4. Tell them the story again, one line at a time and ask the children to do the actions of the character Mandla. 5. Also encourage them to do facial expressions by saying, “what does a sad face look like?” or “show me a happy face.” 6. Encourage them to take part and do any action they want to, so that they’re a part of the story.
nbl: Zilungiselele ukudlala! Umkhanyo, ikhamera, dlala! 🎬 1. Cocela abantwana iAwalwana, usebenzisa aboAwaspopana nawunabo. 2. Nawunganabo, lingisa, usebenzise ubuso namaphimbo ahlukile ukwenza kube mnandi. 3. Bawa abantwana ukuthi basikime. 4. Bacocele iAwalwana godu, umuda munye ngasikhathi sinye bese ubawa abantwana ukuthi balingise uMandla. 5. Bagcugcuzele godu ukuthi balingise ngobuso ngokuthi, “Ubuso obudanileko bunjani?” Awama “Ngitjengiseni ubuso obuthabileko.” 6. Bagcugcuzele bona bazibandakanye naAwakuthi balingise nangaAwama ngiyiphi indlela abayifunako kwenzela bona babe ingcenye yeAwalwana le.

source: 1. Mandla wants to go and play with his friend Lebo (he’s excited) 😃 2. Mandla’s mama says he can go (he’s happy) 🙂 3. Mandla walks to Lebo’s house (he’s walking)🚶 4. When he gets to Lebo’s house she’s not there (he’s sad) 😞 5. So Mandla sits on the step and waits for her (he sits and feels tired) 😓 6. Lebo’s mama arrives (he’s pleased) 😁and Mandla asks where Lebo is (he’s polite) 🗣 7. She says that Lebo has gone to Mandla’s house (he’s surprised) 😱 8. Mandla runs home to find Lebo (he’s running). 🏃 9. She is there and he is happy. 😆 10. He hugs her. 🤗 You can add to the story to make it more exciting and give the children more chances to mime actions or express feelings.
nbl: 1. uMandla ufuna ukukhamba ayodlala Awamnganakhe uLebo (uthakasile). 😃 2. Unina lika Mandla uthi angakhamba (uthabile). 🙂 3. uMandla uya kibo Lebo (uyakhamba).🚶 4. nakafikako khabo Lebo, ufumanisa bona akakho (udanile). 😞 5. Ye – ke uMandla uhlala phasi estebhini uyamjamela (uhlezi waze wadinwa). 😓 6. Unina likaLebo uyafika (uyathokoza) 😁uMandla uyabuza bona uLebo uphi (uuzithoobile). 🗣 7. Uthi uLebo uye khabo (urarekile). 😱 8. uMandla ugijimela ekhabo ukuyofumana uLebo (uyagijima). 🏃 9. wamfunyana, wajabula. 😆 10. Uyamanga . 🤗 Ungangezelela nawe ukwenzela bona iAwalwana le ibe mnandi khulu begodu unikeze abantwana amathuba amanengi wokulingisa Awakuveza amazizo wazo.

source: This is the story, as well as Mandla’s actions and emotions:
nbl: Nasi iAwalwana, kunye Awakulingisa nemizwa kaMandla:
