Repository: Ari-Ramkilowan/po-files
Catalog: translations/LGroup1(Release (open))_Xhosa.po
Languages: xho

source: Read the notes
xho: Funda amanqaku

source: See what you need
xho: Bona okudingayo

source: See how it works
xho: Jonga ukuba isebenza njani

source: Back to menu
xho: Buyela kwimenyu

source: This game develops:
xho: Lo mdlalo uphuhlisa:

source: Let’s try the Finding Challenge. 👀
xho: Masizame ukufumana umceli-mngeni. 👀

source: This one is easy to get organised, all you need is toys and items (like the ones in the picture) laid out in your play area. 🤖
xho: Oku kulula okuhlangabeza, konke okudingayo zithoyi nezinye izinto (ezifana nezi zisemfanekisweni) ezikhutswe kwindawo yakho yokudlala. 🤖

source: ✔️Social ✔️Talking & Understanding
xho: ✔️Izakhono zasekuhlaleni ✔️Ukuthetha kunye nokuqonda

source: Once everything is laid out on the floor: 1. Get all the children to stand in a circle around the items on the floor. 2. Tell them they have 20 seconds to find an item that matches the description you’re going to give them. 3. Give them a description like soft, blue, big or small. There are more examples in the extra ideas message. 4. Count up to 20 as they search for the right toy or item. 5. Ask each child to show everyone what they picked up and why it matches what you said. 6. Ask older children to shout out ideas of what to look for next.
xho: Emva kokuba yonke into indlaliwe phantsi: 1. Fumana bonke abantwana ukuba bajonge kwisangqa ngokujikeleza izinto phantsi. 2. Batsho ukuba banemizuzwana engama-20 ukufumana into ehambelana nencazelo oya kubanika yona. 3. Banike inkcazo efana ne-soft, eluhlaza okwesibhakabhaka, enkulu okanye encinci. Kukho imizekelo eminye kwisigidimi sombono. 4. Bala ukuya kuma-20 njengoko befuna umdlalo okanye into. 5. Buza ngamnye umntwana ukuba abonise wonke umntu oko bawuthatheyo kwaye kutheni uhambelana nento othethileyo. 6. Buza abantwana abadala ukuba bakhuphe iingcamango zento ozakujonga ngayo.

source: When giving the children descriptions to match the items, try these examples: • Soft 🐶 • Hard 👷 • Smooth 🐚 • Rough 🦔 • Long 🦒 • Red 🔴 • Round ⚽ • Square 💾 • Plastic 📏 If two children go for the same item, suggest another item to one of them.
xho: Sinika abantwana iingcaciso ukumataisa izinto, zama le mizekelo: • Ithambile 🐶 • Iqinile 👷 • Impuluswa🐚 • Irhabaxa 🦔 • Inde 🦒 • Ibomvu 🔴 • Ingqukuva ⚽ • Isweri 💾 • Yiplstiki 📏 Ukuba abantwana ababini bakhetha into enye, bacebise ngenye into kubo.
