Repository: Ari-Ramkilowan/po-files
Catalog: translations/LGroup11(Release (open))_Swati.po
Languages: ssw

source: Read the notes
ssw: Fundza emanotsi

source: Back to menu
ssw: Buyela emuva kumenyu

source: See what you need
ssw: Buka kutsi yini loyidzingako

source: See how it works
ssw: Buka kutsi isebenta njani

source: This game develops
ssw: Lomdlalo utfutfukisa:

source: There’s too much bad news in the newspaper, so let’s cut it up and Make a Papier Mache Bowl. ✂📰= 🥣
ssw: Kunetindzaba letinyenti letimbi emaphephandzabeni, ngako-ke asilijube sente Sitja Lesakhiwe Ngeliphepha. ✂📰= 🥣

source: To make 6 bowls of mache you will need: * 2 cups flour * 2 cups of water * 1 tablespoon of salt * A mixing bowl and spoon * Strips of newspaper * Paint to decorate
ssw: Kwenta titja letisi-6 ngemaphepha utawudzinga: 1. 2 tinkhomishi tafulawa 2. 2 tinkhomishi temanti 3. 1 sipunu sasawoti 4. Sitja sekubhucela kuso nesipunu 5. Tidlephu temaphepha 6. Ipendi yekuhlobisa

source: The most important note is don’t eat out of this bowl, because it will fall apart. Also: 1. You can do this to make bowls for the pretend area, or you can do it as an art activity with each child. Make sure you have enough small bowls for each child. 2. You can make other things out of paper mache: A bee using a balloon and cardboard, or get the children to make a papier mache hat or some funny animals.
ssw: Lokubalulekile lekufanele ukwati kutsi akekho lekufanele adlele kulesitja, ngoba sitawubhidlika. Futsi: 1. Ungakwenta loku kwenta titja talendzawo yekudlalela, noma ungakwenta njengemsebenti webuciko nemtfwana ngamunye. Cinisekisa kutsi unetitjane letanele temntfwana ngamunye. 2. Ungenta letinye titfo ngemaphephandzaba: Inyosi nisebentisa ibhaluni nelikhadibhodi, noma utsi bantfwana abakhe sigcoko lesentiwe ngalenhlama yemaphepha noma silwane lesijabulisako.

source: ✔️Exploring & Finding out ✔️Arm & Hand Control
ssw: ✔️Kufunisisa nekutfola kabanti ✔️Kulawula sandla nemkhono

source: I should give you a heads up now, that this is a messy business. 👩🏿‍🎨 1. Tear 5 large pieces of newspaper into strips. 2. Mix flour, water and salt in big bowl to make a paste. 3. Take a small bowl – plastic is best. 4. Dip newspaper strips into the paste and layer over the bowl. 5. Do 3 or 4 more layers. 6. Leave to dry for 2 days, or until it’s hard. 7. Gently press it out the bowl. It will pop out. 8. Paint and decorate.
ssw: Kutawufanele kutsi ngikucwayise nyalo, kwekutsi lona ngumsebenti lobanga budlabha. 👩🏿‍🎨 1. Juba tidlephu letisi-5 letinkhulu temaphephandzaba. 2. Hlanganisa fulawa, emanti nasawoti esitjeni lesikhulu kute wente kwekunamatsisela. 3. Tsatsa sitja lesincane – seplastiki sikahle kakhulu. 4. Faka letidlephu teliphephandzaba ngekhatsi kwalenhlama yekunamatsisela bese utifaka kulendishi. 5. Phindza ufake futsi letinye tendlalelo leti-3 noma 4. 6. Yekela kutsi kome emalanga la-2, noma kuze kucine. 7. Cindzetela ngekunakekela ngekhatsi kwalesitja. Kutawubese kuyaphuma. 8. Kupende ukuhlobise.
