Repository: Ari-Ramkilowan/po-files
Catalog: translations/LGroup2(Release (open))_Afrikaans.po
Languages: afr

source: See what you need
afr: Kyk wat jy nodig het

source: See how it works
afr: Kyk hoe dit werk

source: Read the notes
afr: Lees die notas

source: Back to menu
afr: Terug na spyskaart

source: This game develops:
afr: Hierdie speletjie ontwikkel:

source: Why not tell The Feelings Story? 🎭
afr: Waarom vertel jy nie Die Storie oor Gevoelens (The Feelings Story) nie? 🎭

source: ✔️Social ✔️Emotional
afr: ✔️Sosiale vaardighede ✔️Emosionele vaardighede

source: This game is all about imagination, so all you need is the children, and the story in the notes,or you can use puppets.
afr: Hierdie speletjie gaan oor die verbeelding en al wat jy dus nodig het, is die kinders en die storie in die notas, of jy kan handpoppe gebruik.

source: Get ready for some acting! Lights, camera, action! 🎬 1. Tell the children the story, using puppets if you have them. 2. If not, use lots of actions, facial expressions and different voices to make it exciting. 3. Then ask the children to stand up. 4. Tell them the story again, one line at a time and ask the children to do the actions of the character Mandla. 5. Also encourage them to do facial expressions by saying, “what does a sad face look like?” or “show me a happy face.” 6. Encourage them to take part and do any action they want to, so that they’re a part of the story.
afr: Kry reg vir toneelspel. Ligte, kamera, aksie! 🎬 1. Vertel die kinders ’n storie, gebruik handpoppe as jy het. 2. Indien nie, gebruik baie aksies, gesigsuitdrukkings en verskillende stemtone om dit opwindend te maak. 3. Vra dan die kinders om op te staan. 4. Vertel weer die storie, een reël op ’n slag en vra die kinders om die aksies van die karakter Mandla te doen. 5. Spoor hulle ook aan om gesigsuitdrukkings te gebruik deur te sê, “Hoe lyk ’n hartseer gesig?” of “Wys my hoe lyk ’n gelukkige gesig”. 6. Moedig hulle aan om deel te neem en enige aksie te doen wat hulle wil sodat hulle deel van die storie is.

source: 1. Mandla wants to go and play with his friend Lebo (he’s excited) 😃 2. Mandla’s mama says he can go (he’s happy) 🙂 3. Mandla walks to Lebo’s house (he’s walking)🚶 4. When he gets to Lebo’s house she’s not there (he’s sad) 😞 5. So Mandla sits on the step and waits for her (he sits and feels tired) 😓 6. Lebo’s mama arrives (he’s pleased) 😁and Mandla asks where Lebo is (he’s polite) 🗣 7. She says that Lebo has gone to Mandla’s house (he’s surprised) 😱 8. Mandla runs home to find Lebo (he’s running). 🏃 9. She is there and he is happy. 😆 10. He hugs her. 🤗 You can add to the story to make it more exciting and give the children more chances to mime actions or express feelings.
afr: 1. Mandla wil met sy maatjie Lebo gaan speel (hy is opgewonde). 😃 2. Mandla se mamma sê hy mag gaan (hy is gelukkig). 🙂 3. Mandla stap na Lebo se huis (hy loop). 🚶 4. Wanneer hy by Lebo se huis kom, is sy nie daar nie (hy is hartseer). 😞 5. Mandla gaan sit op die trappie en wag op haar (hy sit en voel moeg). 😓 6. Lebo se mamma kom tuis (hy is bly) 😁 en Mandla vra waar Lebo is (hy is beleefd). 🗣 7. Sy sê Lebo het na Mandla se huis toe gegaan (hy is verras). 😱 8. Mandla hardloop huis toe om Lebo te vind (hy hardloop). 🏃 9. Sy is daar en hy is gelukkig. 😆 10. Hy gee haar ’n drukkie. 🤗 Jy kan uitbrei op die storie om dit meer opwindend te maak en die kinders kans te gee om meer aksies na te boots of gevoelens uit te druk.
