Repository: Ari-Ramkilowan/po-files
Catalog: translations/LGroup8(Release (open))_Southern Sotho.po
Languages: sot

source: Read the notes
sot: Bala dinoutso

source: Back to menu
sot: Kgutlela ho menu

source: See what you need
sot: Sheba seo o se hlokang

source: See how it works
sot: Bona hore e sebetsa jwang

source: The most important thing about this list is that there has to be one per child so that no one feels left out. 1. Clothing for dress up 2. 1 hat per child 3. 1 scarf per child 4. 1 necklace per child 5. 1 pair of sunglasses per child 6. Whatever else you have, as long as there is one per child 7. Music 8. Space to dance
sot: Ntho ya bohlokwa ka ho fetisisa mabapi le lenane lena ke hore ho lokela hore ho be le e le nngwe bakeng sa ngwana ka mong ele hore ho se be le ya ikutlwang eka o qhelelwa thoko. 1. Diaparo tsa ho apara 2. Katiba e le 1 ngwana ka mong 3. Sekhafo se le 1 ngwana ka mong 4. Sefaha se le 1 ngwana ka mong 5. Diborele tsa letsatsi para e 1ngwana ka mong 6. Eng kapa eng eo o nang le yona, ha feela ho ena le e le nngwe bakeng sa ngwana ka mong 7. Mmino 8. Sebaka sa ho tantsha

source: There’s nothing like a getting Dressed Up. 💅🏿
sot: Ha ho ntho e jwaloka ho Apara Hantle. 💅🏿

source: This game develops
sot: Papadi ena e ntshetsa pele:

source: ✔️Social ✔️Songs , Rhymes & Sounds
sot: ✔️Bokgoni ho tsa phedisano ✔️Dipina, diraeme le medumo

source: Parents love this game because it teaches children how to dress themselves. 1. Choose 5 types of clothing or props, and make sure there’s enough for each child to have one. 2. Put the items in the middle of the room. 3. Make the children form a circle around the pile of clothes and props. 4. Sing a rhyme or play music. 5. Get the children to dance around. When the music stops, name an item. 6. Each child has to grab one of what you’ve said and put it on, then keep dancing. 7. Carry on until they’re all dressed up.
sot: Batswadi ba rata papadi ena hobane e ruta bana ho ikapesa. 1. Kgetha mefuta e 5 ya diaparo kapa diporopo, mme o etse bonnete bah ore ho na le tse lekaneng bakeng sa ngwana ka mong. 2. Bea dintho tseo bohareng ba phaposi. 3. Etsa hore bana ba etse sedikadikwe ho pota qubu ya diaparo le diporopo. 4. Binang raeme kapa o bapale mmino. 5. Ere bana ba tantshe hohle. Ha mmino o emisa, bitsa ntho e le nngwe. 6. Ngwana ka mong o lokela ho nka e le nngwe ya dintho tseo o di bitsitseng mme a e apare, ebe o tswela pele ho tantsha. 7. Tswela pele ho fihlela bohle ba apere.

source: Here are some clothing ideas:👓👛🧥👒👚👖👔👙👠🧦🧤🎩👕🧣👟🧢👜🕶🎒👗 A rhyme you can sing: We are getting dressed We must look our best Dance dance dance And now’s you last chance To put your ___________ ON!
sot: Mehopolo ke ena bakeng sa diaparo: 👓👛🧥👒👚👖👔👙👠🧦🧤🎩👕🧣👟🧢👜🕶🎒👗 Raeme eo o ka e binang: Re a apara Re lokela ho ba batle Tantsha Tantsha tantsha Jwale ke monyetla wa hao wa ho qetela Ho apara ___________ YA HAO!
