Repository: Ari-Ramkilowan/po-files
Catalog: translations/LGroup6(Release (open))_Afrikaans.po
Languages: afr

source: Read the notes
afr: Lees die notas

source: See what you need
afr: Kyk wat jy nodig het

source: See how it works
afr: Kyk hoe dit werk

source: Back to menu
afr: Terug na spyskaart

source: Horses are great, but not everyone is a pony. 🦄 The kids can pretend to be other animals like elephants, lions, cats, dogs, rabbits etc. Each child can give themselves an animal name. The rhyme you can sing goes like this: Horsie horsie jumping high Horsie horsie touch the sky Horsie horsie go around Horsie horsie touch the ground
afr: Perde is wonderlik, maar nie almal is ’n ponie nie. 🦄 1. Die kinders kan maak of hulle ander diere is, soos olifante, leeus, katte, honde, hase, ens. 2. Elke kind kan hulself ’n diernaam gee. Die rympie wat jy kan sing, klink so: Perdjie perdjie spring hoog Perdjie perdjie raak aan die lug Perdjie perdjie draai om Perdjie perdjie raak aan die grond

source: ✔️Songs , Rhymes & Sounds ✔️Walking & Moving
afr: ✔️Liedjies, rympies en klanke ✔️Loop en beweeg

source: Get a small boxes to jump over and a space to move around in. It’s time to see who’s the best horsey. 🎠
afr: Kry klein boksies om oor te spring en ’n ruimte om in rond te beweeg. Dis tyd om te sien wie die beste perdjie is. 🎠

source: This game develops
afr: Hierdie speletjie ontwikkel:

source: If the children have been sitting all morning for the small group activity, it might be nice to get them moving with Jumping Horse. 🐎
afr: As die kinders al heeloggend gesit het tydens die aktiwiteit vir ’n klein groep, kan dit goed wees om hulle aan die beweeg te kry met Springende Perd (Jumping Horse). 🐎

source: Start with some basic horse-play🐴 1.Ask the children to stand in a circle and pretend to be a horse. 2. Ask them to make the sound of a horse. 3. Trot around in a circle like horses. 4. Put out a small box and get each child to jump over the box like a horse. 5. Put out a few more boxes for them to jump over. 6. Keep making horse noises as you play. 7.You can add a rhyme if you want.
afr: Begin met ’n paar basiese perdespeletjies. 🐴 1. Vra die kinders om in ’n sirkel te staan en te maak of hulle ’n perd is. 2. Vra hulle om die geluid van ’n perd te maak. 3. Draf soos perde rond in ’n sirkel. 4. Sit ’n boksie neer en laat elke kind daaroor spring soos ’n perd. 5. Sit ’n paar boksies neer waaroor hulle kan spring. 6. Hulle hou aan om perdegeluide te maak terwyl hulle speel. 7. Jy kan ’n rympie byvoeg as jy wil.
