Repository: Ari-Ramkilowan/po-files
Catalog: translations/LGroup10(Release (open))_Swati.po
Languages: ssw

source: See what you need
ssw: Buka kutsi yini loyidzingako

source: See how it works
ssw: Buka kutsi isebenta njani

source: Read the notes
ssw: Fundza emanotsi

source: Back to menu
ssw: Buyela emuva kumenyu

source: Put your creativity to the test and build 1 fun creature out of Lego. 🦖It’s best to build it before class so that all of the time is spent on the activity
ssw: Ase uhlole likhono lakho bese utakhela yinye intfo leyindalo ngekusebentisa i-LEGO. 🦖 Kungaba kahle kukwakha phambi kweliklasi kute kutsi sonkhe lesikhatsi sicitfwe kulomsebenti.

source: This game develops
ssw: Lomdlalo utfutfukisa:

source: See who’s the best explorer with Hide the Toy. 🤠
ssw: Buka kutsi ngubani lofunisisa kahle ngemdlalo Wekufihla Lithoyisi.🤠

source: ✔️Skills for Learning ✔️Songs , Rhymes & Sounds
ssw: ✔️Emakhono ekufundza ✔️Tingoma, tilandzelo nemisindvo

source: Read teh notes
ssw: Fundza emanotsi

source: Once you have your unique creation: 1. Show it to all the children. 2. Choose a child to hide the creature. 3. Tell the other children to go outside or close their eyes while it’s being hidden. 4. When hiding, the top of the creature must be showing to make it easier to find. 5. Bring the other children in to look for the creature. 6. Say “hot”, if anyone comes close to it. 7. Say “cold”, when they are far from it. 8. Sing a finding rhyme as they go. 9. Whoever finds it must shout ‘I found it!’ and the game repeats.
ssw: Uma ngabe sewunalentfo yakho lehlukile lotakhele yona: 1. Yikhombise bonkhe bantfwana. 2. Khetsa umntfwana lotawufihla lolotakhele kona. 3. Cela lalabanye bantfwana kutsi baye ngaphandle noma bavale emehlo ngalesikhatsi ukufihla. 4. Ngalesikhatsi ufihla, lelingetulu laloku lokwakhile kufanele ulivete kute kutsi kube lula kukutfola. 5. Tsani nalalabanye bantfwana abacale babuke loku lokwakhile. 6. Tsani “kuyashisa”, uma ngabe kukhona losendzele dvutane nako. 7. Tsani “kuyabandza”, uma ngabe bakhashane nayo. 8. Baculele silandzelo sekuyitfola ngalesikhatsi bayibuka 9. Noma ngubani loyitfolako kufanele amemete atsi “Ngiyitfolile!” bese lomdlalo uyaphindvwa.

source: If you don’t have Lego blocks or are running out of time use a funky toy. 👾 Make sure you give lots of children chances to hide the toy and help them by giving them clues. The Finding Rhyme Can you spy, with your little eye The creature that’s hiding away? Look with your eyes and you will see What you will find it today.
ssw: Uma ngabe ungenawo emabhuloki eLEGO noma sekayaphela, sebentisa lithoyisi. 👾 Cinisekisa kutsi uniketa bantfwana labanyenti ematfuba ekufihla lelithoyisi ubuye ubasite ngekubanika tinkhomba. Silandzelo sekuyitfola Ungaba yinhloli, ngeliso lakho lelincane Lesilwane lesibhacile? Buka ngemehlo akho bese utawubona Kwekutsi yini lotayitfola.
