Repository: Ari-Ramkilowan/po-files
Catalog: translations/LGroup7(Release (open))_Zulu.po
Languages: zul

source: Read the notes
zul: Funda amanothi

source: Back to menu
zul: Buyela kumenyu

source: See what you need
zul: Bheka ukuthi yini oyidingayo

source: See how it works
zul: Bheka ukuthi kusebenza kanjani

source: Let the kids sit around you and: 1. Put all 8 items on a tray. Eg. a comb , toothbrush, teaspoon, coin, fork, crayon, string, elastic band, peg, egg, stick, stone, leaf, lid, ball, shell etc. 🍭🕶🎾🧦⌚🔋🕯🔑🖍📏🥄🌼🧤🥚 2. Let the children look at the tray for a minute, then cover it with the cloth. 3. Without the children take one item off the tray. 4. Remove the cloth. 5. The children have to guess which item is gone. 6. Repeat with another item and ask questions about each item.
zul: Izingane mazihlale zikuzungeze bese wena: 1. Beka zonke izinto eziyisi-8 ethileyini. Isibonelo ikamu, isixubho, ithispuni, uhlamvu lwemali, imfoloko, ikhrayoni, intambo, i-elastic band, ipheksi, iqanda, uthi, itshe, iqabunga, isivalo, ibhola, igobolondo njll. 🍭🕶🎾🧦⌚🔋🕯🔑🖍📏🥄🌼🧤🥚 2. Izingane mazibuke ithileyi umzuzu, bese ulemboza ngendwangu. 3. Zingabhekile, susa into eyodwa ethileyini. 4. Susa indwangu. 5. Izingane kufanele ziqagele ukuthi yini engasekho. 6. Kuphinde lokhu ngenye into bese ubuza imibuzo ngento ngayinye.

source: To keep the kiddies focussed ask some questions like: 1. What is this? 2. Who has one at home? 3. What do you use it for? 4. Who can show me how to use it?
zul: Ukuze ugcine izingane zilalele buza imibuzo efana nokuthi: 1. Yini le? 2. Obani onayo ekhaya? 3. Isetshenziselwa ukwenzani? 4. Ubani ongangikhombisa ukuthi isetshenziswa kanjani?

source: This game develops
zul: Lo mdlalo uthuthukisa:

source: If the day has been full of physical activities, you might want to balance it with The Memory Game. 🧠
zul: Uma usuku belumatassa yimisebenzi eyenziwa ngomzimba, mhlawumbe ungalinganisa ngomdlalo Wokukhumbula. 🧠

source: ✔️Skills for Learning ✔️Talking & Understanding
zul: ✔️Amakhono okufunda ✔️Ukukhuluma nokuqonda

source: Sometimes it’s nice to just sit down with 8 small items, a tray and a cloth. Just kidding, that’s not a thing, but it what you need for this activity.
zul: Kwesinye isikhathi kumnandi ukuzihlalela phansi nezinto ezincane eziyisi-8, ithileyi nendwangu. Ngiyadlala, hhayi into nje, yilokho okudingela lo msebenzi.
