Repository: Ari-Ramkilowan/po-files
Catalog: translations/LGroup4(Release (open))_Venda.po
Languages: ven

source: See how it works
ven: Zwi shumisa hani

source: See what you need
ven: Zwine vha ṱoḓa

source: Read the notes
ven: Kha vha vhale notsi

source: Back to menu
ven: Kha vha humele murahu kha menyu

source: This game develops
ven: Mutambo uyu u bveledza:

source: Why not end the day with a song like Head and Shoulders?
ven: Ndi ngani ḓuvha ḽavho ḽi sa fheli nga u imba luimbo Ṱhoho Mahaḓa?

source: All you need is the song and some cute kids to teach them to. 🎵🎶
ven: Zwine vha ṱoda ndi luimbo na vhana uri vha vha gudise u imba luimbo. 🎵🎶

source: ✔️Songs , Rhymes & Sounds ✔️Walking & Moving
ven: ✔️Nyimbo, mutevhetsindo na mibvumo ✔️U tshimbila na u sudzuluwa

source: The song goes a little something like this: Heads, shoulders, knees and toes, knees and toes Heads, shoulders, knees and toes, knees and toes And eyes and ears and mouth and nose Heads and shoulders, knees and toes, knees and toes. You can sing in your own language too. And remember to point to each body part as you say it.
ven: Luimbo lu imbiwa ngaurali: Ṱhoho, mahaḓa, magona zwikunwane, magona zwikunwane Ṱhoho, mahaḓa, magona zwikunwane, magona zwikunwane Maṱo na nḓevhe na mulomo na ningo Ṱhoho, mahaḓa, magona zwikunwane, magona zwikunwane. Vha nga luimba nga nḓila ine lwa imbiwa ngalwo nga luambo lwavho. Vha humbule u fara tshipiḓa tshiṅwe na tshiṅwe tsha muvhili musi vha tshi khou tshi bula.

source: Sing the song: ‘Head and Shoulders’ (which you can find in the notes) and do these actions. 1. Tap each body part as you sing it. (Tap your head when you sing “head” and shoulders when you sing “shoulders”. 2. The second time you sing the song leave out the head and don’t tap it. Instead replace the body part with “hmmm”. 3. The third time you sing the song, replace the shoulders with “hmmm” instead of the head. Each time you sing, replace the next body part with “hmmm” and no tapping so that each body part gets left out once.
ven: “Ṱhoho Mahaḓa” (lune vha nga lu wana kha notsi) vha ite nyito dzi tevhelaho. 1. Kha vha fare tshipiḓa tshiṅwe na tshiṅwe tsha muvhili musi vha tshi khou imbelela. (Kha vha fare ṱhoho musi vha tshi imbelela “ṱhoho” na mahaḓa musi vha tshi imbelela “mahaḓa”). 2. Lwa vhuvhili musi vha tshi khou imbelela luimbo. Kha vha litshe vha songo fara ṱhoho. Kha vha shumise “hmmm” u imelela tshipiḓa tsha muvhili. 3. Lwa vhuraru musi vha tshi khou imba luimbo kha vha shumise “hmmm” u imbelela mahaḓa hu si ṱhoho. 4. Tshifhinga tshiṅwe na tshinwe vha tshi imbelela kha vha shumise “hmmm” u imelela tshipiḓa tshi tevhelaho tsha muvhili vha sa fari u itela uri tshipiḓa tshiṅwe na tshiṅwe na tshiṅwe tsha muvhili tshi songo ambiwa luthihi luthihi.
