Repository: Ari-Ramkilowan/po-files
Catalog: translations/LGroup10(Release (open))_Southern Sotho.po
Languages: sot

source: See what you need
sot: Sheba seo o se hlokang

source: See how it works
sot: Bona hore e sebetsa jwang

source: Read the notes
sot: Bala dinoutso

source: Back to menu
sot: Kgutlela ho menu

source: Put your creativity to the test and build 1 fun creature out of Lego. 🦖It’s best to build it before class so that all of the time is spent on the activity
sot: Bea boqapi ba hao tekong mme o ahe sebopuwa se le seng se thabisang ka LEGO. 🦖 Ho molemo ho se aha pele ho tlelase ele hore nako yohle e sebedisetswe ketsahalo.

source: This game develops
sot: Papadi ena e ntshetsa pele:

source: See who’s the best explorer with Hide the Toy. 🤠
sot: Bona hore mosibolli e moholo ke mang ka Pata Thoye (Hide the Toy). 🤠

source: ✔️Skills for Learning ✔️Songs , Rhymes & Sounds
sot: ✔️Bokgoni bakeng sa ho ithuta ✔️Dipina, diraeme le medumo

source: Read teh notes
sot: Bala dinoutso

source: Once you have your unique creation: 1. Show it to all the children. 2. Choose a child to hide the creature. 3. Tell the other children to go outside or close their eyes while it’s being hidden. 4. When hiding, the top of the creature must be showing to make it easier to find. 5. Bring the other children in to look for the creature. 6. Say “hot”, if anyone comes close to it. 7. Say “cold”, when they are far from it. 8. Sing a finding rhyme as they go. 9. Whoever finds it must shout ‘I found it!’ and the game repeats.
sot: Hang ha o se o ena le popo ya hao e ikgethileng: 1. E bontshe bana bohle. 2. Kgetha ngwana ya ka patang sebopuwa seo. 3. Bolella bana ba bang hore ba ye ka ntle kapa ba tutubale ha se ntse se patwa. 4. Ha se patwa, bokahodimo ba sebopuwa bo lokela ho hlahella ho nolofaletsa ba bang ho se fumana. 5. Ere bana ba bang ba kgutlele ka tlelaseng ho tla batlana le sebopuwa seo. 6. Ere “o a tjhesa” haeba motho a atamela ho sona. 7. Ere “o a bata”, ha ba le hole le sona. 8. Binang raeme ya ho fumana ha ba ntse ba batlana le sona. 9. Motho ya se fumanang o lokela ho hoeletsa “ke e fumane!” mme papadi e phetwa hape.

source: If you don’t have Lego blocks or are running out of time use a funky toy. 👾 Make sure you give lots of children chances to hide the toy and help them by giving them clues. The Finding Rhyme Can you spy, with your little eye The creature that’s hiding away? Look with your eyes and you will see What you will find it today.
sot: Haeba o se na diboloko tsa LEGO kapa di sa lekana, sebedisa thoye e qabolang. 👾 Etsa bonnete ba hore o fa bana ba bangata monyetla wa ho pata thoye mme o ba thuse ka ho ba fa mehlala. Raeme ya ho Fumana Na o ka sheba, ka mahlwana a hao Sebopuwa se ipatileng? Sheba ka mahlo a hao mme o tla bona Seo o tlang hose fumana kajeno.
