Repository: Ari-Ramkilowan/po-files
Catalog: translations/LGroup7(Release (open))_Tsonga.po
Languages: tso

source: Read the notes
tso: Hlaya tinotsi

source: Back to menu
tso: Ku tlhelela eka menyu

source: See what you need
tso: Vona leswi u swi lavaka

source: See how it works
tso: Vona leswaku swi tirha njhani

source: Let the kids sit around you and: 1. Put all 8 items on a tray. Eg. a comb , toothbrush, teaspoon, coin, fork, crayon, string, elastic band, peg, egg, stick, stone, leaf, lid, ball, shell etc. 🍭🕶🎾🧦⌚🔋🕯🔑🖍📏🥄🌼🧤🥚 2. Let the children look at the tray for a minute, then cover it with the cloth. 3. Without the children take one item off the tray. 4. Remove the cloth. 5. The children have to guess which item is gone. 6. Repeat with another item and ask questions about each item.
tso: Endla leswaku vana va tshama va ku rhendzela kutani: 1. U veka tiayitheme hinkwato le ta 8 ethireyini. Xikombiso, xikamu, burachi ya meno, xilepulana, khoyini, foroko, khirayoni, xitiringi, rhekerhe, phekisi, tandza, rimhandzi, ribye, tluka, xipfalo, xikhamba na swin’wana. 🍭🕶🎾🧦⌚🔋🕯🔑🖍📏🥄🌼🧤🥚 2. Endla leswaku vana va languta thireyi ku ringana minete, kutani u yi funengeta hi lapi. 3. Teka ayitheme yin’we eka thireyi, vana va nga ri ku swi voneni. 4. Susa lapi. 5. Vana va fanele ku bvumba leswaku i ayitheme yihi yi nga ha riki kona. 6. Vuyelela hi ayitheme yin’wana na ku vutisa swivutiso hi ayitheme yin’wana na yin’wana.

source: To keep the kiddies focussed ask some questions like: 1. What is this? 2. Who has one at home? 3. What do you use it for? 4. Who can show me how to use it?
tso: Ku endla leswaku vana va kokekaka rinoko, vutisa swivutiso swo fana na leswi: 1. Xana i yini lexi? 2. Xana i mani loyi a nga na xona ekaya? 3. Xana u xi tirhisa ku endla yini? 4. Xana i mani a nga ndzi kombaka leswaku xi tirhisiwa njhani?

source: This game develops
tso: Ntlangu lowu wu ya emahlweni:

source: If the day has been full of physical activities, you might want to balance it with The Memory Game. 🧠
tso: Loko ku ri leswaku siku a ri tele hi migingiriko yo tirhisa miri, u nga lava ku swi balansisa hi Ntlangu wo Tsundzuka. 🧠

source: ✔️Skills for Learning ✔️Talking & Understanding
tso: ✔️Swikili swo dyondza ✔️Ku vulavula na ku twisisa

source: Sometimes it’s nice to just sit down with 8 small items, a tray and a cloth. Just kidding, that’s not a thing, but it what you need for this activity.
tso: Nkarhi wu’wana swi kahle ku tshama ehansi na 8 wa tiayitheme letintsongo, thireyi na lapi. Ndzo tlanga, sweswo a hi nchumu, kambe hi leswi u swi lavaka eka nghingiriko lowu.
