Repository: Ari-Ramkilowan/po-files
Catalog: translations/LGroup2(Release (open))_Swati.po
Languages: ssw

source: See what you need
ssw: Buka kutsi yini loyidzingako

source: See how it works
ssw: Buka kutsi isebenta njani

source: Read the notes
ssw: Fundza emanotsi

source: Back to menu
ssw: Buyela emuva kumenyu

source: This game develops:
ssw: Lomdlalo utfutfukisa:

source: Why not tell The Feelings Story? 🎭
ssw: Kungani ungacoci lendzaba Yendlela Lotiva Ngayo? 🎭

source: ✔️Social ✔️Emotional
ssw: ✔️Emakhono ekuphila ✔️Emakhoni ekuveta indlela lotiva ngayo

source: This game is all about imagination, so all you need is the children, and the story in the notes,or you can use puppets.
ssw: Lomdlalo wonkhe uphatselene nekucabanga, konkhe lokudzingako nje bantfwana, kanye nalendzaba lekulamanotsi, noma ungasebentisa emaphaphethi.

source: Get ready for some acting! Lights, camera, action! 🎬 1. Tell the children the story, using puppets if you have them. 2. If not, use lots of actions, facial expressions and different voices to make it exciting. 3. Then ask the children to stand up. 4. Tell them the story again, one line at a time and ask the children to do the actions of the character Mandla. 5. Also encourage them to do facial expressions by saying, “what does a sad face look like?” or “show me a happy face.” 6. Encourage them to take part and do any action they want to, so that they’re a part of the story.
ssw: Tilungiselele kulingisa! Emalambu, ikhamera, kulingisa! 🎬 1. Cocela labantfwana lendzaba, usebentise emaphaphethi uma ngabe unawo. 2. Uma unegenawo, sebentisa tento letinyenti, indlela lobukeka ngayo ebusweni kanye nemavi lahlukene kute ukwente kujabulise. 3. Cela bantfwana kutsi basukume. 4. Bacocele lendzaba futsi, umugca munye ngesikhatsi bese ucela labantfwana kutsi bente loku lokwentiwa ngumlingiswa Mandla. 5. Phindza ubakhutsate kutsi bakhulume ngekusebentisa buso ngekutsi batsi, “buso lobunyukubele bubukeka njani?” noma “Ngikhombise buso lobujabulile.” 6. Bakhutsate kutsi bangenelele kutsi bente noma yini labafuna kuyenta, kute kutsi babe yincenye yalendzaba.

source: 1. Mandla wants to go and play with his friend Lebo (he’s excited) 😃 2. Mandla’s mama says he can go (he’s happy) 🙂 3. Mandla walks to Lebo’s house (he’s walking)🚶 4. When he gets to Lebo’s house she’s not there (he’s sad) 😞 5. So Mandla sits on the step and waits for her (he sits and feels tired) 😓 6. Lebo’s mama arrives (he’s pleased) 😁and Mandla asks where Lebo is (he’s polite) 🗣 7. She says that Lebo has gone to Mandla’s house (he’s surprised) 😱 8. Mandla runs home to find Lebo (he’s running). 🏃 9. She is there and he is happy. 😆 10. He hugs her. 🤗 You can add to the story to make it more exciting and give the children more chances to mime actions or express feelings.
ssw: 1. Mandla ufuna kuhamba ayodlala nemngani wakhe Lebo (ujabulile). 😃 2. Make waMandla utsi angahamba (ujabulile) 3. Mandla uyahamba uya khabo Lebo (uyahamba). 🚶 4. Ngalesikhatsi afika khabo Lebo utfola kutsi akekho (ukwatile). 😞 5. Mandla uhlala etitebhisini uyamlindza (uyahlala utiva ukhatsele). 😓 6. Make waLebo uyafika (ujabulile) 😁 Mandla ubuta kutsi Lebo ukuphi (ngemoya lophansi). 🗣 7. Utsi Lebo uye kuMandla (ummangele). 😱 8. Mandla uyagijima uya ekhaya kutfola Lebo (uyagijima). 🏃 9. Ukhona sewuyajabula. 😆 10. Uyamanga. 🤗 Ungangeta kulendzaba kuyenta ibe mnandzi kantsi unike bantfwana ematfuba lamanyenti ekuhumutela basho lolokwentekako noma bavete indlela labativa ngayo.

source: This is the story, as well as Mandla’s actions and emotions:
ssw: Lena ngulendzaba, kanye nendlela Mandla lenta ngayo nalativa ngayo:
