Repository: Ari-Ramkilowan/po-files
Catalog: translations/LGroup3(Release (open))_Afrikaans.po
Languages: afr

source: Read the notes
afr: Lees die notas

source: See what you need
afr: Kyk wat jy nodig het

source: Back to menu
afr: Terug na spyskaart

source: See how it works
afr: Kyk hoe dit werk

source: I meant it when I said it was easy. All you need is: 1. A big space to play 2. A blindfold
afr: Ek was ernstig toe ek gesê het dis maklik. Al wat jy nodig het, is: 1. ’n Groot ruimte om te speel 2. ’n Blinddoek

source: This game develops
afr: Hierdie speletjie ontwikkel:

source: Here are a few handy hints 1. Walk around with your arms out in front of you so that you don’t bump into anything or anyone. 2. Ask if you are hot 🔥 or cold ❄ so that the children can give you clues. 3. Let the older children have a turn with the blindfold if they want.
afr: Hier is ’n paar nuttige wenke: 1. Loop rond met jou arms voor jou sodat jy nie in iets of iemand vasloop nie. 2. Vra of jy warm 🔥 of koud ❄ is sodat die kinders jou leidrade kan gee. 3. Laat die ouer kinders ’n beurt met die blinddoek kry, as hulle wil.

source: Have you played The Blind Man with the children? It’s really easy. 🙈
afr: Het jy al Die Blinde Man (The Blind Man) met die kinders gespeel? Dit is regtig maklik. 🙈

source: Here’s how you play the game: 1. Tell the children you are going to play The Blind Man. 2. Say that you’re going to put a blindfold on so that you can’t see, and show them the blindfold. 3. Find a big space. 4. Ask the children to find a place to stand. 5. They are not allowed to move from that spot. 6. Move through the space with your blindfold on. 7. If you get close to a child, they must shout “hot!” 8. If you are far away, they must shout “cold!” 9. When you find a child, feel their faces and guess who it is.
afr: Dis hoe die speletjie gespeel word: 1. Sê vir die kinders hulle gaan Die Blinde Man speel. 2. Sê dat jy ’n blinddoek gaan aantrek sodat jy nie kan sien nie en wys vir hulle die blinddoek. 3. Vind ’n groot ruimte. 4. Vra die kinders om ’n plek te vind om te staan. 5. Hulle mag nie van daardie plek af beweeg nie. 6. Beweeg deur die ruimte met jou blinddoek aan. 7. As jy naby ’n kind kom, moet hulle “warm!” skree. 8. As jy ver weg is, moet hulle “koud!” skree. 9. Wanneer jy ’n kind vind, voel aan die gesig en raai wie dit is.

source: ✔️Social ✔️Walking & Moving
afr: ✔️Sosiale vaardighede ✔️Loop en beweeg
