Repository: Ari-Ramkilowan/po-files
Catalog: translations/LGroup5(Release (open))_Southern Sotho.po
Languages: sot

source: Read the notes
sot: Bala dinoutso

source: Back to menu
sot: Kgutlela ho menu

source: See what you need
sot: Sheba seo o se hlokang

source: See how it works
sot: Bona hore e sebetsa jwang

source: It’s a fun game that’s a little like tag or touchers, but with a twist — you can’t run. 1. You are Gogo. 2. Stand with your back to everyone. 3. Children line up on the other side of the room. 4. When your back is turned, everyone creeps towards you quietly. 5. When you turn around, everyone must freeze where they are. If anyone moves they have to go back to the beginning. 6. You then turn back and let them and get close to you again. 7. The first person who taps you wins. You can even give other children a turn at being Gogo.
sot: Ke papadi e monate e batlileng e tshwana le diboko kapa mathetsana, empa e fetohile hanyane – ha o a tshwanela ho baleha. 1. O nkgono. 2. Ema o furaletse bohle. 3. Bana ba ema ka mola ka lehlakoreng le leng la phaposi. 4. Ha o ba furaletse, bohle ba a o nanyetsa ba kgutsitse. 5. Ha o fetoha, bohle ba lokela ho fetoha diemahale moo bal eng teng. Ha ho ka ba le motho ya sisinyehang o lokelang ho kgutlela morao qalong. 6. Ha o qeta o kgutlela morao mme o re ba o atamele hape. 7. Motho wa pele ya o phaphathang ke mohlodi. O ka nna wa fa le bana ba bang monyetla wa ho ba Nkgono.

source: And that’s it. Easy peazy.
sot: Mme e fella moo. Ha bonolo feela.

source: This game develops
sot: Papadi ena e ntshetsa pele:

source: Sometimes the simplest game is best, like Tap Gogo! 👵🏾
sot: Ka nako e nngwe papadi e bonolo ka ho fetisisa ke yona e monate ka ho fetisisa, jwaloka Tap Gogo! 👵🏾

source: ✔️Walking & Moving ✔️Social
sot: ✔️Ho tsamaya le ho sisinyeha ✔️Bokgoni ho tsa phedisano

source: All you need is a big space to move in!
sot: Seo o se hlokang ke sebaka se seholo seo le ka kenang ho sona!
