Repository: Ari-Ramkilowan/po-files
Catalog: translations/LGroup1(Release (open))_Venda.po
Languages: ven

source: Read the notes
ven: Kha vha vhale notsi

source: See what you need
ven: Zwine vha ṱoḓa

source: See how it works
ven: Zwi shumisa hani

source: Back to menu
ven: Kha vha humele murahu kha menyu

source: This game develops:
ven: Mutambo uyu u bveledza:

source: Let’s try the Finding Challenge. 👀
ven: Kha ri lingedze Khaedu ya u Ṱoḓa. 👀

source: This one is easy to get organised, all you need is toys and items (like the ones in the picture) laid out in your play area. 🤖
ven: Izwi zwo leluwa u zwi dzudzanya, zwine vha ṱoḓa ndi zwitambiswa/thoyi na zwiṅwe zwithu vho (u fana na zwi re kha tshifanyiso) zwo vhewa kha vhupo ha u tambela. 🤖

source: ✔️Social ✔️Talking & Understanding
ven: ✔️Vhukoni ha zwa matshilisano ✔️U amba na u pfesesa

source: Once everything is laid out on the floor: 1. Get all the children to stand in a circle around the items on the floor. 2. Tell them they have 20 seconds to find an item that matches the description you’re going to give them. 3. Give them a description like soft, blue, big or small. There are more examples in the extra ideas message. 4. Count up to 20 as they search for the right toy or item. 5. Ask each child to show everyone what they picked up and why it matches what you said. 6. Ask older children to shout out ideas of what to look for next.
ven: Musi vho no vhea zwoṱhe fhasi: 1. Kha vha kuvhanganye vhana vha ime nga tshidanga u mona na izwo zwithu zwi re fhasi. 2. Kha vha vha vhudze uri vha sekhondo dza 20 u wana tshithu tshine tsha elana na ṱhalutshedzo ine vha khou ya u vha ṋea yone. 3. Kha vha vha ṋee ṱhalutshedzo i fanaho na suvhelela, tsha lutombo/buḽuu, tshihulwane kana tshiṱuku. Hu na dziṅwe tsumbo nnzhi kha mulaedza wa u engedza muhumbulo. 4. Kha vha vhale 20 musi vha tshi khou ṱoḓa tshitambiswa kana tshithu itsho. 5. Kha vha humbele ṅwana muṅwe na muṅwe a vha sumbedze tshe a doba nauri ndi ngani tshi tshi elana na zwe vha amba. 6. Kha vha humbele vhana vhahulwane vha ambe mihumbulo nga ha uri vha nga ṱoḓa mini zwino.

source: When giving the children descriptions to match the items, try these examples: • Soft 🐶 • Hard 👷 • Smooth 🐚 • Rough 🦔 • Long 🦒 • Red 🔴 • Round ⚽ • Square 💾 • Plastic 📏 If two children go for the same item, suggest another item to one of them.
ven: Musi vha tshi khou ṋetshedza vhana ṱhalutshedzo dza zwine zwa elana, kha vha lingedze tsumbo idzi: • Vhuphuvhephuvhe 🐶 • U hwasa 👷 • Suvhelela 🐚 • U gogona 🦔 •Ttshilapfu 🦒 • Tshitswuku 🔴 • Tshipulumbu ⚽ • Tshikwea 💾 • Puḽasiṱiki 📏 Arali vhana vha tshi ḓo dzhia tshithu tshithihi, kha vha ambe tshiṅwe tshithu.
