Repository: Ari-Ramkilowan/po-files
Catalog: translations/LGroup2(Release (open))_Southern Sotho.po
Languages: sot

source: See what you need
sot: Sheba seo o se hlokang

source: See how it works
sot: Bona hore e sebetsa jwang

source: Read the notes
sot: Bala dinoutso

source: Back to menu
sot: Kgutlela ho menu

source: This game develops:
sot: Papadi ena e ntshetsa pele:

source: Why not tell The Feelings Story? 🎭
sot: Hobaneng o sa phete Pale ya Maikutlo? 🎭

source: ✔️Social ✔️Emotional
sot: ✔️Bokgoni ho tsa phedisano ✔️Bokgoni ba maikutlo

source: This game is all about imagination, so all you need is the children, and the story in the notes,or you can use puppets.
sot: Papadi ena e mabapi le ho inahanela, kahoo, seo o se hlokang ke bana, le pale e ho dinoutso, kapa o ka nna wa sebedisa diphapete.

source: Get ready for some acting! Lights, camera, action! 🎬 1. Tell the children the story, using puppets if you have them. 2. If not, use lots of actions, facial expressions and different voices to make it exciting. 3. Then ask the children to stand up. 4. Tell them the story again, one line at a time and ask the children to do the actions of the character Mandla. 5. Also encourage them to do facial expressions by saying, “what does a sad face look like?” or “show me a happy face.” 6. Encourage them to take part and do any action they want to, so that they’re a part of the story.
sot: Itokisetse ho tshwantshisa! Mabone, khemera, Etsa! 🎬 1. Phetela bana pale, o sebedisa diphapete haeba o ena le tsona. 2. Ho seng jwalo, sebedisa diketso tse ngata, dipontsho tsa sefahleho le mantswe a fapaneng ho e natefisa. 3. Jwale kopa bana hore ba eme ka maoto. 4. Ba phetele pale hape, mola o le mong ka nako mme o kope bana ho etsa diketso tsa mophetwa Mandla. 5. Hape ba kgothaletse ho etsa dipontsho tsa sefahleho ka hore, “Sefahleho se hlonameng se shebeha jwang?” kapa “Mpontshe sefahleho se thabileng.” 6. Ba kgothaletse ho nka karolo mme ba etse ketso efe kapa efe eo ba e batlang, ele hore ba tle ba be karolo ya pale.

source: 1. Mandla wants to go and play with his friend Lebo (he’s excited) 😃 2. Mandla’s mama says he can go (he’s happy) 🙂 3. Mandla walks to Lebo’s house (he’s walking)🚶 4. When he gets to Lebo’s house she’s not there (he’s sad) 😞 5. So Mandla sits on the step and waits for her (he sits and feels tired) 😓 6. Lebo’s mama arrives (he’s pleased) 😁and Mandla asks where Lebo is (he’s polite) 🗣 7. She says that Lebo has gone to Mandla’s house (he’s surprised) 😱 8. Mandla runs home to find Lebo (he’s running). 🏃 9. She is there and he is happy. 😆 10. He hugs her. 🤗 You can add to the story to make it more exciting and give the children more chances to mime actions or express feelings.
sot: 1. Mandla o batla ho ya bapala le motswalle wa hae Lebo (o nyakalletse.) 😃 2. Mme wa Mandla o re a ka nna a tsamaya (o thabile). 🙂 3. Mandla o ya habo Lebo (o a tsamaya).🚶 4. Ha a fihla habo Lebo o fumana a le siyo (o hloname). 😞 5. Kahoo Mandla o dula ditepising mme o emela Lebo (o a dula mme o utlwa a kgathetse). 😓 6. Mme wa Lebo o a fihla (Mandla o thabile) 😁 mme o botsa hore Lebo o kae (ka tlhompho). 🗣 7. O re Lebo o ile habo Mandla (Mandla o maketse). 😱 8. Mandla o mathela habo ho ya batla Lebo (o a matha). 🏃 9. O teng mme Mandla o thabile. 😆 10. O a mo haka. 🤗 O ka nna wa eketsa paleng ena ho e natefisa haholwanyane mme wa fa bana menyetla e mmalwa ya ho etsisa diketso ba sa bue kapa ho bontsha maikutlo.

source: This is the story, as well as Mandla’s actions and emotions:
sot: Ena ke pale, esitana le diketso le maikutlo a Mandla:
