Repository: Ari-Ramkilowan/po-files
Catalog: translations/LGroup7(Release (open))_Venda.po
Languages: ven

source: Read the notes
ven: Kha vha vhale notsi

source: Back to menu
ven: Kha vha humele murahu kha menyu

source: See what you need
ven: Zwine vha ṱoḓa

source: See how it works
ven: Zwi shumisa hani

source: Let the kids sit around you and: 1. Put all 8 items on a tray. Eg. a comb , toothbrush, teaspoon, coin, fork, crayon, string, elastic band, peg, egg, stick, stone, leaf, lid, ball, shell etc. 🍭🕶🎾🧦⌚🔋🕯🔑🖍📏🥄🌼🧤🥚 2. Let the children look at the tray for a minute, then cover it with the cloth. 3. Without the children take one item off the tray. 4. Remove the cloth. 5. The children have to guess which item is gone. 6. Repeat with another item and ask questions about each item.
ven: Kha vha ri vhana vha dzule u mona navho/vho vha tanga: 1. Kha vha vhee zwithu zwa 8 kha ṱhirei. Sa tsumbo gamu, bulatsho ya u tamba maṋo, lebula, khoini, forogo, khirayoni, thambo, ḽekere, phekhisi, kumba, thanda, tombo, ṱari, tshithivho, kana na zwiṅwevho. 🍭🕶🎾🧦⌚🔋🕯🔑🖍📏🥄🌼🧤🥚 2. Kha vha ri vhana vha lavhelese kha ṱhirei lwa minete muthihi, vha zwi vale nga labi. 3. Vhana vha songo tsha sedza, kha vha bvise tshithu tshithihi kha ṱhirei. 4. Kha vha bvise labi. 5. Kha vha ri vhana vha humbulele uri ndi mini tshi siho. 6. Kha vha dovholole nga tshiṅwe tshithu.

source: To keep the kiddies focussed ask some questions like: 1. What is this? 2. Who has one at home? 3. What do you use it for? 4. Who can show me how to use it?
ven: Uri vhana vha kone u thetshelesa kha vha vha vhudzise mbudziso dzi fanaho na: 1. Ndi mini itshi? 2. Ndi nnyi ane a vha natsho hayani? 3. Ni tshi shumisa mini? 4. Ndi nnyi ane a nga ntsumbedza uri tshi shumisa hani?

source: This game develops
ven: Mutambo uyu u bveledza:

source: If the day has been full of physical activities, you might want to balance it with The Memory Game. 🧠
ven: Arali ḓuvha ḽo vha ḽo ḓala mitambo ya u shumisa muvhili, vha nga shumisa Mitambo ya Muhumbulo. 🧠

source: ✔️Skills for Learning ✔️Talking & Understanding
ven: ✔️ Vhukoni ha u guda ✔️U amba na u pfesesa

source: Sometimes it’s nice to just sit down with 8 small items, a tray and a cloth. Just kidding, that’s not a thing, but it what you need for this activity.
ven: Tshiṅwe tshifhinga ndi zwavhuḓi u shuma nga zwithu zwiṱuku zwa swikaho 8, ṱhirei na labi. Ndi khou swaswa, a si izwo fhedzi, fhedzi ndi zwine vha ṱoda kha mutambo uyu.
