Repository: Ari-Ramkilowan/po-files
Catalog: translations/LGroup1(Release (open))_Southern Sotho.po
Languages: sot

source: Read the notes
sot: Bala dinoutso

source: See what you need
sot: Sheba seo o se hlokang

source: See how it works
sot: Bona hore e sebetsa jwang

source: Back to menu
sot: Kgutlela ho menu

source: This game develops:
sot: Papadi ena e ntshetsa pele:

source: Let’s try the Finding Challenge. 👀
sot: Ha re lekeng Phephetso ya ho Fumana (Finding Challenge.) 👀

source: This one is easy to get organised, all you need is toys and items (like the ones in the picture) laid out in your play area. 🤖
sot: Ena yona e bonolo ho ka hlophiswa, seo o se hlokang ke dithoye le dintho (jwaloka tse setshwantshong) di adilwe sebakeng sa ho bapalla, 🤖

source: ✔️Social ✔️Talking & Understanding
sot: ✔️Bokgoni ho tsa phedisano ✔️Ho bua le ho utlwisisa

source: Once everything is laid out on the floor: 1. Get all the children to stand in a circle around the items on the floor. 2. Tell them they have 20 seconds to find an item that matches the description you’re going to give them. 3. Give them a description like soft, blue, big or small. There are more examples in the extra ideas message. 4. Count up to 20 as they search for the right toy or item. 5. Ask each child to show everyone what they picked up and why it matches what you said. 6. Ask older children to shout out ideas of what to look for next.
sot: Hang ha dintho tsohle di adilwe fatshe: 1. Ere bana bohle ba eme ka sedikadikwe ba bokanetse ntho e dutseng fatshe. 2. Ba bolelle hore ban a le metsotswana e 20 ya ho fumana ntho e nyalanang le tlhaloso eo o tlo ba fang yona. 3. Ba fe tlhaloso e kang, e bonolo, kgolo kapa nyane. Ho na le mehlala e mengata ho molaetsa wa mehopolo e eketsehileng. 4. Bala ho fihla ho 20 ha ba ntse ba batlana le thoye kapa ntho e nepahetseng. 5. Kopa ngwana ka mong ho bontsha bohle hore ba fumane eng le hore ke hobaneng ha e nyalana le seo o se buileng. 6. Kopa bana ba baholwanyane hore ba hoeletse mehopolo ya se ka batlwang se latelang.

source: When giving the children descriptions to match the items, try these examples: • Soft 🐶 • Hard 👷 • Smooth 🐚 • Rough 🦔 • Long 🦒 • Red 🔴 • Round ⚽ • Square 💾 • Plastic 📏 If two children go for the same item, suggest another item to one of them.
sot: Ha o fa bana tlhaloso e tsamaelanang le dintho, leka mehlala ena: • Bonolo 🐶 • Thata 👷 • Boreledi 🐚 • Mahwashe 🦔 • Telele 🦒 • Kgubedu 🔴 • Tjhitja ⚽ • Kgutlonnetsepa 💾 • Polasetiki 📏 Haeba bana ba babedi ba nka ntho e le nngwe, hlahisa e nngwe o e bontshe e mong wa bona.
