Repository: Ari-Ramkilowan/po-files
Catalog: translations/LGroup8(Release (open))_Zulu.po
Languages: zul

source: Read the notes
zul: Funda amanothi

source: Back to menu
zul: Buyela kumenyu

source: See what you need
zul: Bheka ukuthi yini oyidingayo

source: See how it works
zul: Bheka ukuthi kusebenza kanjani

source: The most important thing about this list is that there has to be one per child so that no one feels left out. 1. Clothing for dress up 2. 1 hat per child 3. 1 scarf per child 4. 1 necklace per child 5. 1 pair of sunglasses per child 6. Whatever else you have, as long as there is one per child 7. Music 8. Space to dance
zul: Into ebaluleke kakhulu ngalolu luhlu ukuthi ingane ngayinye kumele be nento yonke ukuze kungabi khona ingane ezizwa ikhishwe inyumbazane. 1. Izingubo zokugqoka 2. Isigqoko esi-1 ingane ngayinye 3. Isikhafu esi-1 ingane ngayinye 4. Umgexo o-1 ingane ngayinye 5. Ipheya elilodwa lezibuko zelanga ingane ngayinye 6. Noma yini enye, inqobo nje uma ingane ngayinye izoba nayo 7. Umculo 8. Indawo yokudansa

source: There’s nothing like a getting Dressed Up. 💅🏿
zul: Akukho okudlula i-Dressed Up. 💅🏿

source: This game develops
zul: Lo mdlalo uthuthukisa:

source: ✔️Social ✔️Songs , Rhymes & Sounds
zul: ✔️Amakhono okuphilisana emphakathini ✔️Amaculo, imilolozelo nemisindo

source: Parents love this game because it teaches children how to dress themselves. 1. Choose 5 types of clothing or props, and make sure there’s enough for each child to have one. 2. Put the items in the middle of the room. 3. Make the children form a circle around the pile of clothes and props. 4. Sing a rhyme or play music. 5. Get the children to dance around. When the music stops, name an item. 6. Each child has to grab one of what you’ve said and put it on, then keep dancing. 7. Carry on until they’re all dressed up.
zul: Abazali bayawuthanda lo mdlalo ngoba ufundisa izingane ukuzigqokisa. 1. Khetha izinhlobo eziyi-5 zezimpahla zokugqoka noma ama-props, futhi uqinisekise ukuthi ingane ngayinye inayo. 2. Beka izinto phakathi nendlu. 3. Tshela izingane zenze isikokela zizungeze izingubo nama-props. 4. Cula umlolozelo noma udlale umculo. 5. Tshela izingane zidanse zizungeze. Uma umcula uma, biza into eyodwa. 6. Ingane ngayinye kufanele ithathe okukodwa kwalokho okushiwo ikugqoke, bese iqhubeka nokudansa. 7. Qhubeka kuze kube bonke bagqokile.

source: Here are some clothing ideas:👓👛🧥👒👚👖👔👙👠🧦🧤🎩👕🧣👟🧢👜🕶🎒👗 A rhyme you can sing: We are getting dressed We must look our best Dance dance dance And now’s you last chance To put your ___________ ON!
zul: Nansi imibono yezingubo zokugqoka: 👓👛🧥👒👚👖👔👙👠🧦🧤🎩👕🧣👟🧢👜🕶🎒👗 Umlolozelo ongaculwa: Siyagqoka Kufanele sibe bahle Dansa dansa dansa Manje ithub alakho lokugcina Gqoka i ___________ YAKHO!
