Repository: Ari-Ramkilowan/po-files
Catalog: translations/LGroup6(Release (open))_Tswana.po
Languages: tsn

source: Read the notes
tsn: Bala dintlha

source: See what you need
tsn: Bona se o se tlhokang

source: See how it works
tsn: Bona kafa o tshamekiwang ka teng

source: Back to menu
tsn: Boela kwa mmenyung

source: Horses are great, but not everyone is a pony. 🦄 The kids can pretend to be other animals like elephants, lions, cats, dogs, rabbits etc. Each child can give themselves an animal name. The rhyme you can sing goes like this: Horsie horsie jumping high Horsie horsie touch the sky Horsie horsie go around Horsie horsie touch the ground
tsn: Dipitse di siame thata, mme ga se gore nngwe le nngwe ya tsone ke tse di palangwang. 🦄 1. Bana ba ka dira jaaka ekete ke diphologolo tse dingwe tse di tshwanang le ditlou, ditau, dikatse, dintša, mebutla, jalo jalo. 2. Ngwana mongwe le mongwe o ka ipha leina la phologolo nngwe. Morumo o o ka o opelang o tsamaya jaana: Pitse pitse tlolela godimo Pitse pitse kgoma legodimo Pitse pitse dikologa Pitse pitse kgoma fatshe

source: ✔️Songs , Rhymes & Sounds ✔️Walking & Moving
tsn: ✔️Dipina , merumo le medumo ✔️Go tsamaya le go suta

source: Get a small boxes to jump over and a space to move around in. It’s time to see who’s the best horsey. 🎠
tsn: Batla lebokoso le lennye le le ka tlolwang o le beye mo sebakeng se ba ka tsamayang mo go sone mo tikologong ya lone. Ke nako ya go bona gore ke mang yo o itseng go pagama pitse sentle. 🎠

source: This game develops
tsn: Motshameko o o a tswelela:

source: If the children have been sitting all morning for the small group activity, it might be nice to get them moving with Jumping Horse. 🐎
tsn: Fa e le gore bana ba sale ba ntse go tloga mosong ba dira tirwana ya setlhopha se sennye, go ka nna ga bo go siame gore o dire gore ba dire sengwe ka motshameko wa Pitse e e Tlolang.🐎

source: Start with some basic horse-play🐴 1.Ask the children to stand in a circle and pretend to be a horse. 2. Ask them to make the sound of a horse. 3. Trot around in a circle like horses. 4. Put out a small box and get each child to jump over the box like a horse. 5. Put out a few more boxes for them to jump over. 6. Keep making horse noises as you play. 7.You can add a rhyme if you want.
tsn: Simolola ka motshameko o o tlwaelegileng wa go kgorometsana.🐴 1. Kopa bana gore ba eme ba dirile sekele mme ba dire jaaka ekete ke pitse. 2. Ba kope gore ba dire modumo wa pitse. 3. Ba tloletlole ba tsamaya mo sekeleng jaaka dipitse. 4. Baya lebokosonyana mme o dire gore ngwana mongwe le mongwe a tlole lebokoso jaaka pitse. 5. Baya mabokoso a le mmalwa gore ba a tlole. 6. Nna o dire medumo ya dipitse fa le ntse le tshameka. 7. O ka tsenya morumo fa o batla.
