Repository: Ari-Ramkilowan/po-files
Catalog: translations/Main menu(Release (open))_Tsonga.po
Languages: tso

source: Club Meeting
tso: Tinhlengeletano ta Xipano

source: Community
tso: Vaaki

source: What would you like to do?
tso: Xana u tsakela ku endla yini?

source: Child attendance
tso: Matelo ya vana

source: Register a child
tso: Ku rhijisitara n’wana

source: Daily routine
tso: Rhotini ya siku na siku

source: Activity ideas
tso: Mianakanyon ya nghingiriko

source: Edit my details ⚙
tso: Ku hlela tidili ta mina

source: Share location
tso: Ku avelana ndhawu ya laha u nga kona

source: My league
tso: Ligi ya mina

source: Happy Wednesday! You’re halfway through the week 💪🏾. Just a reminder to update your attendance register ✔.
tso: Ravunharhu ra kahle! U le xikarhi ka vhiki. 💪🏾 Xitsundzuxo xo pfuxeta rhijisitara ra wena ra matelo ya le exikolweni. ✔

source: It’s Thursday, so when you get to work could you drop me a pin to check your location, please? 📍
tso: I ra Vumune, se loko u fika entirhweni ndzi kombela u ndzi rhumela phini yo komba laha u nga kona? 📍

source: It’s Monday! Hope you have a good weekend. 😀 Today’s the perfect day to refresh your memory by looking at the daily routine 🌞
tso: I musumbunuku! Ndza tshemba u ve na ku hela ka vhiki ka kahle. 😀 Namuntlha i siku ra kahle ro pfuxeta miehleketo ya wena hi ku languta rhotini ya siku na siku. 🌞

source: The week’s off to a good start. If you need any inspiration this Tuesday have a look at the activity ideas 💡
tso: Vhiki ri sungule kahle. Loko u lava nhlohlotelo wo karhi hi Ravumbirhi leri, languta mianakanyo ya nghingiriko. 💡

source: It’s Friday! 🎉Hope you’ve had an great week. Remember to complete all your attendance registers for the week. ✔ Don’t forget to upload photos 📸 of your forms when you’re done.
tso: I Ravuntlhanu! 🎉 Ndza tshemba u ve na vhiki ra kahle. Tundzuka ku tata marhijisitara ya wena hinkwawo ya matelo ya le xikolweni ya vhiki. ✔ U nga rivali ku apuloda swinepe 📸 swa tifomo ta wena loko u hetile.
