Repository: Ari-Ramkilowan/po-files
Catalog: translations/Main menu(Release (open))_Xhosa.po
Languages: xho

source: Club Meeting
xho: Iintlanganiso zeKlabhu

source: Community
xho: Ekuhlaleni

source: What would you like to do?
xho: Ingaba ungathanda ukwenza ntoni?

source: Child attendance
xho: Ukuhamba kwabantwana

source: Register a child
xho: Bhalisa umntwana

source: Daily routine
xho: Indlela yemihla ngemihla

source: Activity ideas
xho: Iingcamango zomsebenzi

source: Edit my details ⚙
xho: Hlela Iinkcukacha zam

source: Share location
xho: Yabelana ngendawo

source: My league
xho: Lligi lam

source: Happy Wednesday! You’re halfway through the week 💪🏾. Just a reminder to update your attendance register ✔.
xho: NgoLwesithathu onoyolo! Uphakathi kweveki. 💪🏾 Isikhumbuzi nje sokuhlaziya irejista yakho yokubakho. ✔

source: It’s Thursday, so when you get to work could you drop me a pin to check your location, please? 📍
xho: NgoLwesine, ngoko ke xa ufika emsebenzini ungangilahla ipini ukuze ndikhangele indawo yakho, nceda? 📍

source: It’s Monday! Hope you have a good weekend. 😀 Today’s the perfect day to refresh your memory by looking at the daily routine 🌞
xho: NgoMvulo! Ithemba wena ngeveki efanelekileyo. Namhlanje lusuku olugqibelele ukukhumbuza wena ngokujonga indlela owenza ngayo mihla le. 🌞

source: The week’s off to a good start. If you need any inspiration this Tuesday have a look at the activity ideas 💡
xho: Iveki iya kwisiqalo esihle. Ukuba udinga ukuphefumlelwa kule NgoLwesibili, jonga iimbono zomsebenzi. 💡

source: It’s Friday! 🎉Hope you’ve had an great week. Remember to complete all your attendance registers for the week. ✔ Don’t forget to upload photos 📸 of your forms when you’re done.
xho: NgoLwesihlanu! 🎉 Ngethemba ukuba ube neveki enkulu. Khumbula ukugqiba zonke iirejista zakho zokuhamba ngeveki. ✔ Ungalibali ukulayisha iifoto 📸 zeefom zakho xa usuphelile.
