Repository: Ari-Ramkilowan/po-files
Catalog: translations/Main menu(Release (open))_Venda.po
Languages: ven

source: Club Meeting
ven: Miṱangano ya kiḽaba

source: Community
ven: Tshitshavha

source: What would you like to do?
ven: Vha tama u ita mini?

source: Child attendance
ven: U vha hone ha ṅwana

source: Register a child
ven: U ṅwalisa ṅwana

source: Daily routine
ven: Mushumo wa ḓuvha ḽiṅwe na ḽiṅwe

source: Activity ideas
ven: Mihumbulo nga ha mishumo

source: Edit my details ⚙
ven: Kha vha dzudzanye zwidodombedzwa zwanga

source: Share location
ven: Kha vha sumbedze Vhupo

source: My league
ven: Nne Ḽigi

source: Happy Wednesday! You’re halfway through the week 💪🏾. Just a reminder to update your attendance register ✔.
ven: Ḽavhuraru ḽavhuḓi! Vha tsini na u fhedza vhege. 💪🏾 Ndi khou tou vha humbudza u lavhelesa ridzhisisṱara yavho. ✔

source: It’s Thursday, so when you get to work could you drop me a pin to check your location, please? 📍
ven: Ndi Ḽavhuṋa, musi vha tshi swika mushumoni ndi khou humbela vha nthumele pin/tsumba vhupo uri ndi kone u vhona vhupo havho? 📍

source: It’s Monday! Hope you have a good weekend. 😀 Today’s the perfect day to refresh your memory by looking at the daily routine 🌞
ven: Ṋamusi ndi musumbuluwo! Ndi a kholwa vho vha na mafhelo a vhege avhuḓi. 😀 Ṋamusi ndi ḓuvha ḽavhuḓi ḽa u vusuludza muhumbulo wavho nga u lavhelesa kha mushumo wavho wa ḓuvha ḽiṅwe na ḽiṅwe. 🌞

source: The week’s off to a good start. If you need any inspiration this Tuesday have a look at the activity ideas 💡
ven: Vhege i khou sumba i tshi ḓo thoma zwavhuḓi. Arali vha tshi ṱoḓa ṱhuṱhuwedzo nga Ḽavhuvhili, kha vha lavhelese kha mihumbulo nga ha mishumo. 💡

source: It’s Friday! 🎉Hope you’ve had an great week. Remember to complete all your attendance registers for the week. ✔ Don’t forget to upload photos 📸 of your forms when you’re done.
ven: Ndi Ḽavhuṱanu! 🎉 Ndi fulufhela vho vha na vhege yavhuḓi. Kha vha humbule u ḓadza ridzhisiṱara ya vhege. ✔ vha songo hangwa u rumela zwifanyiso 📸 zwa fomo dzavho musi vho no fhedza.
