Repository: Ari-Ramkilowan/po-files
Catalog: translations/Main menu(Release (open))_Zulu.po
Languages: zul

source: Club Meeting
zul: Imihlangano Yamakilabhu

source: Community
zul: Umphakathi

source: What would you like to do?
zul: Yini ongathanda ukuyenza?

source: Child attendance
zul: Irejista yezingane

source: Register a child
zul: Ukubhalisa ingane

source: Daily routine
zul: Inqubo yansukuzonke

source: Activity ideas
zul: Imibono ngokwenziwayo

source: Edit my details ⚙
zul: Lungisa ama-deal ami

source: Share location
zul: Yabelana ngendawo okuyo

source: My league
zul: I-My Iligi

source: Happy Wednesday! You’re halfway through the week 💪🏾. Just a reminder to update your attendance register ✔.
zul: ULwesithathu Oluhle! Sekuphakathi neviki. 💪🏾 Isikhumbuzo nje sokuba uvuselele irejista yabafikile ekilasini. ✔

source: It’s Thursday, so when you get to work could you drop me a pin to check your location, please? 📍
zul: ULwesine, ngakho uma ufika emsebenzini ngicela ungiwisele uphini ukuhlola indawo okuyona, ngiyaecla? 📍

source: It’s Monday! Hope you have a good weekend. 😀 Today’s the perfect day to refresh your memory by looking at the daily routine 🌞
zul: UMsombuluko! Ngethemba ube nempelasonto emnandi. 😀 Namhlanje usuku oluhle lokuvuselela ingqondo yakho ngokubuka inqubo yansuku zonke. 🌞

source: The week’s off to a good start. If you need any inspiration this Tuesday have a look at the activity ideas 💡
zul: Leli viki liqale kahle. Uma udinga noma iyiphi intshisekelo ngalolu Lwesibili, buka imibono yokwenziwayo. 💡

source: It’s Friday! 🎉Hope you’ve had an great week. Remember to complete all your attendance registers for the week. ✔ Don’t forget to upload photos 📸 of your forms when you’re done.
zul: ULwesihlanu! 🎉 Ngethemba ube neviki elimnandi. Khumbula ukugcwalisa wonke amarejista eviki. ✔ Ungakhohlwa ukuloda izithombe 📸 zamafomu akho uma usuqedile.
