Repository: Ari-Ramkilowan/po-files
Catalog: translations/Main menu(Release (open))_Afrikaans.po
Languages: afr

source: Club Meeting
afr: Klubvergaderings

source: Community
afr: Gemeenskap

source: What would you like to do?
afr: Wat wil jy doen?

source: Child attendance
afr: Kinderbywoning

source: Register a child
afr: Registreer ’n kind

source: Daily routine
afr: Daaglikse roetine

source: Activity ideas
afr: Aktiwiteite-idees

source: Edit my details ⚙
afr: Wysig my besonderhede

source: Share location
afr: Deel ligging

source: My league
afr: My liga

source: Happy Wednesday! You’re halfway through the week 💪🏾. Just a reminder to update your attendance register ✔.
afr: Gelukkige Woensdag! Jy is halfpad deur die week. 💪🏾 Net ’n herinnering om jou bywoningsregister by te werk. ✔

source: It’s Thursday, so when you get to work could you drop me a pin to check your location, please? 📍
afr: Dis Donderdag. As jy by die werk kom, kan jy my asseblief ’n pennetjie laat val om jou ligging na te gaan? 📍

source: It’s Monday! Hope you have a good weekend. 😀 Today’s the perfect day to refresh your memory by looking at the daily routine 🌞
afr: Dis Maandag! Hoop jy het ’n goeie naweek gehad. 😀 Vandag is die ideale dag om jou geheue te verfris deur na die daaglikse roetine te kyk. 🌞

source: The week’s off to a good start. If you need any inspiration this Tuesday have a look at the activity ideas 💡
afr: Die week het goed begin. As jy hierdie Dinsdag enige inspirasie nodig het, kyk na die aktiwiteite-idees. 💡

source: It’s Friday! 🎉Hope you’ve had an great week. Remember to complete all your attendance registers for the week. ✔ Don’t forget to upload photos 📸 of your forms when you’re done.
afr: Dit is Vrydag! 🎉 Hoop jy het ’n goeie week gehad. Onthou om al jou bywoningsregisters vir die week te voltooi. ✔ Moenie vergeet om foto’s 📸 van jou vorms op te laai wanneer jy klaar is nie.
