Repository: Ari-Ramkilowan/po-files
Catalog: translations/Main menu(Release (open))_Tswana.po
Languages: tsn

source: Club Meeting
tsn: Diphuthego tsa Tlelabo

source: Community
tsn: Badirisi

source: What would you like to do?
tsn: Ke eng se o ka batlang go se dira?

source: Child attendance
tsn: Go Nna Teng ga Bana

source: Register a child
tsn: Kwadisa ngwana

source: Daily routine
tsn: Ditiro tsa tsatsi le letsatsi

source: Activity ideas
tsn: Megopolo ya ditirwana

source: Edit my details ⚙
tsn: Tseleganya Dintlha kaga Me

source: Share location
tsn: Abelana Lefelo

source: My league
tsn: Liki ya me

source: Happy Wednesday! You’re halfway through the week 💪🏾. Just a reminder to update your attendance register ✔.
tsn: Nnang le Laboraro o o itumedisang! Ke mo magare a beke. 💪🏾 O gakololwa fela go kwala tsa bosheng mo rejisetareng ya go nna teng ga bana. ✔

source: It’s Thursday, so when you get to work could you drop me a pin to check your location, please? 📍
tsn: Ke Labone, jalo fa o fitlha kwa tirong ke kopa gore o nthomelele pine gore ke kgone go itse gore o fa kae? 📍

source: It’s Monday! Hope you have a good weekend. 😀 Today’s the perfect day to refresh your memory by looking at the daily routine 🌞
tsn: Ke Mosupologo! Ke solofela gore le nnile; le mafelobeka a a monate. 😀 Gompieno ke letsatsi le le siameng thata la go ikgopotsa ka go leba ditiro tsa tsatsi le letsatsi. 🌞

source: The week’s off to a good start. If you need any inspiration this Tuesday have a look at the activity ideas 💡
tsn: Beke e simologile sentle. Fa e le gore o tlhoka tlhotlheletso nngwe ka Labobedi, leba megopolo ya tiro eno.

source: It’s Friday! 🎉Hope you’ve had an great week. Remember to complete all your attendance registers for the week. ✔ Don’t forget to upload photos 📸 of your forms when you’re done.
tsn: Ke Labotlhano!🎉 Ke solofela gore o nnile le beke e e monate. Gakologela go kwala direjisetara tsa gago tsotlhe tsa go nna teng ga bana beke e e tlang. ✔ O se ka wa lebala go laisa dinepe tsa diforomo tsa gago fa o se na go fetsa.
