Repository: Ari-Ramkilowan/po-files
Catalog: translations/Main menu(Release (open))_South Ndebele.po
Languages: nbl

source: Club Meeting
nbl: Imihlangano yeenqhema

source: Community
nbl: Umphakathi

source: What would you like to do?
nbl: Ufuna ukwenzani?

source: Child attendance
nbl: Ukuza kwabentwana esikolweni

source: Register a child
nbl: Ukutlolisa umntwana

source: Daily routine
nbl: Ihlelo lelanga

source: Activity ideas
nbl: Imibono yemisebenzi

source: Edit my details ⚙
nbl: Lungisa imininingwanami

source: Share location
nbl: Yaba Indawo

source: My league
nbl: Isiqhema sami

source: Happy Wednesday! You’re halfway through the week 💪🏾. Just a reminder to update your attendance register ✔.
nbl: uLesithathu omnandi! Sowuphakathi neveke. 💪🏾 Khumbula ukulungisa irejista yakho. ✔

source: It’s Thursday, so when you get to work could you drop me a pin to check your location, please? 📍
nbl: uLesine, nawufika emsebenzini ngibawa ungithumele iphini ngizokwazi ukubona indawo okiyo? 📍

source: It’s Monday! Hope you have a good weekend. 😀 Today’s the perfect day to refresh your memory by looking at the daily routine 🌞
nbl: NguMvulo! Ngethemba bona ube nepelaveke ehle. 😀 Namhlanjesi lilanga elihle lokuvuselela umkhumbulo wakho ngokulindela amahlelo wethu welanga. 🌞

source: The week’s off to a good start. If you need any inspiration this Tuesday have a look at the activity ideas 💡
nbl: Iveke ithoma kuhle. Nawutlhoga ukuvuseleleka ngLesibili, qala imibono yomsebenzi. 💡

source: It’s Friday! 🎉Hope you’ve had an great week. Remember to complete all your attendance registers for the week. ✔ Don’t forget to upload photos 📸 of your forms when you’re done.
nbl: uLesihlanu! 🎉 Ngithemba ukuthi ube neveke emnandi. Khumbula ukugcwalisa irejista yeveke. nawuqedile.. ✔. Ungalibali nokuthumela iinthombe zamafomu.
