Repository: Ari-Ramkilowan/po-files
Catalog: translations/Main menu(Release (open))_Southern Sotho.po
Languages: sot

source: Club Meeting
sot: Dikopano tsa Tlelapo

source: Community
sot: Setjhaba

source: What would you like to do?
sot: O ka lakatsa ho etsa eng?

source: Child attendance
sot: Boteng ba ngwana

source: Register a child
sot: Ngodisa ngwana

source: Daily routine
sot: Tshebetso ya letsatsi le letsatsi

source: Activity ideas
sot: Mehopolo ya diketsahalo

source: Edit my details ⚙
sot: Hlophisa ditumellano tsa ka

source: Share location
sot: Abelana ka Sebaka seo o leng ho sona

source: My league
sot: Mokgatlo wa ka

source: Happy Wednesday! You’re halfway through the week 💪🏾. Just a reminder to update your attendance register ✔.
sot: Laboraro le monate! O se o le bohareng ba beke. 💪🏾 O hopotswa feela hore o ntjhafatse rejisetara ya hao ya boteng. ✔

source: It’s Thursday, so when you get to work could you drop me a pin to check your location, please? 📍
sot: Ke Labone, kahoo, ha o fihla mosebetsing o ka ntahlella pin ya hao hore ke shebe sebaka seo o leng ho sona, ka kopo? 📍

source: It’s Monday! Hope you have a good weekend. 😀 Today’s the perfect day to refresh your memory by looking at the daily routine 🌞
sot: Ke Mantaha! Ke tshepa hore o bile le mafelo a beke a monate.😀 Kajeno ke letsatsi le letle bakeng sa ho ntjhafatsa mohopolo wa hao ka ho sheba tshebetso ya letsatsi le letsatsi. 🌞

source: The week’s off to a good start. If you need any inspiration this Tuesday have a look at the activity ideas 💡
sot: Beke ena e qadile hantle haholo. Haeba o batla kgothatso e itseng ka Labobedi lena, sheba mehopolo ya diketsahalo. 💡

source: It’s Friday! 🎉Hope you’ve had an great week. Remember to complete all your attendance registers for the week. ✔ Don’t forget to upload photos 📸 of your forms when you’re done.
sot: Ke Labohlano! 🎉 Ke tshepa hore o bile le beke e monate. Hopola ho tlatsa direjisetara tsohle tsa boteng bakeng sa beke. ✔ O se ke wa lebala ho aplouta dinepe 📸 tsa diforomo tsa hao ha o qetile.
