Repository: Ari-Ramkilowan/po-files
Catalog: translations/Main menu(Release (open))_Pedi; Sepedi;  Northern Sotho.po
Languages: nso

source: Club Meeting
nso: Dikopano tša Mokgatlo

source: Community
nso: Setšhaba

source: What would you like to do?
nso: Naa o rata go dira eng?

source: Child attendance
nso: Go tsena sekolo ga ngwana

source: Register a child
nso: Ngwadiša ngwana

source: Daily routine
nso: Mediro ya tšatši ka tšatši

source: Activity ideas
nso: Dikgopolo tša mošomo

source: Edit my details ⚙
nso: Rulaganya Tshedimošo ya ka

source: Share location
nso: Abelana ka Lefelo

source: My league
nso: Lliki ya Ka

source: Happy Wednesday! You’re halfway through the week 💪🏾. Just a reminder to update your attendance register ✔.
nso: Laboraro le le Botse! O šetše o fihleletše seripagare sa matšatši a beke. 💪🏾 Se ke kgopotšo ya go mpshafatša retšisetara ya gago ya go tla sekolong. ✔

source: It’s Thursday, so when you get to work could you drop me a pin to check your location, please? 📍
nso: Ke Labone, ka gona ge o boela mošomong naa o ka ntahlela phini go lekola lefelo la gago? 📍

source: It’s Monday! Hope you have a good weekend. 😀 Today’s the perfect day to refresh your memory by looking at the daily routine 🌞
nso: Ke Mošupologo! Re tshepha gore o bile le mafelelo a beke a mabotse. 😀 Lehono ke letšatši le le kaonekaone la go thomološa ka kgopotšo ka go lebelela mošomo wa tšatši ka tšatši. 🌞

source: The week’s off to a good start. If you need any inspiration this Tuesday have a look at the activity ideas 💡
nso: Beke ye e tla thoma gabotse. Ge e ba o nyaka tlhohleletšo efe goba efe Labobedi le, lebelela dikgopolo tša mošomo. 💡

source: It’s Friday! 🎉Hope you’ve had an great week. Remember to complete all your attendance registers for the week. ✔ Don’t forget to upload photos 📸 of your forms when you’re done.
nso: Ke Labohlano! 🎉 Re tshepha gore o bile le mafelelo a beke a mabotse. Gopola go tlatša diretšisetara ka moka tša go tla sekolong tša beke. ✔ O se lebale go apolouta dinepe 📸 tša diforomo tša gago ge o feditše.
