Repository: Ari-Ramkilowan/po-files
Catalog: translations/New Child Registration(Release (open))_Venda.po
Languages: ven

source: Would you like to upload the primary caregiver ID document?
ven: Vha ḓo ṱoḓa u rumela ḽiṅwalo ḽa ID ya muunḓi

source: Please take a clear photo of each page of the new child's registration form.
ven: Ndi khou humbela vha dzhie tshifanyiso tshi vhonalaho tsha siaṱari ḽiṅwe na ḽiṅwe ḽa fomo ya u ṅwalisa ṅwana muswa.

source: What is the child's parent's ID number?
ven: Nomboro ya ID ya mubebi wa ṅwana ndi ifhio?

source: What is the child's parent's name?
ven: Dzina ḽa mubebi wa ṅwana ndi ḽifhio?

source: What is the child's parent's surname?
ven: Tshifani tsha mubebi wa ṅwana ndi tshifhio?

source: Would you like to upload the child's ID document?
ven: Vha a ṱoḓa u rumela ḽiṅwalo ḽa ID ya ṅwana?

source: Great 👌🏾 Your SmartStart Coach will be in touch if there are any questions.
ven: Ndi zwavhuḓi 👌🏾 Mugudisi wavho wa SmartStart u ḓo dzulela u vha kwama arali huna dziṅwe mbudziso.

source: Invalid input, would you like to try again?
ven: A si zwone, vha nga ṱoḓa u lingedza hafhu?

source: No
ven: Hai

source: Yes
ven: Ee

source: Sorry, something went wrong, would you like to try again?
ven: Pfarelo, hu na zwi songo tshimbilaho zwavhuḓi, vha nga lingedza hafhu?

source: Please upload your picture now 📸
ven: Ndi khou humbela vha rumele tshifanyiso zwino📸

source: Would you like to upload the primarycaregiver ID document?
ven: Vha ḓo ṱoḓa u rumela ḽiṅwalo ḽa ID ya muunḓi

source: What is the child's ID number?
ven: Nomboro ya ID ya ṅwana ndi ifhio?

source: Did you have any new children in your programme today? 👶🏾
ven: Ho vha hu na vhaṅwe vhana vhaswa kha mbekanyamushumo yavho ya ṋamusi? 👶🏾

source: Great, let’s get them registered and ready to learn! If there’s more than one new face we’ll do one-by-one. Let’s start with the first child: what is her/his first name?
ven: Ndi zwavhuḓi, kha ri vha ṅwale ri thome u guda! Arali hu na zwifhaṱuwo zwi fhiraho tshithihi kha vha vha ṅwale nga muthuhi muthihi. Kha ri thome nga ṅwana wa u thoma, dzina ḽawe ndi nnyi?

source: And last name?
ven: Dzina ndi ḽifhio?
