Repository: Ari-Ramkilowan/po-files
Catalog: translations/New Child Registration(Release (open))_South Ndebele.po
Languages: nbl

source: Would you like to upload the primary caregiver ID document?
nbl: Ungathanda ukufaka incwadi kaMazisi yalowo otlhogomela umntwana?

source: Please take a clear photo of each page of the new child's registration form.
nbl: Ngibawa uthathe isithombe esibonakalako sekhasi elitjha lokutloliswa komntwana.

source: What is the child's parent's ID number?
nbl: Ithini inombolo kamazisi yombelethi?

source: What is the child's parent's name?
nbl: Lithini igama lombelethi?

source: What is the child's parent's surname?
nbl: Sithini isibongo sombelethi?

source: Would you like to upload the child's ID document?
nbl: Ungathanda ukufaka incwadi kaMazisi yomntwana?

source: Great 👌🏾 Your SmartStart Coach will be in touch if there are any questions.
nbl: Kuhle👌🏾Umbanduli wakho weSmartStart uzakukuthinta nakukhona okutlhogako.

source: Invalid input, would you like to try again?
nbl: Awufakanga kuhle, ngibawa ulinge godu.

source: No
nbl: Awa

source: Yes
nbl: Iye

source: Sorry, something went wrong, would you like to try again?
nbl: Tjhebetjhebe, kukhona okungakakhambi kuhle, ngibawa ulinge godu.

source: Please upload your picture now 📸
nbl: Ngibawa ufake isithombe sakho njenganje.📸

source: Would you like to upload the primarycaregiver ID document?
nbl: Ungathanda ukufaka incwadi kaMazisi yalowo otlhogomela umntwana?

source: What is the child's ID number?
nbl: Ithini inombolo yomntwanakho kaMazisi?

source: Did you have any new children in your programme today? 👶🏾
nbl: Ube nabo abantwana abatjha ehlelweni namhlanje? 👶🏾

source: Great, let’s get them registered and ready to learn! If there’s more than one new face we’ll do one-by-one. Let’s start with the first child: what is her/his first name?
nbl: Kuhle, asibatlolise bazlungele ukufunda! Nangabe banengi abatjha sizakubatlolisa nagamunye ngamunye. Asithome ngomntwana wokuthoma: Ngubani igama lakhe lokuthoma?

source: And last name?
nbl: Igamalakhe lokugcina?
