Repository: Ari-Ramkilowan/po-files
Catalog: translations/Registration(Release (open))_Pedi; Sepedi;  Northern Sotho.po
Languages: nso

source: Please confirm that your preferred language of communication is *{{ perm.user_language|title }}* ?
nso: O kgopelwa go kgonthiša gore polelo ye o e ratago ya kgokagano ke *{{ perm.user_language|title }}* ?

source: What is your first name?
nso: Naa leina la gago ke lefe?

source: Hi there 👋🏾
nso: Dumela 👋🏾

source: Congratulations {{trans.nickname}}, You've joined Funda's SmartStart community.
nso: Re a go lebogiša {{trans.nickname}},o tsenetše mokgatlo wa SmartStart wa Funda.

source: I'm Funda the SmartStart Chatbot.
nso: Ke nna Funda, SmartStart Chatbot.

source: I'm sorry, that's not a real ID number please try again.
nso: Ke maswabi, yeo ga se nomoro ya boitsebišo ya makgonthe, leka gape.

source: I'm here to help you, to start I'd like to get to know you a little better.
nso: Ke mo go thuša wena, pele re thoma ke tla rata go go tseba gannyane.

source: What is your cellphone number ? {{trans.user_address}}
nso: Naa nomoro ya sellathekeng sa gago ke efe? {{trans.user_address}}

source: I'm sorry your username should be a word, please retry.
nso: Ke maswabi, leina la gago la sephiri le swanetše go ba lentšu, leka gape.

source: No
nso: Aowa

source: Yes
nso: Ee

source: Note: that once your language is selected all future communication on Whatsapp will be in your prefered language. Tip: To change your language later go to Edit my Details ⚙ on the main menu and select Change my Language 🔡.
nso: Lemoga: morago ga gore o kgethe polelo ya gago, dikgokagano ka moka tša ka moso go Whatsapp di tla dirwa ka polelo ye o e ratago. Temošo: Go fetoša polelo ya gago ka morago, e ya go Rulaganya Dintlha tša ka ⚙ go menyu o mogolo gomme o kgethe Fetoša Polelo ya ka 🔡.

source: Welcome back {{trans.nickname}} !
nso: O amogetšwe gape {{trans.nickname}} !

source: What is your ID number?
nso: Naa nomoro ya gago ya boitsebišo ke efe?

source: Would you like to retry to register?
nso: Naa o rata go leka go ingwadiša gape?

source: Remember that you have to be registered with SmartStart to use this system. Please phone our hotline on 0606536058.
nso: Gopola gore o swanetše go ingwadiša le SmartStart gore o šomiše lenaneo le. Letšetša mogala wa rena wa go se lefelwe mo go 0606536058.

source: Sorry something went wrong, please retry
nso: Ke maswabi, go na le seo se sa sepelago gabotse moo, naa o ka leka gape.

source: What is your preferred language to communicate?
nso: Naa ke polelo efe ye o ratago go kgokagana ka yona?

source: Please confirm that your preferred language of communication is *{{ perm.user_language }}* ?
nso: O kgopelwa go kgonthiša gore polelo ye o e ratago ya kgokagano ke *{{ perm.user_language }}* ?

source: Sorry, we cannot verify you.
nso: Re maswabi, re palelwa ke go go kgonthiša.
