Repository: Ari-Ramkilowan/po-files
Catalog: translations/Registration(Release (open))_Venda.po
Languages: ven

source: Please confirm that your preferred language of communication is *{{ perm.user_language|title }}* ?
ven: Vha takalela luambo lwa vhudavhidzani lufhio*{{ perm.user_language|title }}* ?

source: What is your first name?
ven: Dzina ḽavho ndi ḽifhio?

source: Hi there 👋🏾
ven: Ri a vusa 👋🏾

source: Congratulations {{trans.nickname}}, You've joined Funda's SmartStart community.
ven: Ri khou vha fhululedza Vho {{trans.nickname}}, vho dzhena kha tshitshavha tsha SmartStart tsha Funda.

source: I'm Funda the SmartStart Chatbot.
ven: Ndi nṋe Funda Chatbot ya SmartStart.

source: I'm sorry, that's not a real ID number please try again.
ven: Pfarelo, iyi a si nomboro ya ID yavhukuma, kha vha lingedze hafhu.

source: I'm here to help you, to start I'd like to get to know you a little better.
ven: Ndi fhano u vha thusa, tsha u thoma ndi ḓo tea u thoma nda vha ḓivha khwine

source: What is your cellphone number ? {{trans.user_address}}
ven: Nomboro ya luṱingothendeleki lwavho ndi ifhio ? {{trans.user_address}}

source: I'm sorry your username should be a word, please retry.
ven: Pfarelo username yavho i tea u vha ipfi, kha vha lingedze hafhu.

source: No
ven: Hai

source: Yes
ven: Ee

source: Note: that once your language is selected all future communication on Whatsapp will be in your prefered language. Tip: To change your language later go to Edit my Details ⚙ on the main menu and select Change my Language 🔡.
ven: "Kha vha dzhiele nzhele: uri musi vho no nanga luambo, vhudavhidzani hoṱhe ha tshifhinga tshiḓaho kha Whatsapp vhu ḓo itwa nga luambo lwe vha u nanga. Tsivhudzo: U shandukisa luambo nga murahu kha vha ye kha Edit my Details ⚙ kha menyu vha nange Change my Language 🔡"

source: Welcome back {{trans.nickname}} !
ven: Vho ṱanganedzwa hafhu Vho {{trans.nickname}} !

source: What is your ID number?
ven: Nomboro yavho ya ID ndi ifhio?

source: Would you like to retry to register?
ven: Vha khou ṱoḓa u lingedza hafhu u ḓiṅwalisa?

source: Remember that you have to be registered with SmartStart to use this system. Please phone our hotline on 0606536058.
ven: Kha vha humbule uri vha tea u vha vho ḓiṅwalisa na SmartStart u itela u shumisa sisiṱeme iyi. Kha vha founele luṱingo lwashu kha 0606536058.

source: Sorry something went wrong, please retry
ven: Pfarelo, hu na zwi songo tshimbilaho zwavhuḓi, vha nga lingedza hafhu.

source: What is your preferred language to communicate?
ven: Vha takalela luambo lwa vhudavhidzani lufhio?

source: Please confirm that your preferred language of communication is *{{ perm.user_language }}* ?
ven: Vha takalela luambo lwa vhudavhidzani lufhio*{{ perm.user_language }}* ?

source: Sorry, we cannot verify you.
ven: Pfarelo, a ri khou kona u vha khwaṱhisedza.
