Repository: Ari-Ramkilowan/po-files
Catalog: translations/Registration(Release (open))_South Ndebele.po
Languages: nbl

source: Please confirm that your preferred language of communication is *{{ perm.user_language|title }}* ?
nbl: Ungathanda ukukhuluma ngaliphi ilimi *{{ perm.user_language|title }}* ?

source: What is your first name?
nbl: Lithini igama lakho lokuthoma?

source: Hi there 👋🏾
nbl: Lotjha👋🏾

source: Congratulations {{trans.nickname}}, You've joined Funda's SmartStart community.
nbl: Siyakuhalalisela {{trans.nickname}}, nje sewulilunga leFunda SmartStart.

source: I'm Funda the SmartStart Chatbot.
nbl: NginguFunda, iChatbot yeSmmartStart.

source: I'm sorry, that's not a real ID number please try again.
nbl: Tjhebetjhebe, leyo akisiyo inomombolo kamazisi efanele, ngibawa ulinge godu.

source: I'm here to help you, to start I'd like to get to know you a little better.
nbl: Ngilapha ukukurhelebha, ukuthoma ngingathanda ukukwazi ngconywana.

source: What is your cellphone number ? {{trans.user_address}}
nbl: Ithini inombolo yakho kafunjathwako ? {{trans.user_address}}

source: I'm sorry your username should be a word, please retry.
nbl: Tjhebetjhebe, igama olisebenzisako kufuze kube ligama, ngibawa ulinge godu.

source: No
nbl: Awa

source: Yes
nbl: Iye

source: Note: that once your language is selected all future communication on Whatsapp will be in your prefered language. Tip: To change your language later go to Edit my Details ⚙ on the main menu and select Change my Language 🔡.
nbl: Tjheja: nasele ukhethile ilimi yoke ikulumiswano kuWhatsApp izakuba ngelimi olithandako. Ithibhu: Ukutjhugulula ilimi kufuze uye ku - Tjhugulula Imininingwana yami erhelweni bese ukhetha u-Tjhugulula ilimi.

source: Welcome back {{trans.nickname}} !
nbl: Siyakwamukela {{trans.nickname}} !

source: What is your ID number?
nbl: Ithinini inombolo yakho kaMazisi?

source: Would you like to retry to register?
nbl: Ungathanda ukulinga ukutlolisa godu?

source: Remember that you have to be registered with SmartStart to use this system. Please phone our hotline on 0606536058.
nbl: Khumbula ukuthi kufuze uuthi utlolise neSmartStart ukuze ukghone ukusebenzisa lehlelo. Sibawa utjhayele inombolo yethu etjhisako ku-0606536058.

source: Sorry something went wrong, please retry
nbl: Tjhebetjhebe, kukhona okungakakhambi kuhle, ngibawa ulinge godu.

source: What is your preferred language to communicate?
nbl: Ungathanda ukukhuluma ngaliphi ilimi?

source: Please confirm that your preferred language of communication is *{{ perm.user_language }}* ?
nbl: Ungathanda ukukhuluma ngaliphi ilimi *{{ perm.user_language }}* ?

source: Sorry, we cannot verify you.
nbl: Tjhebetjhebe, asikghoni ukukuthola siqinisekise.
