Repository: Ari-Ramkilowan/po-files
Catalog: translations/Registration(Release (open))_Afrikaans.po
Languages: afr

source: Please confirm that your preferred language of communication is *{{ perm.user_language|title }}* ?
afr: Wat is jou voorkeurtaal vir kommunikasie *{{ perm.user_language|title }}* ?

source: What is your first name?
afr: Wat is jou voornaam?

source: Hi there 👋🏾
afr: Hello daar 👋🏾

source: Congratulations {{trans.nickname}}, You've joined Funda's SmartStart community.
afr: Geluk {{trans.nickname}}, Jy het by Funda se SmartStart gemeenskap aangesluit.

source: I'm Funda the SmartStart Chatbot.
afr: Ek is Funda die SmartStart Praatbot

source: I'm sorry, that's not a real ID number please try again.
afr: Ek is jammer, maar dis nie ’n regte ID-nommer nie; probeer asseblief weer.

source: I'm here to help you, to start I'd like to get to know you a little better.
afr: Ek is hier om jou te help. Om te begin wil ek jou bietjie beter leer ken.

source: What is your cellphone number ? {{trans.user_address}}
afr: Wat is jou selfoonnommer? {{trans.user_address}}

source: I'm sorry your username should be a word, please retry.
afr: Ek is jammer, maar jou gebruikernaam moet ’n woord wees; probeer asseblief weer.

source: No
afr: Nee

source: Yes
afr: Ja

source: Note: that once your language is selected all future communication on Whatsapp will be in your prefered language. Tip: To change your language later go to Edit my Details ⚙ on the main menu and select Change my Language 🔡.
afr: Let wel: wanneer jou taal gekies is, sal alle kommunikasie op Whatsapp in die toekoms in jou voorkeurtaal wees. Wenk: Om later jou taal te verander, gaan na Wysig my besonderhede ⚙ op die hoofspyskaart en kies Verander my taal 🔡.

source: Welcome back {{trans.nickname}} !
afr: Welkom terug, {{trans.nickname}} !

source: What is your ID number?
afr: Wat is jou ID-nommer?

source: Would you like to retry to register?
afr: Wil jy weer probeer om te registreer?

source: THIS IS FOR TESTING PURPOSES
afr: DIT IS VIR TOETSDOELEINDES

source: Remember that you have to be registered with SmartStart to use this system. Please phone our hotline on 0606536058.
afr: Onthou dat jy by SmartStart geregistreer moet wees om hierdie stelsel te gebruik. Skakel asseblief ons blitslyn by 0606536058.

source: Sorry something went wrong, please retry
afr: Ek is jammer, iets het hier skeefgeloop; sal jy asseblief weer probeer?

source: What is your preferred language to communicate?
afr: Wat is jou voorkeurtaal vir kommunikasie?

source: Please confirm that your preferred language of communication is *{{ perm.user_language }}* ?
afr: Wat is jou voorkeurtaal vir kommunikasie *{{ perm.user_language }}* ?

source: Sorry, we cannot verify you.
afr: Jammer, ons kan jou nie verifieer nie.
