Repository: Ari-Ramkilowan/po-files
Catalog: translations/SGroup18(Release (open))_Pedi; Sepedi;  Northern Sotho.po
Languages: nso

source: Need some inspiration? Keep the game going with questions like these: Level 1 • Look around and choose an item that everyone can see. • Don’t tell the others what it is. • Then say “I spy with my little eye, something that is green.” • Let the children guess what it is by calling out all the green things they see. • Try not to make it too difficult. Level 2 • Then say “I spy with my little eye, something beginning with ‘w’.” • Use the sound “w”, not the letter. • Let the kids guess the item. • Give each child a turn to take a guess. Level 3 • Then say “I spy with my little eye, something beginning with ‘ch’.” • Use the sound “ch”, not the letter. • Let the kids guess the item. • Give each child a turn to take a guess.
nso: Naa o nyaka tlhohleletšo? Tšwetša pele papadi ka go botšiša dipotšišo tše di swanago le tše: Kgato ya 1 • Lebelela mo tikologong le go kgetha selo seo mang le mang a ka se bonago. • O se ke wa botša ba bangwe gore ke efe. • Ke moka e re “Ke dira tša botlhodi ka leihlo la ka le lennyane, ke bona selo se sengwe se se talamorago.” • E re bana ba akanye gore ke eng ka go bitša dilo ka moka tše talamorago tšeo ba di bonago. • Leka gore e se be bothata kudu. Kgato ya 2 • Ke moka e re “Ke dira tša botlhodi ka leihlo la ka le lennyane, ke bona se sengwe se se thomago ka ‘w’.” • Šomiša modumo wa “w, e se go tlhaka. • E re digotlane di akanye selo. • Efa ngwana yo mongwe le yo mongwe sebaka sa go akanya. Kgato ya 3 • Ke moka e re “Ke dira tša botlhodi ka leihlo la ka le le nnyane, ke bona se sengwe se se thomago ka ‘tšh’.” • Šomiša modumo wa “ch”, e se go tlhaka. • E re digotlane di akanye selo. • Efa ngwana yo mongwe le yo mongwe sebaka sa go akanya.

source: We’re taking I Spy to the next level with some eye glasses. Here’s what you’ll need 👓: • 2 used toilet rolls per child. • String. • Scissors. • 2 sticks per child. • Cellotape.
nso: Re iša papadi ya Ke dira tša Botlhodi legatong le le latelago ka go dira dipeketsane. Tše ke tšeo o tla di hlokago 👓: • Dithoileterolo tše 2 tše di šomišitšwego go ngwana yo mongwe le yo mongwe • Thapo • Sekero • Diphate tše 2 go ngwana yo mongwe le yo mongwe • Sekgomaretši

source: Read the notes
nso: Bala dinoutse

source: Back to menu
nso: Re boela morago go menyu

source: You’ll be showing these cool kids how to make a pair of glasses.😎 1. Cut the toilet roll into 2 rings and tie them together to make glasses 2. Attach the sticks to the sides of the glasses to make the ‘arms’ of the glasses. 3. Support the younger kids. 4. Encourage the older ones to this on their own. 5. Ask the children to put their glasses on and talk about what glasses do. 6. Play I Spy: Find something in the room that everyone can see, for example, a table. 7. Say: “I Spy with my little eye, something beginning with ‘t’ (sound)” 8. Let each child have a turn guessing. 9. Walk around the room and tell them what you see through your glasses. 10. Get them to walk with you, glasses on!
nso: O tla be o laetša digotlane tše tše bohlale ka moo dipeketsane di dirwago ka gona.😎 1. Ripa thoileterolo ka diripa tše 2, gomme o di tlemaganye go dira dipeketsane. 2. Kgomaretša diphate ka mahlakoreng a dipeketsane go dira ‘matsogwana’ a dipeketsane. 3. Thuša bana ba digotlane. 4. Hlohleletša bana ba bagolo go itirela ka bobona. 5. Kgopela bana go apara dipeketsane le go bolela gore dipeketsane di dira eng. 6. Raloka Ke dira tša Botlhodi: Hwetša se sengwe ka phapošing seo mang le mang a tla se bonago, mohlala, tafola. 7. E re: “Ke dira tša Botlhodi ka mahlo a ka a mannyane, se sengwe se se thomago ka ‘t’ (modumo)” 8. Efa ngwana yo mongwe le yo mongwe sebaka sa go akanya. 9. Sepelasepela ka phapošing o ba botše seo o se bonago ka dipeketsane. 10. E re ba sepele le wena, ba apere dipeketsane!

source: See what you need
nso: Bona se o se hlokago

source: See how it works
nso: Bona ka moo e šomago ka gona

source: We put a spin on the classic game, I Spy. 🔍
nso: Re a šielana go papadi ye bonolo, Ke dira tša Botlhodi. 🔍

source: This game develops:
nso: Papadi ye e kaonafatša:

source: ✔️Social ✔️Early Reading & Writing
nso: ✔️Leago ✔️Go ithuta go bala le go ngwala bonnyaneng
