Repository: Ari-Ramkilowan/po-files
Catalog: translations/SGroup19(Release (open))_Afrikaans.po
Languages: afr

source: Back to menu
afr: Terug na spyskaart

source: See what you need
afr: Kyk wat jy nodig het

source: Read the notes
afr: Lees die notas

source: See how it works
afr: Kyk hoe dit werk

source: This game develops:
afr: Hierdie speletjie ontwikkel:

source: It’s time to decorate your classroom by Making Chains. Don’t worry, the children’s chains will be way nice than these: ⛓
afr: Dis tyd om jou klaskamer te versier deur Kettings te Maak (Making Chains). Toemaar, die kinders se kettings sal baie mooier as hierdie een wees: ⛓

source: ✔️Skills for Learning ✔️Arm & hand control
afr: ✔️Vaardighede vir leer ✔️Arm- en handbeheer

source: Good news! You probably have everything you need under your nose right now. 1. Coloured paper 2. Scissors 3. Glue
afr: Goeie nuus! Jy het waarskynlik alles byderhand wat jy nou nodig het. 1. Gekleurde papier 2. ’n Skêr 3. Gom

source: Not exactly sure what to ask? Try out some of these questions: Level 1 • What colour do you like? • How many links will you make? • What could you use your chain for? Level 2 • What is your pattern? • How many colours do you have? Level 3 • How many links do you have? • How many links does your friend have? • How many links do you have together? • What if I take 5 links away? • How many will you have left?
afr: Nie presies seker wat om te vra nie? Probeer ’n paar van hierdie vrae: Vlak 1 • Van watter kleur hou jy? • Hoeveel skakels sal jy maak? • Waarvoor kan jy jou ketting gebruik? Vlak 2 • Wat is jou patroon? • Hoeveel kleure het jy? Vlak 3 • Hoeveel skakels het jy? • Hoeveel skakels het jou maatjie? • Hoeveel skakels het julle saam? • Wat as ek 5 skakels wegneem? • Hoeveel sal daar oorbly?

source: This activity is great for the children’s hand-eye coordination! 🖐🏿 👁 • Help the children cut the coloured paper into short strips. • They should each have about 10 strips . • Stick the 2 short edges of one strip together, making a ring. • Thread a new strip through the ring and stick its ends together, linking the 2 rings. • Continue with at least 10 strips, and make rings that link to each other. • Make scarves, necklaces, or belts with them before hanging them up in the classroom. • Ask questions as you work to help the kids learn.
afr: Hierdie aktiwiteit is uitstekend vir die kinders se hand-oog-koördinasie! 🖐🏿 👁 • Help die kinders om die gekleurde papier in kort stroke te knip. • Elkeen moet omtrent 10 stroke hê. • Plak die 2 kort punte van een strook vas om ’n ring te maak. • Plaas ’n nuwe strook deur die ring en plak sy punte vas om die twee ringe te verbind. • Hou so aan met ten minste 10 stroke en maak ringe wat inmekaar skakel. • Maak serpe, halssnoere of gordels daarmee voor dit in die klaskamer opgehang word. • Om die kinders te help leer, vra vrae terwyl julle werk.
