Repository: Ari-Ramkilowan/po-files
Catalog: translations/SGroup19(Release (open))_Tswana.po
Languages: tsn

source: Back to menu
tsn: Boela kwa mmenyung

source: See what you need
tsn: Bona se o se tlhokang

source: Read the notes
tsn: Bala dintlha

source: See how it works
tsn: Bona kafa o tshamekiwang ka teng

source: This game develops:
tsn: Motshameko o a tswelela:

source: It’s time to decorate your classroom by Making Chains. Don’t worry, the children’s chains will be way nice than these: ⛓
tsn: Ke nako ya go kgabisa phaposi ya borutelo ka Go Dira Dikeetane. O seka wa tshwenyega, dikeetane tsa bana di tlile go nna dintle thata go na le tse: ⛓

source: ✔️Skills for Learning ✔️Arm & hand control
tsn: ✔️Bokgoni jwa go ithuta ✔️Taolo ya lebogo le seatla

source: Good news! You probably have everything you need under your nose right now. 1. Coloured paper 2. Scissors 3. Glue
tsn: Dikgang tse di itumedisang! O ka tswa o na le sengwe le sengwe se o se tlhokang gone mo o leng teng ka nako e. 1. Pampiri e e mebala 2. Sekere 3. Tloluo

source: Not exactly sure what to ask? Try out some of these questions: Level 1 • What colour do you like? • How many links will you make? • What could you use your chain for? Level 2 • What is your pattern? • How many colours do you have? Level 3 • How many links do you have? • How many links does your friend have? • How many links do you have together? • What if I take 5 links away? • How many will you have left?
tsn: A ga o itse gore o botseng? Leka dingwe tsa dipotso tse: Maemo 1 • O rata mmala ofe? • Le tlile go dira megolagano e le kae ? • O tlile go dirang ka keetane ya gago? Maemo 2 • Phethene ya gago ke eng? • O na le mebala e le kae? Maemo 3 • O na le megolagano e le kae? • Tsala ya gago e na le megolagano e le kae? • Le na le megolagano e le kae yotlhe fa e tlhakanngwa? • Go diragalang fa ke tsaya megolagano e le 5? • O tla sala ka e le kae?

source: This activity is great for the children’s hand-eye coordination! 🖐🏿 👁 • Help the children cut the coloured paper into short strips. • They should each have about 10 strips . • Stick the 2 short edges of one strip together, making a ring. • Thread a new strip through the ring and stick its ends together, linking the 2 rings. • Continue with at least 10 strips, and make rings that link to each other. • Make scarves, necklaces, or belts with them before hanging them up in the classroom. • Ask questions as you work to help the kids learn.
tsn: Tirwana e e siametse go tsamaisana ga lebogo le matlho ga bana!🖐🏿 👁 • Thusa bana go segolola dipampiri tse di mebalabala go dira diseteripi ka tsone. • Mongwe le mongwe wa bone o tshwanetse go nna le diseteripi di le 10. • Kopanya matlhakore a mabedi a makhutshwane a diseteripi mmogo, o dira reng. • Fololela seteripi se sesha go kgabaganya reng o bo o kopanya dintlha tsa tsone mmogo, o golaganya direng tse pedi. • Tswelela ka diseteripi di le 10 bobotlana, o dira direng tse di golaganeng. Dira disekafo, dibaga, kgotsa mabante ka tsone pele ga o di kaletsa mo phaposing ya borutelo. • Botsa dipotso fa o ntse o dira go thusa bana go ithuta..
