Repository: Ari-Ramkilowan/po-files
Catalog: translations/SGroup4(Release (open))_Swati.po
Languages: ssw

source: See how it works
ssw: Buka kutsi isebenta njani

source: See what you need
ssw: Buka kutsi yini loyidzingako

source: Read the notes
ssw: Fundza emanotsi

source: Back to menu
ssw: Buyela emuva kumenyu

source: It’s time to decorate your classroom by Making Flowers. 🌸
ssw: Sekusikhatsi sekuhlobisa liklasi lakho ngekwenta timbali. 🌸

source: This game doesn’t just let the the kids be creative byn painting, but also teaches them to be creative in how they make their brushes. 1. A piece of paper per child 2. 1 peg per child 3. 1 small piece of sponge per child 4. Paint 5. Crayons
ssw: Lomdlalo awenti nje kwekutsi ebantfwana babe nemakhono ngekutsi bapende, kodvwa ubafundzisa kutsi babe nemakhono ekutsi emabhulashi abo bangawenta njani. 🔧 Batawudzinga: 1. Licetu leliphepha lemntfwana ngamunye 2. Lipheksi linye lemntfwana ngamunye 3. Sipinji lesincane semntfwana ngamunye 4. Ipendi 5. Emakrayoni

source: This is the fun part. 😃 1. Tell the children they are going to make flowers. 2. Tell them to draw a few circles on their page. Circles are the centre of the flower. They can also draw stems. 3. Help children to peg the small piece of sponge (making a paintbrush). 4. Ask them to dip the sponges in paint and make petals around the circles. 5. Encourage the older children to add other things to their paintings like the sun, grass or butterflies. 6. Allow pictures to dry then hang them around your room. 7. Extend learning while you work by asking questions.
ssw: Lena ngulencenye lejabulisako. 😃 1. Tjela bantfwana kutsi batawakha timbale. 2. Bacele kutsi badvwebe tindingilizi letimbalwa kanye nelingekhatsi lalembali. Bangabuye badvwebe neticu. 3. Sita labantfwana babambise lolucetu lalesiponji ngelipheksi (bakhe libhulashi lekupenda). 4. Bacele kutsi banyente lesiponji kupende bese wenta timbali titungeletele lendingilizi. 5. Khutsata labantfwana labakhudlwana kutsi bangete letinye tintfo kuloku labakupendako njengelilanga, tjani noma emavivane. 6. Vumela titfombe kutsi tome bese uyatineka ngekhatsi eklasini. 7. Chubekisa sikhatsi sekufundza ngalesikhatsi usebenti ngekutsi ubute imibuto.

source: Make sure you talk to the kids about what they’re drawing and painting and help them if they get stuck. You can ask them some of these questions: • How many flowers will you make? • What colours will your petals be? • Is your flower tall or short? • Where does it grow? • What do flowers need to grow? • What else can you tell me about your flowers?
ssw: Cinisekisa kutsi ukhuluma nalabantfwana ngaloku labakudvwebako nalabakupendako, futsi ubasite uma ngabe bahluleka. Ungababuta leminye yalemibuto: • Utawenta timbale letingaki? • Timbali takho titawuba nemibala lenjani? • Ngabe imbali yakho yimfishane noma yindze? • Imila kuphi? • Ngabe timbale tidzingani kute tikhule? • Yini lenye longangitjela yona ngetimbali takho?

source: This game develops:
ssw: Lomdlalo utfutfukisa:

source: ✔️Arm & Hand Control ✔️Talking & Understanding
ssw: ✔️kulawulwa kwemkhono nesandla ✔️Kukhuluma nekuvisisa
