Repository: Ari-Ramkilowan/po-files
Catalog: translations/SGroup9(Release (open))_Swati.po
Languages: ssw

source: Use this activity as a bigger learning opportunity by asking the children some fun questions. Level 1 • Who likes blowing bubbles? • What do we normally use dishwashing soap for? • What colours do we have here? Level 2 • What does this pattern look like? • What shapes can you see? • What colours have you made? • How many bubbles can you see here? Level 3 • Let’s mix some colours. • Now what colours do you have? • What does blue and yellow make? (green) • What does red and yellow make? (orange) • What does blue and red make? (purple) • What sound does blue start with? (ba) • What sound does red start with? (rrrrrr) • What sound does yellow start with? (ya) • What sound does green start with? (ga) • What sound does orange start with? (o) • What sound does purple start with? (pa)
ssw: Sebentisa lomsebenti njengelitfuba lelikhulu lekufundza ngekutsi abute bantfwana imibuto lejabulisako. Lizinga1 • Ngubani lotsandza kwenta emabhamuta? • Insipho yetitja sivame kuyisebentiselani? • Sinamiphi imibala lapha? Lizinga2 • Lephethini ibukeka njani? • Ngubabi bobunjwa longababona? • Wente miphi imibala? • Mangaki emabhamuta longawabona lapha? Lizinga3 • Asihlanganise imibala. • Nyalo unamiphi imibala? • Ngabe lokulingangane nalokuliphuti kwenta muphi umbala? (loluhlata) • Umbala lobovu naloliphuti kwenta muphi umbala? (losaliwolintji) • Umbala lolingangane nalobovu kwenta lonjani? (lophephuli) • Ngabe umbala lingangane ucala ngawuphi umsindvo? (li) • umbala bovu ucala ngawuphi umsindvo? (bo) • umbala liphuti ucala ngawuphi umsindvo? (li) • umbala hlata ucala ngawuphi umsindvo? (hla) • umbala wolintji ucala ngawuphi umsindvo? (wo) • umbala phephuli ucala ngawuphi umsindvo? (phe)

source: Read the notes
ssw: Fundza emanotsi

source: See what you need
ssw: Buka kutsi yini loyidzingako

source: See how it works
ssw: Buka kutsi isebenta njani

source: Back to menu
ssw: Buyela emuva kumenyu

source: Have the children tried Painting with Bubbles yet? 🎨
ssw: Ngabe labantfwana sebacalile kufundza kupenda ngemagwebu? 🎨

source: This game develops:
ssw: Lomdlalo utfutfukisa:

source: ✔️Exploring & Finding Out ✔️Early Reading & Writing
ssw: ✔️Kufunisisa nekutfola kabanti ✔️Kukwati kufundza nekubhala kusenesikhatsi

source: It’s really simple. All you need is: 1. Paint 2. Dishwashing liquid 3. Straws 4. Paper
ssw: Kulula. Lokudzingako nje: 1. Yipendi 2. Yinsipho yetitja 3. Timunci 4. Maphepha

source: Read the note
ssw: Fundza emanotsi

source: This activity breathes new life into having fun with paint. No paintbrushes required! 🖌 1. Mix some paint with some dishwashing liquid in a cup. 2. Add a little bit of water to the mixture. 3. Give each child a straw and some paper, and ask them to share the paint. 4. Ask them to blow (not suck) through the straw into the cup. This will make bubbles. 5. Then ask the children to hold the paper over the cup and bubbles and press down gently. 6. The bubbles will leave a bubble pattern on the paper. 7. The children can repeat this with other colours and then leave their art to dry.
ssw: Lomsebenti uletsa indlela lenhle yekutijabulisa ngependi. Akudzingeki mabhulashi ependi! 🖌 1. Hlanganisa lenye yependi uyibhice nensipho yekuwasha titja enkomishini. 2. Ngeta emanti lamancane kulenhlama. 3. Nika umntfwana ngamunye simunci nemaphepha, bese ubacela kutsi bahlukaniselane ngalependi. 4. Bacele kutsi baphuphutse (bangamunyi) ngekusebentisa lesimunci lesisenkomishini. Loku kutawenta emabhamuta. 5. Cela labantfwana kutsi babambe leliphepha dvutane nalenkomishi nalamabhamuta bese balichilitela phansi ngekunakekela. 6. Emabhamuta atawushiya iphethini yemabhamuta ephepheni. 7. Bantfwana bangakuphindza loku basebentise leminye imibala bese bayekela lobuciko babo kutsi bome.
