Repository: Ari-Ramkilowan/po-files
Catalog: translations/SGroup12(Release (open))_Afrikaans.po
Languages: afr

source: It’s time for these budding entrepreneurs to learn about the value of money. 1. Give each child their coin rubbings from the previous activity. 2. Ask them to cut out the coins. 3. Help those that need it. 4. Help them to fold over their piece of paper to make a purse. 5. Ask the children to put their coins into their new purse for safekeeping. 6. Set up a shop. 7. Talk about the items in your shop as you set up. 8. Have words under your items. Eg, milk, bread, cereal, etc. 9. Ask each child to come to your shop and buy something. 10. When they give you their money, tell them what they can buy with it. 11. Talk as you play and ask questions to help the children learn. 12. For the older children, ask them for money and give them change.
afr: Dis tyd vir hierdie ontluikende entrepreneurs om oor die waarde van geld te leer. 1. Gee elke kind hul uitgekrapte muntstukke van die vorige aktiwiteit. 2. Vra hulle om die muntstukke uit te knip. 3. Help diegene wat hulp nodig het. 4. Help hulle om hul vel papier om te vou om ’n beursie te maak. 5. Vra die kinders om die muntstukke vir veilige bewaring in hulle nuwe beursie te sit. 6. Maak ’n winkel. 7. Praat oor die items in jou winkel terwyl jy dit regkry. 8. Plaas woorde onder jou items. Byvoorbeeld, melk, brood, graan. 9. Vra elke kind om iets by jou winkel te kom koop. 10. Wanneer hulle hul geld vir jou gee, sê vir hulle wat hulle daarmee kan koop. 11. Praat terwyl julle speel en vra vrae om die kinders te help leer. 12. Vra die ouer kinders om vir iets te betaal en gee hulle kleingeld.

source: See what you need
afr: Kyk wat jy nodig he

source: See how it works
afr: Kyk hoe dit werk

source: Read the notes
afr: Lees die nota

source: Back to menu
afr: Terug na spyskaart

source: Spending money is easy, it’s saving money that’s hard. Try remind the children how important saving is while you talk to them. 🏦 Level 1 • Where do you keep your money? • What do you want to buy at my shop? • What are you going to cook with these things…? • What else would you like to buy? Level 2 • How much money have you got? • That will cost… Level 3 • Have you got any money left? • Would you like to use that money to buy something else? • Do you have enough? • Or would you rather save it for next time? • What sounds does milk start with? (mmmm) • What sound does fish start with? (ffff)
afr: Dis maklik om geld te spandeer, maar dis moeilik om geld te spaar. Terwyl jy met die kinders praat, herinner hulle hoe belangrik dit is om te spaar. 🏦 Vlak 1 • Waar hou jy jou geld? • Wat wil jy by my winkel koop? • Wat gaan jy met hierdie items kook? • Is daar nog iets wat jy wil koop? Vlak 2 • Hoeveel geld het jy? • Dit sal ..... kos. Vlak 3 • Het jy enige geld oor? • Wil jy daardie geld gebruik om iets anders te koop? • Het jy genoeg? • Of wil jy dit eerder vir die volgende keer spaar? • Met watter klank begin melk? (Mmmm) • Met watter klank begin vis? (Ffff)

source: Let’s put the Money Rubs the children did to good use with Spending Coins!💰
afr: Laat ons die Muntstuk-uitkrap (Money Rubs) wat die kinders gedoen het goed gebruik met Spandeer Muntstukke (Spending Coins)! 💰

source: This game develops:
afr: Hierdie speletjie ontwikkel:

source: ✔️Talking & Understanding ✔️Social
afr: ✔️Praat en verstaan ✔️Sosiale vaardighede

source: Now that the children have created their own money during the previous activity, it’s time to give them something to spend it on. You’ll need: 1. Coin drawings from the previous Small Group Activity. 2. Scissors. 3. A piece of paper for each child to make a purse. 4. Empty food containers such as cereal boxes, milk bottles, egg boxes, etc. Have enough for each child to “buy” a few items. 🍞🥔🥚
afr: Noudat die kinders tydens die vorige aktiwiteit hul eie geld gemaak het, is dit tyd om hulle iets te gee om daarmee te koop. Wat jy nodig sal hê: 1. Tekeninge van muntstukke uit die vorige Aktiwiteit vir Klein Groepe. 2. ’n Skêr. 3. ’n Vel papier vir elke kind om ’n beursie mee te maak. 4. Leë koshouers soos graankosbokse, melkbottels en eierbokse. Daar moet genoeg wees vir elke kind om ’n paar items te “koop”. 🍞🥔🥚
