Repository: Ari-Ramkilowan/po-files
Catalog: translations/SGroup11(Release (open))_Swati.po
Languages: ssw

source: The little ones might struggle with the higher levels, but these questions are a great way to ease them into basic maths, and an education on money. 💸 Level 1 • What colours have you used? • What shape are the coins? • Which is the biggest coin? • Which is the smallest? • How many coins do we have? • What do we do with money? • Where should we keep our money? Level 2 • Who can show me a R1 coin? • Who can show me a R2 coin? • Who can show me a R5 coin? • How can you make R6? • How can you make R3 etc? • Etc Level 3 • Who can show me a 5 cent coin? • Who can show me a 10 cent coin? • Who can show me a 20 cent coin? • Who can show me a 50 cent coin? • How can you make 20 cents? • How can you make 10 cents? • Etc
ssw: Laba labancane bangahle babe nebumatima ngalamazinga laphakeme, kodvwa lemibuto iyindlela lekahle yekubentela lula kutsi bati tibalo, kanye nekufundziswa ngemali. 💸 Lizinga1 • Usebentise miphi imibala? • Letinhlavu temali tibumbeke njani? • Nguluphi luhlavu lwemali lolukhulu kakhulu? • Nguluphi loluncane kakhulu? • Tingaki tinhlavu temali lesinato? • Sentani ngemali? • Imali kufanele siyibeke kuphi? Lizinga2 • Ngubani longangibonisa luhlavu lwa-R1? • Ngubani longangibonisa luhlavu lwa-R2? • Ngubani longangibonisa luhlavu lwa-R5? • Ungamakha njani R6? • Ungamakha njani R3 njll? Lizinga3 • Ungangibonisa njani luhlavu lwemasenti la-5? • Ungangibonisa njani luhlavu lwemasenti la-10? • Ungangibonisa njani luhlavu lwemasenti la-20? • Ungangibonisa njani luhlavu lwemasenti la-50? • Ungawakha njani emasenti lange-20? • Ungawakha njani emasenti la-10?

source: Engage the children in a conversation about money while they go about this game. 1. Make sure each coin has been washed and is clean. 2. While you talk about money and what it’s used for, give each child a coin. 3. Ask them to look at their coin and tell you what they see. 4. Give them each a crayon and a piece of paper. 5. Show them that if you put the coin under the paper and then rub the crayon over it, you’ll see the picture of a coin. 6. Get them to share their items and explore different coins and colours.
ssw: Cala ingcogco ngemali ngalesikhatsi bantfwana badlala lomdlalo. 1. Cinisekisa kutsi luhlavu lwemali ngayinye luwashiwe futsi luhlobile. 2. Ngalesikhatsi ukhuluma ngemali nekutsi isetjentiselwani, nika umntfwana ngamunye luhlavu. 3. Bacele kutsi babuke luhlavu lwabo lwemali nekutsi bakutjele kutsi babonani. 4. Niketa ngamunye ikhrayoni nesidlephu seliphepha. 5. Bakhombise kutsi uma ufaka loluhlavu lwemali ngaphansi kweliphepha bese ushikisha lelikhrayoni ngetulu, utawubona lesitfombe saloluhlavu lwemali. 6. Bacele kutsi bahlukaniselane ngetintfo tab obese ubuka tinhlobo tetinhlavu temali nemibala.

source: Back to menu
ssw: Buyela emuva kumenyu

source: See what you need
ssw: Buka kutsi yini loyidzingako

source: See how it works
ssw: Buka kutsi isebenta njani

source: Read the notes
ssw: Fundza emanotsi

source: Remind the kids they’ll need to be very responsible when they’re each given one of the following: 1. A coin 2. A piece of paper 3. A crayon
ssw: Khumbula kutsi bantfwana batawudzinga kutsi batiphatse kahle uma ngabe ngamunye wabo baniketwe litfuba lekwenta loku lokulandzelako: 1. Luhlavu lwemali 2. Sidlephu seliphepha 3. Ikhrayoni

source: This game develops:
ssw: Lomdlalo utfutfukisa:

source: It’s never too early to start learning about money with Money Rubs! 💰
ssw: Kusesikhatsi lesikahle sekufundza ngemali nekwekuhlobisa imali never! 💰

source: ✔️Numbers , shapes & sizes ✔️ Arm & Hand Control
ssw: ✔️Tinombolo, bobunjwa nemasayizi ✔️ Kulawula sandla nemkhono
