Repository: Ari-Ramkilowan/po-files
Catalog: translations/SGroup12(Release (open))_Southern Sotho.po
Languages: sot

source: It’s time for these budding entrepreneurs to learn about the value of money. 1. Give each child their coin rubbings from the previous activity. 2. Ask them to cut out the coins. 3. Help those that need it. 4. Help them to fold over their piece of paper to make a purse. 5. Ask the children to put their coins into their new purse for safekeeping. 6. Set up a shop. 7. Talk about the items in your shop as you set up. 8. Have words under your items. Eg, milk, bread, cereal, etc. 9. Ask each child to come to your shop and buy something. 10. When they give you their money, tell them what they can buy with it. 11. Talk as you play and ask questions to help the children learn. 12. For the older children, ask them for money and give them change.
sot: Ke nako jwale ya hore borakgwebonyana bana ba holang ba ithute ka boleng ba tjhelete. 1. Nea ngwana ka mong dikhoine tse pikitlilweng tse tswang ketsahalong e fetileng. 2. Ere ba sehe le ho ntsha dikhoine. 3. Thusa ba hlokang thuso. 4. Ba thuse ho mena sekgetjhana sa bona sa pampiri ho etsa sepatjhe. 5. Kopa bana ho kenya dikhoine tsa bona ka hara dipatjhe tsa bona tse ntjha ho di boloka. 6. Qala lebenkele. 7. Bua ka dintho tse ka lebenkeleng la hao ha o ntse o le etsa. 8. Bea mantswe ka tlasa dintho tsa hao. Mohlala, lebese, bohobe, sereyale, jj. 9. Kopa ngwana ka mong ho tla lebenkeleng la hao ho tla reka ho hong. 10. Ha ba o fa tjhelete ya bona, ba bolelle hore ba ka reka eng ka yona. 11. Bua ha le ntse le bapala mme o botse bana dipotso ho ba thusa ho ithuta. 12. Bakeng sa bana ba baholwanyane, ba kope ho lefella ho hong mme o ba fe tjhentjhe.

source: See what you need
sot: Sheba seo o se hlokang

source: See how it works
sot: Bona hore e sebetsa jwang

source: Read the notes
sot: Bala dinoutso

source: Back to menu
sot: Kgutlela ho menu

source: Spending money is easy, it’s saving money that’s hard. Try remind the children how important saving is while you talk to them. 🏦 Level 1 • Where do you keep your money? • What do you want to buy at my shop? • What are you going to cook with these things…? • What else would you like to buy? Level 2 • How much money have you got? • That will cost… Level 3 • Have you got any money left? • Would you like to use that money to buy something else? • Do you have enough? • Or would you rather save it for next time? • What sounds does milk start with? (mmmm) • What sound does fish start with? (ffff)
sot: Ho sebedisa tjhelete ho bonolo, ho boloka tjhelete ke hona ho thata. Leka ho hopotsa bana kamoo ho boloka tjhelete ho leng bohlokwa ka teng ha o ntse o bua le bona. 🏦 Mohato wa 1 • O boloka tjhelete ya hao hokae? • O batla ho reka eng ka lebenkeleng la ka? • O tlilo pheha eng mmoho le dintho tse? • O batla ho reka dintho dife hape? Mohato wa 2 • O na le bokae? • Sena se tla ja… Mohato wa 3 • Na o salletswe ke tjhelete e itseng? • Na o ka rata ho sebedisa tjhelete eo ho reka ho hong hape? • O na le tjhelete e lekaneng? • Kapa o kgetha ho e bolokela nako e tlang? • Lebese le qala ka medumo efe? (lllll) • Tlhapi e qala ka modumo ofe? (tlh)

source: Let’s put the Money Rubs the children did to good use with Spending Coins!💰
sot: Ha re sebediseng di-Pikitla Tjhelete tseo bana ba di entseng hantle ka ho Sebedisa Dikhoine! 💰

source: This game develops:
sot: Papadi ena e ntshetsa pele:

source: ✔️Talking & Understanding ✔️Social
sot: ✔️Ho bua le ho utlwisisa ✔️Bokgoni ho tsa phedisano

source: Now that the children have created their own money during the previous activity, it’s time to give them something to spend it on. You’ll need: 1. Coin drawings from the previous Small Group Activity. 2. Scissors. 3. A piece of paper for each child to make a purse. 4. Empty food containers such as cereal boxes, milk bottles, egg boxes, etc. Have enough for each child to “buy” a few items. 🍞🥔🥚
sot: Jwale ka hore bana ba se ba iketseditse tjhelete ya bona ka nako ya ketsahalo e fetileng, ke nako ya ho ba fa ho hong moo ba ka e sebedisang. O tla hloka: 1. Metako ya dikhoine tse tswang Ketsahalong e fetileng ya Dihlotshwana. 2. Dikere. 3. Sekgetjhana sa pampiri bakeng sa ngwana ka mong bakeng sa ho etsa sepatjhe. 4. Ditshelo tsa dijo tse se nang letho tse kang mabokose a sereale, dibotlolotsa lebese, mabokose a mahe, jj. Ebang le tse lekaneng hore ngwana ka mong a “reke” dintho tse mmalwa. 🍞🥔🥚
