Repository: Ari-Ramkilowan/po-files
Catalog: translations/SGroup7(Release (open))_Pedi; Sepedi;  Northern Sotho.po
Languages: nso

source: Read the notes
nso: Bala dinoutse

source: See what you need
nso: Bona se o se hlokago

source: See how it works
nso: Bona ka moo e šomago ka gona

source: Back to menu
nso: Re boela morago go menyu

source: The lion is the king of the jungle, let’s see what the kids know about it: Level 1 • What sound does a lion make? • Where do they live? • What do they eat? • What should you do if you see a lion? Level 2 • What kind of animals are they? (Cats and mammals) • What do they look like? • How big are they? • What colour are they? Level 3 • What else can you tell me about lions? • What other animals live near lions? • Let’s talk about those – what do you know about elephants, or rhinos? • What sound does the word ‘lion’ start with? • What sound does the word ‘rhino’ start with? • What sound does the word ‘elephant’ start with?
nso: Tau ke kgošikgolo ya lešoka, a re boneng ge e ba bana ba tseba mabapi le se: Kgato ya 1 • Naa tau e dira modumo wa mohuta mang? • Naa ditau di dula kae? • Naa di ja eng? • O swanetše go dira eng ge o bona tau? Kgato ya 2 • Naa ke diphoofolo tša mohuta mang? (Dikatse le diamuši) • Naa di swana le eng? • Naa ke tše kgolo gakaakang? • Naa mmala wa tšona o bjang? Kgato ya 3 • Naa ke eng se sengwe seo o ka mpotšago sona mabapi le ditau? • Ke diphoofolo dife tše dingwe tše di phelago kgauswi le ditau? • A re boleleng ka tšona – o tseba eng mabapi le ditlou, goba ditšhukudu? • Lentšu le ‘tau’ le thoma ka modumo ofe? • Lentšu le ‘tšhukudu’ le thoma ka modumo ofe? • Lentšu le ‘tlou’ le thoma ka modumo ofe?

source: This game develops:
nso: Papadi ye e kaonafatša:

source: Have you made any Little Lions yet? 🦁
nso: Naa o šetše o dirile Ditawana dife goba dife? 🦁

source: ✔️Walking & Moving ✔️Arm & Hand control
nso: ✔️Go sepela ka maoto le go šutha ✔️Taolo ya letsogo le seatla

source: If you have time, get the children cut these things out themselves: ✂ - 1 paper per child for the lion’s face - 2 black eyes per child cut out of paper - 1 nose per child cut out of paper - 2 ears per child cut out of paper - 1 plastic / onion bag per child
nso: Ge e le gore o na le nako, e re bana ba ripe dilo tše ka bobona: ✂ 1. Pampiri e 1 go ngwana yo mongwe le yo mongwe go dira sefahlogo sa tau 2. Efa ngwana yo mongwe le yo mongwe mahlo a maso a 2 ao a ripilwego pampiring 3. Efa ngwana yo mongwe le yo mongwe nko e 1 yeo e ripilwego pampiring 4. Efa ngwana yo mongwe le yo mongwe ditsebe tše 2 tše di ripilwego pampiring 5. Efa ngwana yo mongwe le yo mongwe mokotla wa polastiki/dieie

source: You can use this activity as an opportunity to teach children about animals. 1.Talk about lions before you make the lion face. 2.Ask each child to cut out a circle to make the lions face. 3.They can colour in the face of the lion and stick on eyes, nose and ears. 4.Get them to cut strips of plastic or onion bag for the mane of the lion. 5.Stick on the strips. 6.If you have string, you could make holes in the eyes and turn the lion face into a mask. 7.Get children to crawl around and roar like lions.
nso: O ka šomiša mošomo wo bjalo ka sebaka sa go ruta bana ka ga diphoofolo. 1. Bolela ka ditau pele o dira sefahlogo sa tau. 2. Kgopela ngwana yo mongwe le yo mongwe go ripa sediko go dira sefahlogo sa tau. 3. Ba ka kgabiša sefahlogo sa tau ka mebala le go kgomaretša mahlo, nko le ditsebe. 4. E re ba ripe meseto ya mokotlana wa polastiki goba wa eie go dira mariri a tau. 5. Kgomaretša meseto. 6. Ge e le gore o na le thapo, o ka phula mašoba mo mahlong le go fetoša sefahlogo sa tau go ba seširasefahlogo. 7. E re bana ba gogobe le go rora bjalo ka ditau.
