Repository: Ari-Ramkilowan/po-files
Catalog: translations/SGroup7(Release (open))_South Ndebele.po
Languages: nbl

source: Read the notes
nbl: Funda amaAwathi

source: See what you need
nbl: Bona ukuthi utlhoga ini

source: See how it works
nbl: Bona ukuthi isebenza bunjani

source: Back to menu
nbl: Buyela erhelweni

source: The lion is the king of the jungle, let’s see what the kids know about it: Level 1 • What sound does a lion make? • Where do they live? • What do they eat? • What should you do if you see a lion? Level 2 • What kind of animals are they? (Cats and mammals) • What do they look like? • How big are they? • What colour are they? Level 3 • What else can you tell me about lions? • What other animals live near lions? • Let’s talk about those – what do you know about elephants, or rhinos? • What sound does the word ‘lion’ start with? • What sound does the word ‘rhino’ start with? • What sound does the word ‘elephant’ start with?
nbl: Ibhubezi ikosi Iyeithukghu, khesibone ukuthi abantwana bazini ngayo: Ileveli yoku - 1 • Ngimuphi umsindo owenziwa libhubezi? • Ahlala kuphi? • Adlani? • Kufanele wenzeni nawubona ibhubezi? Ileveli Iyei - 2 • Angimiphi imihlobo yeenlwana? (Abokatsu Awama isilwana esimunyisako) • Anjani? • Makhulu kangangani? • Ambala onjani? Ileveli Iyei - 3 • Khuyini okunye ongangitjela khona ngamabhubezi? • Ngiziphi ezinye iinlwana ezihlala qadi kwamabhubezi? • Khe sikhulume ngalezo – wazini ngeendlovu Awama abobhejane? • Igama elithi ‘ibhubezi’ lithoma ngamuphi umsindo? • Igama elithi “ubhejane’ lithoma ngamuphi umsindo? • Igama elithi ‘indlovu’ lithoma ngamuphi umsindo?

source: This game develops:
nbl: Umdlalo lo uthuthukisa:

source: Have you made any Little Lions yet? 🦁
nbl: Sewenzile i - Little Lions encane? 🦁

source: ✔️Walking & Moving ✔️Arm & Hand control
nbl: ✔️Ukukhamba Awakusikinyeka ✔️Ukulawula umkhoAwa nesandla

source: If you have time, get the children cut these things out themselves: ✂ - 1 paper per child for the lion’s face - 2 black eyes per child cut out of paper - 1 nose per child cut out of paper - 2 ears per child cut out of paper - 1 plastic / onion bag per child
nbl: Nange unesikhathi, ithi abantwana bazisikele bona iintwezi ngokwabo: ✂ 1. iphepha li – 1 umtwana lokusika ubuso bebhubesi 2. amehlo ama – 2 anzima abazakuwasika ephepheni 3. ipumulo yi – 1 umntwana ngamunye ayisika ephepheni 4. iindlebe ezi - 2 umntwana ngamunye azisika ephepheni 5. iplastikana yi – 1/ umgodla we-eyi umntwana ngamunye

source: You can use this activity as an opportunity to teach children about animals. 1.Talk about lions before you make the lion face. 2.Ask each child to cut out a circle to make the lions face. 3.They can colour in the face of the lion and stick on eyes, nose and ears. 4.Get them to cut strips of plastic or onion bag for the mane of the lion. 5.Stick on the strips. 6.If you have string, you could make holes in the eyes and turn the lion face into a mask. 7.Get children to crawl around and roar like lions.
nbl: Ungasebenzisa umsebenzi lo njengethuba lokufundisa abantwana ngeembandana. 1. Coca ngamabhubezi ngaphambi kokobana wenze ubuso bebhubezi. 2. Bawa umntwana ngamunye bona asike isiyingi ukwenza ubuso bebhubezi. 3. Bangafaka ubuso bebhubezi umbala, banamathisele amehlo, ipumulo neendlebe. 4. Ithi basike iinquntu zamaplastiki Awama umgodla we – eyi ukwenza intamo yebhubezi. 5. Namathisela iinquntu zeplastiki. 6. Nawunentambo, Ungenza iimbobo emehlweni bese wenza ubuso bebhubezi imaskhi. 7. Thana abantwana bakhase bese balingisa ibhubezi nalibhodlako.
