Repository: Ari-Ramkilowan/po-files
Catalog: translations/SGroup8(Release (open))_Pedi; Sepedi;  Northern Sotho.po
Languages: nso

source: Another great arts and crafts activity is Making Faces 😃🙃🤪😜🤩😎😠🤗🤐😴🤕🤒🤠🤯😍
nso: Mošomo o mongwe wo bohlokwa wa bokgabo le tiroatla ke Go hlama Difahlogo 😃🙃🤪😜🤩😎😠🤗🤐😴🤕🤒🤠🤯😍

source: But I don’t mean pulling faces, I mean making them with: 1. 1 piece of paper per child 2. Wool 3. Scissors and glue For younger children: 1. Cut out 1 pair of eyes per child. 2. Cut out 1 pair of ears per child. 3. Cut out nose per child. 4. Cut out mouth per child. For older children: 1. Pictures where they can cut out the eyes, nose, mouth etc.
nso: Eupša ga be bolele ka go goga difahlogo, ke bolela ka go di dira: 1. Efa ngwana yo mongwe le yo mongwe karolwana e 1 ya pampiri 2. Wulu 3. Sekero 4. Sekgomaretši Go bana ba bannyane: 1. Ripa mahlo a 2 o fe ngwana yo mongwe le yo mongwe. 2. Ripa ditsebe tše 2 o fe ngwana yo mongwe le yo mongwe. 3. Ripa nko o fe ngwana yo mongwe le yo mongwe. 4. Ripa molomo o fe ngwana yo mongwe le yo mongwe. Go bana ba bagolo: 1. Diswantšho moo ba ka ripago mahlo, nko, molomo, bjalobjalo.

source: Read the notes
nso: Bala dinoutse

source: See what you need
nso: Bona se o se hlokago

source: See how it works
nso: Bona ka moo e šomago ka gona

source: Back to menu
nso: Re boela morago go menyu

source: This game develops:
nso: Papadi ye e kaonafatša:

source: ✔️Arm & Hand Control ✔️Talking & Understanding
nso: ✔️Taolo ya letsogo le seatla ✔️Go bolela le go kwešiša

source: Once you have everything you need: 1. Give each child a piece of paper and cut-out pictures of noses, eyes, ears and mouths to give to younger children. 2. Give pictures of faces to older children. 3. Ask them to use the pictures to make a face. 4. Talk about the senses as you do it (smell, taste, seeing, hearing etc.). 5. Get them to stick their pictures down when they have made their faces. 6. Give them each some wool and ask them to turn it into hair. 7. They can cut and stick the materials in any way they want to. 8. Look at the faces together and talk about them to help the kids learn. There are examples of what to ask in the notes. 9. Cut the faces out and attach them to a stick. 10. You can use these to tell stories.
nso: Morago ga gore o hwetše se sengwe le se sengwe seo o se hlokago: 1. Efa ngwana yo mongwe le yo mongwe karolwana ya pampiri le diswantšho tše di ripilwego tša dinko, mahlo, ditsebe le melomo gore ba di fe bana ba bannyane. 2. Efa bana ba bagolo diswantšho tša difahlogo. 3. Ba kgopele gore ba šomiše diswantšho go dira sefahlogo. 4. Bolelang mabapi le dikwi le le gare le dira se (go nkgelela, tatso, go bona, go kwa, go kgwatha, bjalobjalo). 5. Ba laele gore ba kgomaretše diswantšho tša bona fase ge ba dirile difahlogo tša bona. 6. Efa yo mongwe le yo mongwe wulu le go ba kgopela gore ba e fetoše go ba moriri. 7. Ba ka ripa le go kgomaretša didirišwa ka tsela efe goba efe ge ba nyaka go dira bjalo. 8. Lebelelang difahlogo mmogo le go bolela ka tšona go thuša digotlane go ithuta. Go na le mehlala ya tšeo o ka di botšišago ka dinoutseng. 9. Ripa difahlogo le go di kgomaretša godimo ga phate. 10. O ka šomiša dilo tše go anega dikanegelo.

source: As promised, here are some questions: ❓ Level 1 • What do we use our noses for? • What do we use our eyes for? • And our ears? • Is your face happy or sad? • What kind of hair will you make? • What is the name of this face? Level 2 • What is your favourite taste? • What do you like to smell? • What can you hear right now? • What can you see with your eyes if you look left? • What can you see with your eyes if you look to the right? Level 3 Allow older children to make up a story - for example: • Who does your face belong to? • Mine is a gogo • What do you want to say to gogo? • Gogo asks: “What you would like for supper?” • Gogo asks if you will help her make supper. • What shall we do first? You can even act the story out if you like.
nso: Bjalo ka ge re tshephišitše, go latela dipotšišo tše mmalwa: Kgato ya 1 • Re šomiša dinko tša rena go dira eng? • Re šomiša mahlo a rena go dira eng? • Ditsebe tša rena tšona di šoma eng? • Sefahlogo sa gago se thabile goba se nyamile? • Ke moriri wa mohuta mang wo o ka o dirago? • Leina la sefahlogo se ke lefe? Kgato ya 2 • Tatso ya gago ya mmamoratwa ke efe? • Ke eng seo o ratago go se dupelela? • Ke eng seo o ka se kwago gonabjale? • Ke eng seo o ka se bonago ka mahlo a gago ge o lebelela go la nngele? • Ke eng seo o ka se bonago ka mahlo a gago ge o lebelela go la goja? Kgato ya 3 Dumelela bana ba bagolo go hlama kanegelo – mohlala: • Naa sefahlogo sa gago se wela legorong lefe? • Sa ka se bjalo ka sa koko. • Ke eng seo o ratago go se botša koko? • Koko a botšiša: “O ka rata go lalela ka dijo tša mohuta ofe?” • Koko o botšiša ge e ba o ka mo thuša go dira selalelo. • Naa re swanetše go dira eng pele? Gape le ka diragatša kanegelo ge le rata.
