Repository: Ari-Ramkilowan/po-files
Catalog: translations/SGroup6(Release (open))_Afrikaans.po
Languages: afr

source: Read the notes
afr: Lees die notas

source: See what you need
afr: Kyk wat jy nodig het

source: See how it works
afr: Kyk hoe dit werk

source: Back to menu
afr: Terug na spyskaart

source: Find the budding scientists and engineers in the class with the game Making Tunnels. 👩🏿‍🔬👨🏿‍🔬
afr: Vind die ontluikende wetenskaplikes en ingenieurs in die klas met die speletjie Maak Tonnels (Making Tunnels). 👩🏿‍🔬👨🏿‍🔬

source: First you have to make the tunnel, then you show the children how it works. 🚇 1. Give each child 2 or 3 toilet rolls. 2. Help them to stick their toilet rolls together to make a long tunnel. 3. They can decorate their tunnel with paper and crayons if they want to. 4. Ask one of the children to hold the tunnel up straight. 5. Place a little bowl at the bottom of the tunnel to catch the stones. 6. Give other children stones and get them to ‘post’ the stones into the top of the tunnel. Use words like ‘up, down, through, top, bottom’ etc. 7. Allow older children to make more complex tunnels if they want to.
afr: Jy moet eers die tonnel maak en dan vir die kinders wys hoe dit werk. 🚇 1. Gee elke kind 2 of 3 toiletrolle. 2. Help hulle om hul toiletrolle aan mekaar te plak om ’n lang tonnel te maak. 3. Hulle kan hul tonnel met papier en kryte versier as hulle wil. 4. Vra een van die kinders om die tonnel regop te hou. 5. Plaas ’n bakkie onderaan die tonnel om die klippies te vang. 6. Gee klippies vir ander kinders en laat hulle die klippies bo-in die tonnel ‘pos’. Gebruik woorde soos ‘op, af, deur, bo, onder’, ens. 7. Laat die ouer kinders toe om ingewikkelder tonnels te maak as hulle wil.

source: ✔️Exploring & Finding Out ✔️Arm & hand control
afr: ✔️Verkenning en uitvindsel ✔️Arm- en handbeheer

source: Because you’re teaching kids about gravity, it’s a good idea to ask them lots of questions about how they think it works. ⚗ Easiest version • How tall is our tunnel? • How many toilet rolls have we used? More advanced version • What will happen to this stone? • Where will it land? • Whose turn is it now? For older children • Do it 10 times • How many times did it land in the bowl? • How many times did it NOT land in the bowl? • Tell me about your decoration.
afr: Omdat jy kinders oor swaartekrag leer, is dit ’n goeie idee om hulle baie vrae te vra oor hoe hulle dink dit werk. ⚗ Vlak 1 • Hoe hoog is ons tonnel? • Hoeveel toiletrolle het ons gebruik? Vlak 2 • Wat sal met hierdie klippie gebeur? • Waar sal dit land? • Wie se beurt is dit nou? Vlak 3 • Doen dit 10 keer • Hoeveel keer het dit in die bakkie geland? • Hoeveel keer het dit NIE in die bakkie geland nie? • Vertel my van jou versiering.

source: This game develops:
afr: Hierdie speletjie ontwikkel:

source: This game is a fun way to combine crafts with learning, and let’s kids make their own toys. 1. Empty toilet rolls (2 per child) 2. Sticky tape 3. Stones 4. Paper (optional) 5. Crayons (optional)
afr: Hierdie speletjie is ’n prettige manier om handwerk met leer te kombineer, en laat kinders hul eie speelgoed maak. Wat jy nodig sal hê: 1. Leë toiletrolle (2 per kind) 2. Kleefband 3. Klippies 4. Papier (opsioneel) 5. Kryt (opsioneel)
