Repository: Ari-Ramkilowan/po-files
Catalog: translations/SGroup3(Release (open))_Afrikaans.po
Languages: afr

source: On a rainy day, or if you’ve got a very physical Large group activity planned, why not have some Puzzle Fun? 🌧= 🖼
afr: Op ’n reënerige dag of wanneer jy ’n baie fisiese aktiwiteit vir ’n groot groep beplan het, wat van Pret met Legkaarte (Puzzle Fun)? 🌧= 🖼

source: You don’t even need to go buy puzzles, all you need is: 1. 3 homemade puzzles made from pictures in magazines (choose pictures that children enjoy). 2. Ensure that there are some easier puzzles for younger children, but not too easy.
afr: Jy hoef nie eens legkaarte te koop nie, want al wat jy nodig het, is: 1. 3 tuisgemaakte legkaarte wat van prente in tydskrifte gemaak is (kies prente wat kinders geniet). 2. Sorg dat daar ’n paar makliker legkaarte vir jonger kinders is, maar nie te maklik nie.

source: Once you have your amazing, custom puzzles you can begin. 1. Choose easier puzzles for young children and give more difficult puzzles to older children. 2. Give each child a piece of a puzzle. 3. Ask them to put their pieces down so that everyone can see. 4. Then give them additional pieces, one by one. 5. Slowly help them arrange the pieces so that they can make the puzzle. 6. Talk about the picture. 7. Repeat with the other puzzles. 8. If you think they are able, mix up the 3 puzzles and see if they can sort them out, and build the 3 separate puzzles.
afr: Sodra jy jou fantastiese, pasgemaakte legkaarte het, kan jy begin. 1. Kies makliker legkaarte vir die jong kinders en laat die ouer kinders ingewikkelder legkaarte bou. 2. Gee aan elke kind ’n stuk van die legkaart. 3. Vra dat hulle hul stukke neersit sodat almal dit kan sien. 4. Gee dan nog stukke aan elkeen, een vir een. 5. Help hulle geleidelik om die stukke uit te lê totdat die legkaart gebou is. 6. Gesels oor die prent. 7. Herhaal met die ander legkaarte. 8. As jy voel hulle is in staat, meng die 3 legkaarte en kyk of hulle dit kan uitsorteer, en bou die 3 afsonderlike legkaarte.

source: See what you need
afr: Kyk wat jy nodig het

source: See how it works
afr: Kyk hoe dit werk

source: Read the notes
afr: Lees die notas

source: Back to menu
afr: Terug na spyskaart

source: This game develops:
afr: Hierdie speletjie ontwikkel:

source: ✔️Exploring & Finding out ✔️Skills for Learning
afr: ✔️Verkenning en uitvindsel ✔️Vaardighede vir leer

source: And because this game is to help develop the children’s thinking skills, ask some questions along the way. For the easier puzzles: • What do you think this picture is? • Where do you think this piece goes? While putting the puzzle together: • Tell me about this picture? • What can you see? • Is this an edge or a middle piece? If you mix all three puzzles: • What happens if we mix up the puzzles? • Who has this piece?
afr: En omdat hierdie speletjie die kinders se denkvermoë moet ontwikkel, vra ’n paar vrae soos hulle vorder. Vir die makliker legkaarte: • Wat dink jy is hierdie prent? • Waar dink jy moet hierdie stukkie gaan? Terwyl hulle die legkaart bou: • Wat kan jy my van hierdie prent vertel? • Wat sien jy? • Is dit ’n kantstuk of middelstuk? As jy al drie legkaarte meng: • Wat gebeur as ons die legkaarte saamgooi? • Wie het hierdie stukkie?
