Repository: Ari-Ramkilowan/po-files
Catalog: translations/SGroup13(Release (open))_Tswana.po
Languages: tsn

source: Read the notes
tsn: Bala dintlha

source: See what you need
tsn: Bona se o se tlhokang

source: See how it works
tsn: Bona kafa o tshamekiwang ka teng

source: Back to menu
tsn: Boela kwa mmenyung

source: Make sure the children don’t get too excited and take a bite out of their playdough! 🤢 1. Tell the children that they’re going to make an ice cream. 2. Talk about ice creams. 3. Show them how to roll the play dough into long, thin sausages, and then roll them round and round, making a circle. 4. Put a stick in to make an ice cream. 5. Show them the other kinds of ice creams you can make by rolling balls and decorating them. 6. Have fun, ask questions, and talk to help the children learn more as they play. 7. Set up an ice cream shop to sell the ice creams. 8. Put up pictures of the different kinds of flavours there are. 9. Sing a rhyme about ice cream if you want to. RHYME: I scream, you scream, we ALL scream for ice cream!
tsn: Tlhomamisa gore bana ga ba seka ba tshwarega ka boitumelo mme ba ngathe borotho jo bo dubilweng jwa go tshameka. 🤢 1. Bolelela bana gore ba tlile go dira aesekerime. 2. Bua ka aesekerime. 3. Ba bontshe go rola borotho jo bo dubilweng go bo dira disoseije tse di telele, tse ditshesane ba bo ba di dikolosa go dira sekele. 4. Tomela thobanyane mo go bone go dira aesekerime. 5. Ba bontshe mefuta e mengwe ya aesekerime e o ka e dirang ka go rola dibolwana le go di kgabisa. 6. Tshamekang ka go jamonate, botsa dipotso, mme o bue go thusa bana go ithuta tse dintsi jaaka ba ntse ba tshameka. 7. Tlhoma lebentlele la aesekerime go rekisa diaesekerime mo go yone. 8. Baya ditshwantsho tsa mefuta e e farologaneng ya ditatso e o nang le yone. 9. Opela pina ya morumo ka aesekerime fa o batla. MORUMO: Ke a sekerima, o a sekerima, ROTLHE re sekerimela aesekerime!

source: Ask the children some questions to help their imaginations run wild. Level 1 • What ice creams do you like? • When do you eat them? • How do you feel when you have an ice cream? • What colour are you going to make? • What shape do you like? • Etc. Level 2 • What flavour are your ice creams? • How many do we have now? • Should we set up and ice cream shop? Level 3 • How much do your ice creams cost? • I only have this amount of money. Do I need change?
tsn: Botsa bana dipotso dingwe go ba thusa gore ba itlhamele dilo tse di farologaneng ka mo ba ka kgonang ka teng. Maemo 1 • O rata diaesekerime tsa mofuta ofe? • O di jela kae? • O ikutlwa jang fa o ja aesekerime? • O tlile go dira mmala ofe? • O rata sebopego sefe? • Jalo jalo. Maemo 2 • Aesekerime ya gago ke ya tatso efe? • Re na le di le kae? • A re tlhome lebentlelenyana la aesekerime? Maemo 3 • Aesekerime ya gago e ja bokae? • Ke tshotse bokana fela. A ke tlhoka tšhentšhi?

source: ✔️Talking & Understanding ✔️Arm & hand control
tsn: ✔️Go bua le go tlhaloganya ✔️Taoloya lebogo le seatla

source: This is a great game to play during summer, and the good news is that these Playdough Ice Creams won’t melt. 🍦
tsn: Sevke motshameko o o siameng thata go o tshameka selemo, mme se se molemo ke gore Diaesekerime tsa Borotho jo bo Dubilweng jwa go Tshameka ga di na go nyerologa. 🍦

source: This one is super simple! All that’s needed is: 1. Playdough in a few different colours. 2. Ice cream sticks or something that could be used as an ice cream stick.
tsn: O o bonolo fela thata! Se se tlhokegang fela ke: 1. Borotho jo bo Dubilweng jwa go Tshameka ka mebala e e farologaneng. 2. Dithobanenyana tsa aesekerime kgotsa sengwe se se ka dirisiwang jaaka dithobanyane tsa aesekerime.

source: This game develops:
tsn: Motshameko o o a tswelela:
