Repository: Ari-Ramkilowan/po-files
Catalog: translations/SGroup2(Release (open))_Pedi; Sepedi;  Northern Sotho.po
Languages: nso

source: See what you need
nso: Bona se o se hlokago

source: Read the notes
nso: Bala dinoutse

source: Back to menu
nso: Re boela morago go menyu

source: It’s time to play Knock Down Skittles. 🎳
nso: Ke nako ya go raloka papadi ya Thula Mehwidinyane. 🎳

source: This game develops:
nso: Papadi ye e kaonafatša:

source: ✔️Arm & Hand Control ✔️Numbers , Shapes and Sizes
nso: ✔️Taolo ya letsogo le seatla ✔️ Dinomoro, dibopego le bogolo

source: This is a great to get the children playing in groups together so that they can make new friends. 1. A set of skittles (3 to 5). You can make these out of empty drinking bottles, but not glass. 2. A ball (you can make this out of plastic bags and onion bags). 3. Space to play skittles.
nso: Se se a thabiša go bona bana ba raloka mmogo ka dihlopha gore ba kgone go ikhweletša bagwera ba bafsa. 1. Sete ya mehwidinyane (ye 3 go fihla go 5). O ka dira e dira ka mabotlelo ao a se nago selo a dino, e sego a galase. 2. Kgwele (o ka e dira ka mekotla ya polastiki le mekotla ya dieie). 3. Sekgoba go ralokela mehwidinyane.

source: See how it works
nso: Bona ka moo e šomago ka gona

source: It’s also really straightforward, and you can play it over and over. All you have to do is: 1. Line the skittles up in a row. 2. Line the children up in front of the skittles. 3. Together take 5 steps back and count out loud as they step backwards. 4. Give each child a turn to roll the ball towards the skittles. 5. The ball should not leave the ground. 6. Reset the skittles when they have been knocked over. 7. This time take six steps back. 8. Have the children throw under arm first. 9. Then throw overarm. 10. Throw ball with two hands. 11. Throw ball with one hand.
nso: E tloga e le bonolo, le gona le ka e raloka kgafetšakgafetša. Tšeo o swanetšego go di dira ke: 1. Bea mehwidinyane ka go latelana mothalading. 2. Bea bana ka go latelana ka pele ga mehwidinyane. 3. Tšeang dikgato tše 5 le boela morago gomme o bale ka go hlaboša lentšu ge ba gatela morago. 4. Efa ngwana yo mongwe le yo mongwe sebaka sa go kgokološetša kgwele go mehwidinyane. 5. Kgwele e swanetše go kgokologa fase. 6. Tsoša mehwidinyane ge e le gore e thutšwe ke kgwele. 7. Mo nakong ye tšea dikgato tše tshela go ya morago. 8. E re bana putliše kgwele ka mahwafeng a bona ge ba e foša. 9. Morago ga moo ba e putliše sekgetleng. 10. Foša kgwele ka diatla tše pedi. 11. Foša kgwele ka seatla se tee.

source: But it’s not just physical, you can also use these questions to help the kids learn more: Before you start: • How many skittles can you see? • What colours are they? While you’re taking turns: • How many did you knock over? • How many are left? • Can you catch the ball with 2 hands? Before you start the next round: • How many steps should we take now? • Is that more or less than last time? • Can you catch the ball 1-handed?
nso: Eupša ga se mmele fela wo o šomago. O ka šomiša le dipotšišo tše go thuša digotlane go ithuta go tsenelela: Pele o thoma: • Naa o bona mehwidinyane ye mekae? • Naa e na le mebala efe? Ge le le gare le šielana: • Ke tše kae tše o di thutšego? • Go šetše tše kae? • O ka swara kgwele ka diatla tše pedi? Pele le thomiša ka tikologo ya bobedi: • Ke dikgato tše kae tšeo re swanetšego go di tšea gabjale? • Di feta goba di fetwa ke dikgato tšeo di tšerwego la mafelelo? • O ka swara kgwele ka diatla tše pedi?
