Repository: Ari-Ramkilowan/po-files
Catalog: translations/SGroup12(Release (open))_Venda.po
Languages: ven

source: It’s time for these budding entrepreneurs to learn about the value of money. 1. Give each child their coin rubbings from the previous activity. 2. Ask them to cut out the coins. 3. Help those that need it. 4. Help them to fold over their piece of paper to make a purse. 5. Ask the children to put their coins into their new purse for safekeeping. 6. Set up a shop. 7. Talk about the items in your shop as you set up. 8. Have words under your items. Eg, milk, bread, cereal, etc. 9. Ask each child to come to your shop and buy something. 10. When they give you their money, tell them what they can buy with it. 11. Talk as you play and ask questions to help the children learn. 12. For the older children, ask them for money and give them change.
ven: Ndi tshifhinga tsha uri avha vhoramabindu vhane vha khou bvelela vha gude nga ha ndeme ya tshelede. 1. Kha vha ṋee ṅwana muṅwe na muṅwe tshelede ya tsimbi yo olwaho u bva kha mushumo wo fhiraho. 2. Kha vha vha humbele vha gere tshelede idzo. 3. Kha vha thuse avho vhane vha ṱoḓa thuso. 4. Kha vha vha thuse vha pete zwipiḓa zwa mabammbiri avho vha ite tshipatshi. 5. Kha vha humbele vhana vha dzhenise tshelede dzavho tshipatshini tshavho tshiswa uri i vhe yo vhulungeaho. 6. Kha vha vha itele vhengele. 7. Kha vha ambe nga ha zwithu zwine zwa vha vhengeleni ḽavho musi vha tshi khou paka. 8. Kha vha vhee madzina kha zwithu zwavho, sa tsumbo, mafhi, vhurotho, mukapu na zwiṅwevho. 9. Kha vha humbele vhana vha ḓe vhengeleni ḽavho u renga. 10. Musi vha tshi vha ṋea tshelede yavho, kha vha vha vhudze uri vha nga renga mini ngayo. 11. Kha vha ambe navho musi vha tshi khou tamba mutambo uyu vha vha vhudzise mbudziso uri vha thuse vhana u guda. 12. Kha vhana vhahulwane, kha vha vha humbele uri vha badele vha vha ṋee tshentshi.

source: See what you need
ven: Zwine vha ṱoḓa

source: See how it works
ven: Zwi shumisa hani

source: Read the notes
ven: Kha vha vhale notsi

source: Back to menu
ven: Kha vha humele murahu kha zwirengomu

source: Spending money is easy, it’s saving money that’s hard. Try remind the children how important saving is while you talk to them. 🏦 Level 1 • Where do you keep your money? • What do you want to buy at my shop? • What are you going to cook with these things…? • What else would you like to buy? Level 2 • How much money have you got? • That will cost… Level 3 • Have you got any money left? • Would you like to use that money to buy something else? • Do you have enough? • Or would you rather save it for next time? • What sounds does milk start with? (mmmm) • What sound does fish start with? (ffff)
ven: U shumisa tshelede zwo leluwa, zwi konḓaho ndi u vhulunga tshelede. Kha vha lingedze u humbudza vhana uri ndi zwa ndeme hani u vhulunga tshelede musi vha tshi khou amba navho. 🏦 Ḽiga 1 • Ni vhea ngafhi tshelede? • Ni khou ṱoda u renga mini vhengeleni ḽanga? • Ni khou ya u bika mini nga izwi zwithu? • Ni ḓo dovha na ṱoḓa u renga mini? Ḽiga 2 • Ni na vhugai? • Izwo zwi ḓo vha… Ḽiga 3 • Ni tshe na tshelede yo salaho? • Ni ḓo ṱoda u shumisa tshelede u renga tshiṅwe tshithu? • I a lingana naa? • Kana ni ḓo ṱoḓa u i vhulunga u itela tshifhinga tshiḓaho? • Mafhi a thoma nga mubvumo ufhio? (mmmm) • Khovhe i thoma nga mubvumo ufhio? (kh)

source: Let’s put the Money Rubs the children did to good use with Spending Coins!💰
ven: Kha ri shumise miolo ya tshelede dze vhana vha ola zwavhudi kha u renga nga tshelede dza tsimbi! 💰

source: This game develops:
ven: Mutambo u bveledza:

source: ✔️Talking & Understanding ✔️Social
ven: ✔️U amba na u pfesesa ✔️Vhukoni kha zwa matshilisano

source: Now that the children have created their own money during the previous activity, it’s time to give them something to spend it on. You’ll need: 1. Coin drawings from the previous Small Group Activity. 2. Scissors. 3. A piece of paper for each child to make a purse. 4. Empty food containers such as cereal boxes, milk bottles, egg boxes, etc. Have enough for each child to “buy” a few items. 🍞🥔🥚
ven: Zwino ngauri vhana vho no ola tshelede dzavho kha mushumo wo fhiraho, ndi tshifhinga tsha u vha ṋea zwine vha nga renga. Zwine vha ṱoḓa: 1. Miolo ya dzi tshelede dza tsimbi u bva kha mushumo wa Tshigwada Tshiṱuku wo fhiraho. 2. Zwigero. 3. Tshipiḓa tsha bammbiri kha ṅwana muṅwe na muṅwe tsha u ita tshipatshi. 4. Zwithu zwi si tshena tshithu u fana na mabogisi a mukapu, maboḓelo a mafhi, mabogisi a makumba na zwiṅwevho. Kha vha vhe vha na zwi linganaho u itela uri ṅwana muṅwe na muṅwe a kone u ‘renga’ zwithu zwi si gathi. 🍞🥔🥚
