Repository: Ari-Ramkilowan/po-files
Catalog: translations/SGroup3(Release (open))_Zulu.po
Languages: zul

source: On a rainy day, or if you’ve got a very physical Large group activity planned, why not have some Puzzle Fun? 🌧= 🖼
zul: Mhla lina, noma uma unomsebenzi weqembu elikhulu kakhulu owuhlelile, kungani ningazijabulisi Ngama-puzzle? 🌧= 🖼

source: You don’t even need to go buy puzzles, all you need is: 1. 3 homemade puzzles made from pictures in magazines (choose pictures that children enjoy). 2. Ensure that there are some easier puzzles for younger children, but not too easy.
zul: Akudingeki nokuthi uhambe uyothenga ama-puzzle, konke okudingayo nje: 1. Ama-puzzle ama-3 okuzenzela enziwe ngezithombe ezivela kumaphephabhuku (khetha izithombe izingane ezizithokozelayo). 2. Qinisekisa ukuthi kunama-puzzle alula ezingane ezisencane, kodwa angabi lula kakhulu.

source: Once you have your amazing, custom puzzles you can begin. 1. Choose easier puzzles for young children and give more difficult puzzles to older children. 2. Give each child a piece of a puzzle. 3. Ask them to put their pieces down so that everyone can see. 4. Then give them additional pieces, one by one. 5. Slowly help them arrange the pieces so that they can make the puzzle. 6. Talk about the picture. 7. Repeat with the other puzzles. 8. If you think they are able, mix up the 3 puzzles and see if they can sort them out, and build the 3 separate puzzles.
zul: Lapho usunawo ama-puzzle akho athathekisayo, okuzenzela usungaqala-ke. 1. Khetha ama-puzzle aludlana ezingane ezisencane unikeze lawo athanda ukuba lukhunyana izingane ezindadlana. 2. Nikeza ingane ngayinye ucezu lwe-puzzle. 3. Zicele zibeke izingcezu zazo phansi ukuze wonke umuntu akwazi ukubona. 4. Bese uzinikeza izingcezu ezengeziwe, ngalunye ngalunye. 5. Kancane zilekelele ukuhlela izingcezu ukuze zikwazi ukwenza i-puzzle. 6. Xoxani ngesithombe. 7. Kuphindeni lokhu nakwamanye ama-puzzle. 8. Uma ucabanga ukuthi ziyakwazi, xubanisa ama-puzzle amathathu ubone ukuthi zingakwazi na ukuwahlukanisa, bese zakha ama-puzzle amathathu ahlukene.

source: See what you need
zul: Bheka ukuthi yini oyidingayo

source: See how it works
zul: Bheka ukuthi kusebenza kanjani

source: Read the notes
zul: Funda amanothi

source: Back to menu
zul: Buyela kumenyu

source: This game develops:
zul: Lo mdlalo uthuthukisa:

source: ✔️Exploring & Finding out ✔️Skills for Learning
zul: ✔️Ikhono lokufunafuna ✔️Amakhono okufunda

source: And because this game is to help develop the children’s thinking skills, ask some questions along the way. For the easier puzzles: • What do you think this picture is? • Where do you think this piece goes? While putting the puzzle together: • Tell me about this picture? • What can you see? • Is this an edge or a middle piece? If you mix all three puzzles: • What happens if we mix up the puzzles? • Who has this piece?
zul: Futhi ngenxa yokuthi lo mdlalo owokusiza ukuthuthukisa amakhono ezingane okucabanga, buza imibuzo ngenkathi zenza ama-puzzle. Kuma-puzzle athanda ukuba lula: • Ucabanga ukuthi yini lesi sithombe? • Ucabanga ukuthi lolu cezu kufanele luye kuphi? Ngenkathi behlanganisa i-puzzle: • Yini ongangitshela yona ngalesi sithombe? • Ubonani? • Ingabe lolu ucezu oluseceleni noma ucezu olungaphakathi? Uma uxube womathathu ama-puzzle: • Kwenzekani uma sixuba ama-puzzle? • Ubani ophethe lolu cezu?
