Repository: Ari-Ramkilowan/po-files
Catalog: translations/SGroup3(Release (open))_Swati.po
Languages: ssw

source: On a rainy day, or if you’ve got a very physical Large group activity planned, why not have some Puzzle Fun? 🌧= 🖼
ssw: Ngelilanga lapho lina khona, noma uma ngabe unemsebenti lekufanele niwente njengelicembu lelikhulu nisebentisa imitimba lebesenivele niwuhlelile, kunjani kutsi nitijabulise ngekudlala iphazili? 🌧= 🖼

source: You don’t even need to go buy puzzles, all you need is: 1. 3 homemade puzzles made from pictures in magazines (choose pictures that children enjoy). 2. Ensure that there are some easier puzzles for younger children, but not too easy.
ssw: Awudzingi nekuya uyotsenga emaphazili, lokudzingako kwekutsi: 1. Emaphazili lama-3 lentiwe ekhaya ngekusebentisa titfombe temamagazini (khetsa titfombe letitsandvwa bantfwana) 2. Cinisekisa kwekutsi kunemaphazili lalula ebantfwana labasebancane, kodwa angabi lula kakhulu.

source: Once you have your amazing, custom puzzles you can begin. 1. Choose easier puzzles for young children and give more difficult puzzles to older children. 2. Give each child a piece of a puzzle. 3. Ask them to put their pieces down so that everyone can see. 4. Then give them additional pieces, one by one. 5. Slowly help them arrange the pieces so that they can make the puzzle. 6. Talk about the picture. 7. Repeat with the other puzzles. 8. If you think they are able, mix up the 3 puzzles and see if they can sort them out, and build the 3 separate puzzles.
ssw: Uma ngabe sewunalamaphazili akho lamahle, nalotentele wona sewungacala. 1. Khetsa emaphazili lalula wentele bantfwana labancane bese unika bantfwa labadzala emaphazili lalukhuni. 2. Niketa umntfwana ngamunye lucetu lwephazili. 3. Bacele kutsi babeke letincetu tabo phansi kute kutsi kubone wonkhe umuntfu. 4. Nyalo banike letinye tincetu, ngamunye ngamunye. 5. Basite kancane kancane kutsi bahlele letincetu kute kutsi bente emaphazili. 6. Khuluma ngalesitfombe. 7. Phindza wente njalo ngalephazili. 8. Uma ngabe ucabanga kutsi bayakhona, ungawahlanganisa lamaphazili lama-3 ubone kutsi bangawacazulula, bese bakha lamaphazili lama-3 lahlukene.

source: See what you need
ssw: Buka kutsi yini loyidzingako

source: See how it works
ssw: Buka kutsi isebenta njani

source: Read the notes
ssw: Fundza emanotsi

source: Back to menu
ssw: Buyela emuva kumenyu

source: This game develops:
ssw: Lomdlalo utfutfukisa:

source: ✔️Exploring & Finding out ✔️Skills for Learning
ssw: ✔️Kutifundzisa nekutfola kabanti ✔️Emakhono ekufundza

source: And because this game is to help develop the children’s thinking skills, ask some questions along the way. For the easier puzzles: • What do you think this picture is? • Where do you think this piece goes? While putting the puzzle together: • Tell me about this picture? • What can you see? • Is this an edge or a middle piece? If you mix all three puzzles: • What happens if we mix up the puzzles? • Who has this piece?
ssw: Kantsi ngoba lomdlalo wentelwe kutfutfukisa indlela bantfwana labacabanga ngayo, buta imibuto lengalendlela. Kwenta lamaphazili lalula: • Ucabanga kutsi lesitfombe siyini? • Ucanabga kutsi lolucetu lungena kuphi? Ngalesikhatsi kuhlanganiswa lephazili: • Yini longangitjela yona ngalesitfombe? • Yini loyibonako? • Ngabe lolucetu lwasekoneni noma lwasemkhatsini? Uma ngabe uhlanganisa lamaphazili lamatsatfu: • Kutawentekani uma kuhlanganiswa onkhe lamaphazili? • Ngubani lonalolucetu?
