Repository: Ari-Ramkilowan/po-files
Catalog: translations/SGroup2(Release (open))_Southern Sotho.po
Languages: sot

source: See what you need
sot: Sheba seo o se hlokang

source: Read the notes
sot: Bala dinoutso

source: Back to menu
sot: Kgutlela ho menu

source: It’s time to play Knock Down Skittles. 🎳
sot: Ke nako ya ho bapala Diha Diseketlele (Knock Down Skittles). 🎳

source: This game develops:
sot: Papadi ena e aha:

source: ✔️Arm & Hand Control ✔️Numbers , Shapes and Sizes
sot: ✔️Taolo ya sephaka le letsoho ✔️Dinomoro, dibopeho le boholo

source: This is a great to get the children playing in groups together so that they can make new friends. 1. A set of skittles (3 to 5). You can make these out of empty drinking bottles, but not glass. 2. A ball (you can make this out of plastic bags and onion bags). 3. Space to play skittles.
sot: Ena ke papadi e ntle bakeng sa ho etsa hore bana ba bapale ka dihlotshwana mmoho ele hore ba tle ba iphumanele metswalle e metjha. 1. Sete ya diseketlele (3 ho isa ho tse 5). O ka di etsa ka dibotlolo tsa ho nwa tse sa tshelang, empa eseng tsa kgalase. 2. Bolo (o ka e etsa ka mekotlana ya polasetiki le mekotla ya eie). 3. Sebaka sa ho bapalla diseketlele.

source: See how it works
sot: Bona hore e sebetsa jwang

source: It’s also really straightforward, and you can play it over and over. All you have to do is: 1. Line the skittles up in a row. 2. Line the children up in front of the skittles. 3. Together take 5 steps back and count out loud as they step backwards. 4. Give each child a turn to roll the ball towards the skittles. 5. The ball should not leave the ground. 6. Reset the skittles when they have been knocked over. 7. This time take six steps back. 8. Have the children throw under arm first. 9. Then throw overarm. 10. Throw ball with two hands. 11. Throw ball with one hand.
sot: E bonolo e le ka nnete, mme o ka e bapala makgetlo a mangata. Seo o lokelang ho se etsa feela ke: 1. Bea diseketlele ka mola. 2. Ere bana ba eme ka mola ka pela diseketlele. 3. Mmoho ba nke mehato e 5 ho ya morao mme ba balle hodimo ha ba ntse ba tjhetjha. 4. Nea ngwana ka mong sebaka sa ho theta bolo ho ya diseketleleng. 5. Bolo ha e a lokela ho tloha fatshe. 6. Bea diseketlele hape ha di se di otluwe di wele kaofela. 7. Kgetlong lena nkang mehato e tsheletseng ho ya morao. 8. Ere bana ba akgele ka letsoho le tlase pele. 9. Ebe ba akgela ka letsoho le hodimo. 10. Ba akgele bolo ka matsoho a mabedi. 11. Ba akgele bolo ka letsoho le le leng.

source: But it’s not just physical, you can also use these questions to help the kids learn more: Before you start: • How many skittles can you see? • What colours are they? While you’re taking turns: • How many did you knock over? • How many are left? • Can you catch the ball with 2 hands? Before you start the next round: • How many steps should we take now? • Is that more or less than last time? • Can you catch the ball 1-handed?
sot: Empa ha se ka mmele feela. Hape o ka nna wa sebedisa dipotso tsena ho thusa bana ho ithuta le ho feta: Pele o qala: • O bona diseketlele tse kae? • Mebala ya tsona ke efe? Ha le ntse le tjhentjhana: • O otlile tse kae hore di we? • Ho setse tse kae? • Na o ka kola bolo ka matsoho a mabedi? Pele le qala ka papadi e latelang: • Re lokela ho nka mehato e mekae jwale? • Na e mengata kapa e ka tlase ho ya nako e fetileng? • Na o ka kola bolo ka letsoho le le leng?
