Repository: Ari-Ramkilowan/po-files
Catalog: translations/SGroup6(Release (open))_Tsonga.po
Languages: tso

source: Read the notes
tso: Hlaya tinotsi

source: See what you need
tso: Vona leswi u swi lavaka

source: See how it works
tso: Vona leswaku swi tirha njhani

source: Back to menu
tso: Ku tlhelela eka menyu

source: Find the budding scientists and engineers in the class with the game Making Tunnels. 👩🏿‍🔬👨🏿‍🔬
tso: Kuma van’watisayense na tiinjhiniyara va nkarhi lowutaka etlilasini hi ntlangu wo Endla Tithanele. 👩🏿‍🔬👨🏿‍🔬

source: First you have to make the tunnel, then you show the children how it works. 🚇 1. Give each child 2 or 3 toilet rolls. 2. Help them to stick their toilet rolls together to make a long tunnel. 3. They can decorate their tunnel with paper and crayons if they want to. 4. Ask one of the children to hold the tunnel up straight. 5. Place a little bowl at the bottom of the tunnel to catch the stones. 6. Give other children stones and get them to ‘post’ the stones into the top of the tunnel. Use words like ‘up, down, through, top, bottom’ etc. 7. Allow older children to make more complex tunnels if they want to.
tso: Xo sungula u fanele ku endla thanele, kutani u komba vana leswaku yi tirha njhani. 🚇 1. Nyika n’wana un’wana na un’wana titrholo ta le thoyilete ti 2 kumbe 3. 2. Va pfuneti ku damarheta tirholo ta le thoyilete, ti khomana tiendla thanele yo leha. 3. Va nga ha khavisa thanele ya vona hi phepha na tikhirayoni loko va swi lava. 4. Byela un’wana wa vana a khoma thanele yi yimela ehenhla. 5. Vekela bawulu leyintsongo ehansi ka thanele ku va yi khoma maribye. 6. Nyika vana lavan’wana maribye na ku endla leswaku va ‘posa’ maribye ehenhla ka thanele. Tirhisa marito yo fana na ‘henhla, hansi, endzeni, henhla, xikarhi’ na man’wana. 7. Pfumelela vana lavakulu ku endla tithanele to karhata loko va swi lava.

source: ✔️Exploring & Finding Out ✔️Arm & hand control
tso: ✔️Ku valanga na ku kuma ✔️Ku lawula voko na xandla

source: Because you’re teaching kids about gravity, it’s a good idea to ask them lots of questions about how they think it works. ⚗ Easiest version • How tall is our tunnel? • How many toilet rolls have we used? More advanced version • What will happen to this stone? • Where will it land? • Whose turn is it now? For older children • Do it 10 times • How many times did it land in the bowl? • How many times did it NOT land in the bowl? • Tell me about your decoration.
tso: Hikwalahokaleswi u dyondzisaka vana hi giravhithi, i mhaka ya kahle ku va vutisa swivutiso swa ndlela leyi va ehleketaka leswaku girhavhithi yi tirhisa ku yini. ⚗ Levhele ya 1 • Xana thanele ya hina yi lehe ku fika kwihi? • Xana hi tirhise tirholo tingani ta le thoyilete? Levhele ya 2 • Xana ku ta humelela yini hi ribye leri? • Xana ri ta wela kwihi? • Xana sweswi i nkarhi wa mani wo endla? Levhele ya 3 • Swi endle ka 10 • Xana ri wele kangani endzeni ka bawulu? • Xana i kangani ri nga WELANGIKI endzeni ka bawulu? • Ndzi byele hi nkhaviso wa wena.

source: This game develops:
tso: Ntlangu lowu wu ya emahlweni:

source: This game is a fun way to combine crafts with learning, and let’s kids make their own toys. 1. Empty toilet rolls (2 per child) 2. Sticky tape 3. Stones 4. Paper (optional) 5. Crayons (optional)
tso: Ntlangu lowu i ndlela yo tsakisa yo katsa ku endla na ku dyondza, na ku endla leswaku vana va tiendlela tithoyi ta vona. U ta lava: 1. Tirholo ta le thoyilete leti nga ri ki na nchumu (2 hi n’wana) 2. Thepi yo damarhela 3. Maribye 4. Phepha (loko u swi tsakela) 5. Tikhirayoni (loko u swi tsakela)
