Repository: Ari-Ramkilowan/po-files
Catalog: translations/SGroup18(Release (open))_South Ndebele.po
Languages: nbl

source: Need some inspiration? Keep the game going with questions like these: Level 1 • Look around and choose an item that everyone can see. • Don’t tell the others what it is. • Then say “I spy with my little eye, something that is green.” • Let the children guess what it is by calling out all the green things they see. • Try not to make it too difficult. Level 2 • Then say “I spy with my little eye, something beginning with ‘w’.” • Use the sound “w”, not the letter. • Let the kids guess the item. • Give each child a turn to take a guess. Level 3 • Then say “I spy with my little eye, something beginning with ‘ch’.” • Use the sound “ch”, not the letter. • Let the kids guess the item. • Give each child a turn to take a guess.
nbl: Udinga ukugcugcuzeleka? Gcina umdlalo ngokubuza imibuzo efana nale: Ileveli yoku - 1 •Qala qala bese ukhetha into ebonwa ngiAwama ngubani. • Ungabatjeli abanye ukuthi khuyini. • Bese uthi “Ngiyahlola ngamehlwami amancane, into elaza.” • Balise baqagele ngokubiza zoke izinto ezihlaza abazibonako. • Zama ukewenza kungabi budisi khulu. Ileveli Iyei - 2 • Bese uthi “Ngiyahlola ngamehlwami amancani, into ethoma ngo ‘w’.” • Yenza umsindo ka - “w”, Hhayi ihlamvu. • Balise baqagele. • Nikela woke umntwana ithuba lokuqagela. Ileveli Iyei - 3 • Bese uthi “Ngiyahlola ngamehlwami amancane, into ethoma ngo ‘ch’.” • Sebenzisa umsindo “ch”, hhayi ihlamvu. • Balise baqagele. •.Nikela woke umntwana ithuba lokuqagela

source: We’re taking I Spy to the next level with some eye glasses. Here’s what you’ll need 👓: • 2 used toilet rolls per child. • String. • Scissors. • 2 sticks per child. • Cellotape.
nbl: Sithatha I - I Spy to the next level neembuko samehlo. Nakhu ozakutlhoga 👓: • amarolo ama -2 wethoyilethi asebenzile, umntwana ngamunye • Intambo • Iinkere • Iigodo ezi - 2 umntwana ngamunye • Isalotheyiphi

source: Read the notes
nbl: Funda amaAwathi

source: Back to menu
nbl: Buyela erhelweni

source: You’ll be showing these cool kids how to make a pair of glasses.😎 1. Cut the toilet roll into 2 rings and tie them together to make glasses 2. Attach the sticks to the sides of the glasses to make the ‘arms’ of the glasses. 3. Support the younger kids. 4. Encourage the older ones to this on their own. 5. Ask the children to put their glasses on and talk about what glasses do. 6. Play I Spy: Find something in the room that everyone can see, for example, a table. 7. Say: “I Spy with my little eye, something beginning with ‘t’ (sound)” 8. Let each child have a turn guessing. 9. Walk around the room and tell them what you see through your glasses. 10. Get them to walk with you, glasses on!
nbl: Uzakutjengisa abantwana abahlakaniphileko laba ukwenza amarhalasi wamehlo.😎 1.Sika irolo libe ziquntu ezimbilibese uyawabopha ukwenza ammarhalasi. 2.Namathisela iiAwado emaqadi wamarhalasi ukwenza ‘imikhoAwa’ yamarhalasi. 3.Thekga abantwana abancane. 4.Khuthaza abantwana abakhulu bazenzele bona ngokwabo. 5.Tjela abantwana bona bambathe amarhalasi wabo begodu batjho ukuthi ngewokwenzani. 6.Dlala - I Spy (Ngiyahlola): Thola into ngekamureni engabowa Awama ngubani, isibonelo, itafula. 7.Ithi: “I Spy ngamehlo wami amancane, into ethoma ngo ‘t’ (itjhada)” 8.Vumela woke umntwana ukuthi aqagele. 9.Khamba khamba ubatjele ukuthi 10.Khamba khambani Awake, nifake amarhalasi!

source: See what you need
nbl: Bona ukuthi utlhoga ini

source: See how it works
nbl: Bona ukuthi isebenza bunjani

source: We put a spin on the classic game, I Spy. 🔍
nbl: Sidlala ngobutjha umdlalo othi, I Spy. 🔍

source: This game develops:
nbl: Umdlalo lo uthuthukisa:

source: ✔️Social ✔️Early Reading & Writing
nbl: ✔️Ophathelene Awamphakathi ✔️Ukufunda Awakubhala kwekuseni
