Repository: Ari-Ramkilowan/po-files
Catalog: translations/SGroup19(Release (open))_Zulu.po
Languages: zul

source: Back to menu
zul: Buyela kumenyu

source: See what you need
zul: Bheka ukuthi yini oyidingayo

source: Read the notes
zul: Funda amanothi

source: See how it works
zul: Bheka ukuthi kusebenza kanjani

source: This game develops:
zul: Lo mdlalo uthuthukisa:

source: It’s time to decorate your classroom by Making Chains. Don’t worry, the children’s chains will be way nice than these: ⛓
zul: Sekuyisikhathi sokuhlobisa igumbi lakho lokufundela nge-Making Chains. Ungakhathazeki, amaketango ezingane azoba mahle kakhulu kunalawa: ⛓

source: ✔️Skills for Learning ✔️Arm & hand control
zul: ✔️Amakhono okufunda ✔️Amakhono okulawula izingalo nezandla

source: Good news! You probably have everything you need under your nose right now. 1. Coloured paper 2. Scissors 3. Glue
zul: Izindaba ezinhle! Cishe usunako konke okudingayo eduze kwakho manje. 1. Iphepha elinombala 2. Isikele 3. I-glue

source: Not exactly sure what to ask? Try out some of these questions: Level 1 • What colour do you like? • How many links will you make? • What could you use your chain for? Level 2 • What is your pattern? • How many colours do you have? Level 3 • How many links do you have? • How many links does your friend have? • How many links do you have together? • What if I take 5 links away? • How many will you have left?
zul: Awuqinisekile kahle ukuthi yini ongayibuza? Zama eminye yale mibuzo: Izinga 1 • Yimuphi umbala owuthandayo? • Zingaki izixhumanisi ozozenza? • Ungawusebenziselani umgexo wakho? Izinga 2 • Iyiphi iphethini yakho? • Unemibala emingaki? Izinga 3 • Zingaki izixhumanisi onazo? • Zingaki izixhumanisi umngane wakho anazo? • Zingaki izixhumanisi eninazo ndawonye? • Kungabanjani uma ngingathatha izixhumanisi ezi-5? • Zingaki ongasala unazo?

source: This activity is great for the children’s hand-eye coordination! 🖐🏿 👁 • Help the children cut the coloured paper into short strips. • They should each have about 10 strips . • Stick the 2 short edges of one strip together, making a ring. • Thread a new strip through the ring and stick its ends together, linking the 2 rings. • Continue with at least 10 strips, and make rings that link to each other. • Make scarves, necklaces, or belts with them before hanging them up in the classroom. • Ask questions as you work to help the kids learn.
zul: Lo msebenzi muhle kakhulu ukusiza ekusebenzisana kwesandla neso ezinganeni! 🖐🏿 👁 • Siza izingane zisike iphepha elimibala libe yimicu emifushane. • Kufanele ngayinye ibe nemicu engaba yi-10. • Namathisela amaphethelo amabili amafushane omucu owodwa, ​​okwenza indandatho. • Thungela umucu omusha endandathweni bese unamathisela amaphethelo ndawonye, ​​uxhumanisa izindandatho ezimbili. • Qhubeka okungenani amaqoqo ayishumi, bese wenza izindandatho ezixhumanisa komunye nomunye. • Yenza izikhafu, imigexo, noma amabhande kanye nabo ngaphambi kokuba uwalengise egumbini lokufundela. • Buza imibuzo njengoba usebenza ukusiza izingane zifunde.
