Repository: Ari-Ramkilowan/po-files
Catalog: translations/SGroup3(Release (open))_Venda.po
Languages: ven

source: On a rainy day, or if you’ve got a very physical Large group activity planned, why not have some Puzzle Fun? 🌧= 🖼
ven: Nga ḓuvha ḽine ha vha hu na mvula, kana arali vha na mushumo wa u shumisa muvhili wa tshigwada tshine tsha vha tshihulwane wo dzudzanyiwaho, ndi ngani vha sa shumisi Phaziḽi? 🌧= 🖼

source: You don’t even need to go buy puzzles, all you need is: 1. 3 homemade puzzles made from pictures in magazines (choose pictures that children enjoy). 2. Ensure that there are some easier puzzles for younger children, but not too easy.
ven: A vha tou tea u renga phaziḽi, zwine vha ṱoḓa ndi: 1. Phaziḽi tharu (3) dzo itwaho hayani u bva kha zwifanyiso zwi re kha magazini (kha vha nange zwifanyiso zwine vhana vha zwi takalela). 2. Kha vha vhone uri hu na phaziḽi dzi sa kondi u itela vhana vhaṱuku, fhedzi dzi songo vha dzo leluwesa.

source: Once you have your amazing, custom puzzles you can begin. 1. Choose easier puzzles for young children and give more difficult puzzles to older children. 2. Give each child a piece of a puzzle. 3. Ask them to put their pieces down so that everyone can see. 4. Then give them additional pieces, one by one. 5. Slowly help them arrange the pieces so that they can make the puzzle. 6. Talk about the picture. 7. Repeat with the other puzzles. 8. If you think they are able, mix up the 3 puzzles and see if they can sort them out, and build the 3 separate puzzles.
ven: Musi vho no nanga phaziḽi yavho yavhuḓi ye vha tou ḓiitela vha nga thoma. 1. Kha vha nange phaziḽi yo leluwaho kha vhana vhaṱuku vha ṋee phaziḽi i konḓaho kha vhana vhahulwane. 2. Kha vha ṋee ṅwana muṅwe na muṅwe tshipiḓa tsha phaziḽi. 3. Kha vha vha humbele muṅwe na muṅwe a vhee tshipiḓa fhasi uri vha kone u vhona. 4. Vha kone u vha ṋea zwiṅwe zwipiḓa, nga tshithihi tshithihi. 5. Nga u ongolowa kha vha vha thuse u vheekanya zwipiḓa izwo uri vha kone u ita phaziḽi. 6. Kha vha ambe nga ha tshifanyiso. 7. Kha vha dovholole nga yeneyo nḓila na kha dziṅwe phaziḽi. 8. Arali vha tshi vhona uri vha ḓo zwi kona, kha vha ṱanganyise phaziḽi tharu (3) vha vhone arali vha tshi kha dzi vheekanya nga nḓila yone, vha fhaṱe phaziḽi tharu (3) dzo fhambananaho.

source: See what you need
ven: Zwine vha ṱoḓa

source: See how it works
ven: Zwi shumisa hani

source: Read the notes
ven: Kha vha vhale notsi

source: Back to menu
ven: Kha vha humele murahu kha zwirengomu(Menu)

source: This game develops:
ven: Mutambo u bveledza:

source: ✔️Exploring & Finding out ✔️Skills for Learning
ven: ✔️U ṱoḓisisa na u wanulusa ✔️Vhukoni ha u guda

source: And because this game is to help develop the children’s thinking skills, ask some questions along the way. For the easier puzzles: • What do you think this picture is? • Where do you think this piece goes? While putting the puzzle together: • Tell me about this picture? • What can you see? • Is this an edge or a middle piece? If you mix all three puzzles: • What happens if we mix up the puzzles? • Who has this piece?
ven: Ngauri mutambo uyu ndi u thusa vhana u bveledza vhukoni ha u humbula, kha vha ite vha tshi vhudzisa mbudziso. Kha phaziḽi dzi sa konḓi: • Ni vhona u nga tshifanyiso itshi ndi tshifhio? • Ni vhona uri tshipiḓa itshi tshi nga dzhena ngafhi? Musi vha tshi khou ṱumekanya phaziḽi: • Ni nga mmbudza mini nga ha tshifanyiso itshi? • Ni khou vhona mini? • Afha ndi kha lumeme kana ndi tshipiḓa tsha vhukati? Arali vha tshi khou ṱanganyisa phaziḽi tharu: • Hu itea mini arali ra ṱanganyisa phaziḽi idzi? •Ndi nnyi ane a vha na tshipida itshi?
