Repository: Ari-Ramkilowan/po-files
Catalog: translations/SGroup12(Release (open))_Zulu.po
Languages: zul

source: It’s time for these budding entrepreneurs to learn about the value of money. 1. Give each child their coin rubbings from the previous activity. 2. Ask them to cut out the coins. 3. Help those that need it. 4. Help them to fold over their piece of paper to make a purse. 5. Ask the children to put their coins into their new purse for safekeeping. 6. Set up a shop. 7. Talk about the items in your shop as you set up. 8. Have words under your items. Eg, milk, bread, cereal, etc. 9. Ask each child to come to your shop and buy something. 10. When they give you their money, tell them what they can buy with it. 11. Talk as you play and ask questions to help the children learn. 12. For the older children, ask them for money and give them change.
zul: Isikhathi sokuba osomabhizinisi abasafufusa bafunde ngokubaluleka kwemali. 1. Nikeza ingane ngayinye umfanekiso ewukhuhle kuhlamvu lwemali emsebenzini wangaphambilini. 2. Zicele zisike izinhlamvu zemali. 3. Siza labo abadinga usizo. 4. Basize ukuba bagoqe iphepha labo ukuze benze isikhwama semali. 5. Cela izingane zibeke imali yazo esikhwameni sazo esisha ukuze igcinwe ngokuphepha. 6. Hlela isitolo. 7. Khuluma ngezinto ezitolo sakho njengoba uzihlela. 8. Beka amagama ngaphansi kwezinto zakho. Isibonelo, ubisi, isinkwa, isiriyeli, njll. 9. Cela ingane ngayinye ize esitolo sakho futhi ithenge okuthile. 10. Uma bekunika imali yabo, batshele ukuthi yini abangayithenga ngayo. 11. Khuluma njengoba udlala bese ubuza imibuzo ukusiza izingane zifunde. 12. Kubantwana abadadlana, bacele bakhokhele okuthile bese ubanikeza ushintshi.

source: See what you need
zul: Bheka ukuthi yini oyidingayo

source: See how it works
zul: Bheka ukuthi kusebenza kanjani

source: Read the notes
zul: Funda amanothi

source: Back to menu
zul: Buyela kumenyu

source: Spending money is easy, it’s saving money that’s hard. Try remind the children how important saving is while you talk to them. 🏦 Level 1 • Where do you keep your money? • What do you want to buy at my shop? • What are you going to cook with these things…? • What else would you like to buy? Level 2 • How much money have you got? • That will cost… Level 3 • Have you got any money left? • Would you like to use that money to buy something else? • Do you have enough? • Or would you rather save it for next time? • What sounds does milk start with? (mmmm) • What sound does fish start with? (ffff)
zul: Ukusebenzisa imali kulula, ukulondoloza imali okunzima. Zama ukukhumbuza izingane ukuthi kubaluleke kangakanani ukulondoloza imali ngenkathi ukhuluma nazo. 🏦 Izinga 1 • Uyigcina kuphi imali yakho? • Ufuna ukuthengani esitolo sami? • Uzophekani ngalezi zinto? • Yini enye ongathanda ukuyithenga? Izinga 2 • Unamalini? • Lokhu kuzobiza… Izinga 3 • Ingabe unayo imali esele? • Ungathanda ukusebenzisa leyo mali ukuthenga enye into? • Unayo eyanele? • Noma ungathanda ukuyigcinela isikhathi esizayo? • Ingabe liqala ngamuphi umsindo igama elithi bisi? (b) • Ingabe liqala ngamuphi umsindo igama nhlanzi? (n)

source: Let’s put the Money Rubs the children did to good use with Spending Coins!💰
zul: Asisebenzise ama-Money Rubs enziwe yizingane ngendlela efanele ngama-Spending Coins! 💰

source: This game develops:
zul: Lo mdlalo uthuthukisa:

source: ✔️Talking & Understanding ✔️Social
zul: ✔️Ukukhuluma nokuqonda ✔️Amakhono okuphilisana emphakathini

source: Now that the children have created their own money during the previous activity, it’s time to give them something to spend it on. You’ll need: 1. Coin drawings from the previous Small Group Activity. 2. Scissors. 3. A piece of paper for each child to make a purse. 4. Empty food containers such as cereal boxes, milk bottles, egg boxes, etc. Have enough for each child to “buy” a few items. 🍞🥔🥚
zul: Njengoba izingane sezakhe eyazo imali ngesikhathi sokusebenza kwangaphambilini, sekuyisikhathi sokubanika okuthile abazoyichitha kukhona. Uzodinga: 1. Imidwebo yezinhlamvu zemali evela emsebenzini Weqembu Elincane Langaphambilini. 2. Isikele. 3. Isiqeshana sephepha ingane ngayinye sokwenza isikhwama semali. 4. Iziqukathi zokudla ezingenalutho njengamabhokisi amasiriyeli, amabhodlela obisi, amabhokisi amaqanda, njll. Yiba nokwanele ukuba ingane ngayinye "ithenge" izinto ezimbalwa. 🍞🥔🥚
