Repository: Ari-Ramkilowan/po-files
Catalog: translations/SGroup14(Release (open))_Venda.po
Languages: ven

source: Read the notes
ven: Kha vha vhale notsi

source: See what you need
ven: Zwine vha ṱoḓa

source: See how it works
ven: Zwi shumisa hani

source: Back to menu
ven: Kha vha humele murahu kha zwirengomu

source: While their creative juices are flowing, get their brains going by asking them some questions. Level 1 • What colour is this? • What shape is this • How many colours can you see? • Where will you stick this? Level 2 • How many pieces do you have? • What pattern is this? Level 3 • How will you use these pieces to make a picture? • What is your picture? • Can you tell me about it? • Can you make your name?
ven: Musi vha tshi kha ḓi tamba nga muhumbulo, kha vha ṱuṱule maluvhi avho nga u vha vhudzisa dziṅwe dza mbudziso. Ḽiga 1 • Uyu ndi muvhala ufhio? • Itshi ndi tshivhumbeo tshifhio • Ni khou vhona mivhala mingana? • Ni nga nambatedza izwi kha mini? Ḽiga 2 •Ni na zwipiḓa zwingana? • Ndi phetheni ifhio? Ḽiga 3 • Ni nga itisa hani uri zwipiḓa izwi zwi kone u ita tshifanyiso? • Tshifanyiso tshaṋu ndi mini? • Ni nga mmbudza nga hatsho? • Ni nga kona u ṅwala dzina ḽanu?

source: ✔️Arm & Hand Control ✔️Numbers , Shapes & Sizes
ven: ✔️Ndaulo ya tshanḓa tshoṱhe ✔️Nomboro, zwivhumbeo na saizi

source: Now it’s time to turn trash into treasure. 1. Make sure the chip packets are clean. 2. Ask the kids to share the chip packets between themselves. 3. Then ask them to cut or tear up chip packets into small pieces or shapes. 4. Get them to stick these pieces of chip packet onto the paper. 5. Encourage creativity as they make their pictures. 6. Talk about shapes, sizes, colour, texture, patterns, etc. 7. Help them to cut and stick as is needed. 8. Older children can even make spell their names out with the pieces.
ven: Zwino ndi tshifhinga tsha u shandukisa mashika a vha zwithu zwa manakanaka. 1. Kha vha vhone uri phakhete ya masimba yo kuna. 2. Kha vha humbele vhana vha kovhekane phakhethe dza masimba. 3. Kha vha vha humbele vha gere kana u kherula phakhethe dza masimba dzi vhe zwipiḓa kana zwivhumbeo zwiṱuku. 4. Kha vha ri vha nambatedze zwipiḓa izwi zwa mabammbiri a masimba kha bammbiri. 5. Kha vha ṱuṱuwedze u tamba nga muhumbulo musi vha tshi khou ita zwifanyiso zwavho. 6. Kha vha ambe nga ha zwivhumbeo, saizi, muvhala, kupfalele, phetheni na zwiṅwevho. 7. Kha vha vha thuse u gera na u nambatedza nga nḓila ine zwa ṱoḓea ngao. 8. Vhana vhahulwane vha nga peleṱa madzina avho nga zwipiḓa izwi.

source: Use Chip Packet Fun to teach the kids about not only making art, but recycling too.🥔
ven: Kha vha shumise mutambo wa Phakhethe ya Masimba u gudisa vhana hu si nga ha zwa vhutsila fhedzi, na u vha gudisa nga ha u vusuludza/shumisa hafhu.🥔

source: If there’s litter in the area, why not get the kids to collect it and throw it away while they look for chip packets? This is what you’ll for this game: • A clean chip packet per child • Piece of paper per child • Glue and scissors
ven: Arali hu na mashika o sokou laṱekanaho kha vhupo havho, ndi ngani vha sa dzhii vhana uri vha kumbele na u laṱa kule mashika ayo musi vha tshi khou ṱoḓana na phakhethe dza masimba? Izwi ndi zwine vha ḓo zwi ṱoḓa kha mutambo uyu: • Phakhethe ya masimba nga ṅwana • Tshipiḓa tsha bammbiri nga ṅwana • Guḽuu • Zwigero

source: This game develops:
ven: Mutambo u bveledza:
