Repository: Ari-Ramkilowan/po-files
Catalog: translations/SGroup9(Release (open))_Tswana.po
Languages: tsn

source: Use this activity as a bigger learning opportunity by asking the children some fun questions. Level 1 • Who likes blowing bubbles? • What do we normally use dishwashing soap for? • What colours do we have here? Level 2 • What does this pattern look like? • What shapes can you see? • What colours have you made? • How many bubbles can you see here? Level 3 • Let’s mix some colours. • Now what colours do you have? • What does blue and yellow make? (green) • What does red and yellow make? (orange) • What does blue and red make? (purple) • What sound does blue start with? (ba) • What sound does red start with? (rrrrrr) • What sound does yellow start with? (ya) • What sound does green start with? (ga) • What sound does orange start with? (o) • What sound does purple start with? (pa)
tsn: Dirisa tirwana eno jaaka tshono e kgolwane ya go ithuta ka go botsa bana dipotso dingwe tse di jesang monate. Maemo 1 • Ke mang yo o ratang go budula dipudula? • Gantsi re dirisa sesepa se se metsi go dirang? • Ke mebala efe e re nang le yone fa? Maemo 2 • Phethene eno e lebega jaaka eng? • O kgona go bona dipopego dife? • O dirile mebala efe? • Ke dipudula di le kae tse o di bonang fa? Maemo 3 • A re tlhakanyeng mebala. • Jaanong o na le mebala efe? • Mmala wa boluo fa o tlhakantswe le serolwana o dira mmala ofe? (botala) • Mmala wa bohibidu fa o tlhakantswe le serolwana o dira mmala ofe? (orenje) • Mmala wa boluo fa o tlhakantswe le bohibidu o dira mmala ofe? (phepole) • Lefoko boluo le simolola ka modumo wa tlhaka efe efe? (ba) • Lefoko khibidu le simolola ka modumo wa tlhaka efe efe? (kh) • Lefoko serolwana le simolola ka modumo wa tlhaka efe efe? (se) • Lefoko tala le simolola ka modumo wa tlhaka efe efe? (ta) • Lefoko orenje le simolola ka modumo wa tlhaka efe efe? (o) • Lefoko phepole le simolola ka modumo wa tlhaka efe efe? (pa)

source: Read the notes
tsn: Bala dintlha

source: See what you need
tsn: Bona se o se tlhokang

source: See how it works
tsn: Bona kafa o tshamekiwang ka teng

source: Back to menu
tsn: Boela kwa mmenyung

source: Have the children tried Painting with Bubbles yet? 🎨
tsn: A bana ba setse ba kile ba leka motshameko wa go Penta ka Dipudula?🎨

source: This game develops:
tsn: Motshameko o o a tswelela:

source: ✔️Exploring & Finding Out ✔️Early Reading & Writing
tsn: ✔️Go tlhotlhomisa le go itse ✔️Go kgona gobbala le go kwala ba sa le bannye

source: It’s really simple. All you need is: 1. Paint 2. Dishwashing liquid 3. Straws 4. Paper
tsn: O bonolo fela. Se o se tlhokang fela ke: 1. Pente 2. Sesepa se se metsi sa dijana 3. Diseteroo 4. Pampiri

source: Read the note
tsn: Bala dintlha

source: This activity breathes new life into having fun with paint. No paintbrushes required! 🖌 1. Mix some paint with some dishwashing liquid in a cup. 2. Add a little bit of water to the mixture. 3. Give each child a straw and some paper, and ask them to share the paint. 4. Ask them to blow (not suck) through the straw into the cup. This will make bubbles. 5. Then ask the children to hold the paper over the cup and bubbles and press down gently. 6. The bubbles will leave a bubble pattern on the paper. 7. The children can repeat this with other colours and then leave their art to dry.
tsn: Tirwana e e tsenya botshelo mo go jeng monate ka go penta. Ga go tlhokege maborashe a a pentang! 1. Tlhakanya pente le selekanyo se se rileng sa sesepa se se metsi sa dijana mo koping. 2. Tshela metsinyana mo motswakong oo. 3. Naya ngwana mongwe le mongwe seteroo le dipampiri, mme o ba kope gore ba abelane pente. 4.Ba kope go budulela (eseng go gopa) ka diseteroo mo koping. Go dira jalo go dira dipudula. 5. Morago o bo o kopa bana go baya pampiri mo godimo ga kopi le dipudula ba bo ba e gatelela go sekae. 6. Dipudula di tla tlogela phethene ya dipudula mo pampiring. 7. Bana ba ka nna ba boeletsa seo ka mebala e mengwe mme ba bo ba tlogela botsweretshi jwa bone gore bo ome.
