Repository: Ari-Ramkilowan/po-files
Catalog: translations/SGroup17(Release (open))_Afrikaans.po
Languages: afr

source: See what you need
afr: Kyk wat jy nodig het

source: See how it works
afr: Kyk hoe dit werk

source: Read the notes
afr: Lees die notas

source: Back to menu
afr: Terug na spyskaart

source: This game develops:
afr: Hierdie speletjie ontwikkel:

source: Here’s what you’ll need to keep the kids busy: 1. A pre-drawn picture of a dinosaur for each child. 2. Squares about the size of a stamp in 2 or 3 different colours. 3. Glue. 4. Scissors.
afr: Hier is wat jy nodig het om die kinders besig te hou: 1. ’n Vooraf getekende prent van ’n dinosourus vir elke kind 2. Vierkante min of meer so groot soos ’n posseël in 2 of 3 verskillende kleure. 3. Gom 4. ’n Skêr

source: We started from the ground up by making dinosaur footprints in the last activity, so how about we move on to Making Dinosaurs? 🦕
afr: Ons het in die vorige aktiwiteit van onder af begin deur voetspore van dinosourusse te maak. Kom ons beweeg nou verder en Maak ’n Dinosourus (Making Dinosaurs). 🦕

source: ✔️Numbers , Shapes & Sizes ✔️Skills for Learning
afr: ✔️Getalle, vorms en groottes ✔️Vaardighede vir leer

source: Keep the kids wide awake by encouraging them to make dinosaur noises while they work. 🦖🦕 1. Give each child a picture of a dinosaur. 2. Cut out the colourful squares for younger children. 3. Let older children cut their own little squares. 4. Sort the little squares into piles depending on their colour. 5. Show the children how to stick the squares onto their dinosaurs. 6. Help the younger ones while encouraging the older ones. 7. Help them make a pattern using colours (red, blue, red, blue, red, etc).
afr: Hou die kinders wawyd wakker – moedig hulle aan om dinosourusgeluide te maak terwyl hulle werk. 🦖🦕 1. Gee elke kind ’n prent van ’n dinosourus. 2. Knip die kleurvolle vierkante vir jonger kinders uit. 3. Laat ouer kinders hul eie klein vierkante uitknip. 4. Sorteer die klein vierkante in hopies volgens kleur. 5. Wys die kinders hoe om die vierkante op hul dinosourusse te plak. 6. Help die jongeres terwyl jy die ouer kinders aanmoedig. 7. Help hulle om ’n patroon met kleure te maak (rooi, blou, rooi, blou, rooi, ens.).

source: Not sure what to ask the children next? Here are some ideas: Level 1 • What does this dinosaur need? • Where will these spikes go? • How many do you need? • What colours will you choose? Level 2 • What pattern will you make? • Which one shall we start with? • When did dinosaurs live? (The answer can be something like: a long, long time ago). • Are there still dinosaurs on earth? (Answer: no, they have all died). • What do they eat? (Answer: some eat plants, some eat other animals). Level 3 • What sound does dinosaur start with? (da) • What else starts with ‘da’? • Do you know the names of different types of dinosaurs? (Answer: T. rex, brontosaurus, triceratops).
afr: Nie seker watter vrae om die kinders te vra nie? Hier is ’n paar idees: Vlak 1 • Wat het hierdie dinosourus nodig? • Waar moet hierdie penne (spikes) wees? • Hoeveel het jy nodig? • Watter kleure sal jy kies? Vlak 2 • Watter patroon sal jy maak? • Met watter een moet ons begin? • Wanneer het dinosourusse gelewe? (Die antwoord kan iets wees soos: baie, baie lank gelede.) • Lewe dinosourusse nog op aarde? (Antwoord: Nee, hulle is almal dood en het uitgesterf). • Wat het hulle geëet? (Antwoord: Party het plante geëet, en ander het diere geëet.) Vlak 3 • Met watter klank begin dinosourus? (de) • Wat anders begin met ‘de’? • Ken jy die name van verskillende soorte dinosourusse? (Antwoord: T. rex, brontosourus, trikeratops.)
