Repository: Ari-Ramkilowan/po-files
Catalog: translations/SGroup19(Release (open))_Southern Sotho.po
Languages: sot

source: Back to menu
sot: Kgutlela ho menu

source: See what you need
sot: Sheba seo o se hlokang

source: Read the notes
sot: Bala dinoutso

source: See how it works
sot: Bona hore e sebetsa jwang

source: This game develops:
sot: Papadi ena e ntshetsa pele:

source: It’s time to decorate your classroom by Making Chains. Don’t worry, the children’s chains will be way nice than these: ⛓
sot: Jwale ke nako ya ho kgabisa tlelase ya hao ka ho Etsa Diketane. O se tshwenyehe, diketane tsa bana di tla ba ntle ho feta tsena: ⛓

source: ✔️Skills for Learning ✔️Arm & hand control
sot: ✔️Bokgoni bakeng sa ho ithuta ✔️Taolo ya sephaka le letsoho

source: Good news! You probably have everything you need under your nose right now. 1. Coloured paper 2. Scissors 3. Glue
sot: Ditaba tse monate! Mohlomong o na le tsohle tseo o di hlokang hona pela hao mona. 1. Pampiri e mebala 2. Dikere 3. Sekgomaretsi

source: Not exactly sure what to ask? Try out some of these questions: Level 1 • What colour do you like? • How many links will you make? • What could you use your chain for? Level 2 • What is your pattern? • How many colours do you have? Level 3 • How many links do you have? • How many links does your friend have? • How many links do you have together? • What if I take 5 links away? • How many will you have left?
sot: Ha o na bonnete ba hore o ka botsa eng? Leka tse ding tsa dipotso tsena: Mohato wa 1 • Ke mmala ofe oo o o ratang? • O tla etsa dikgokelo tse kae? • O ka sebedisa ketane ya hao bakeng sa eng? Mohato wa 2 • Paterone ya hao ke eng? • O na le mebala e mekae? Mohato wa 3 • O na le dikgokelo tse kae? • Motswalle wa hao o na le dikgokelo tse kae? • Mmoho le na le dikgokelo tse kae? • Ha nka tlosa dikgokelo tse 5 teng? • Ho tla sala tse kae?

source: This activity is great for the children’s hand-eye coordination! 🖐🏿 👁 • Help the children cut the coloured paper into short strips. • They should each have about 10 strips . • Stick the 2 short edges of one strip together, making a ring. • Thread a new strip through the ring and stick its ends together, linking the 2 rings. • Continue with at least 10 strips, and make rings that link to each other. • Make scarves, necklaces, or belts with them before hanging them up in the classroom. • Ask questions as you work to help the kids learn.
sot: Ketsahalo ena e ntle haholo bakeng sa nyalano ya matsoho le mahlo ngwaneng! 🖐🏿 👁 • Thusa bana ho seha dipampiri tse mebala ba di etse metjeketla e mekgutswane. • E mong le e mong o lokela ho ba le metjeketla e 10. • Kgomaretsa maphethelo a 2 a makgutshwane a motjeketla o le mong mmoho, o etse reng. • Kenya motjheketla o motjha ka hara reng mme o kopanye maphethelo a ona mmoho, o kopanya direng tse pedi. • Tswela pele ka bonyane metjeketla e 10, o ntse o etsa direng tse hokahaneng mmoho. • Etsang dikhafo, difaha tsa molala, kapa mabanta le bona pele le di fanyeha ka tlelaseng. • Botsa dipotso ha le ntse le sebetsa bakeng sa ho thusa bana ho ithuta.
