Repository: Ari-Ramkilowan/po-files
Catalog: translations/SGroup17(Release (open))_Southern Sotho.po
Languages: sot

source: See what you need
sot: Sheba seo o se hlokang

source: See how it works
sot: Bona hore e sebetsa jwang

source: Read the notes
sot: Bala dinoutso

source: Back to menu
sot: Kgutlela ho menu

source: This game develops:
sot: Papadi ena e ntshetsa pele:

source: Here’s what you’ll need to keep the kids busy: 1. A pre-drawn picture of a dinosaur for each child. 2. Squares about the size of a stamp in 2 or 3 different colours. 3. Glue. 4. Scissors.
sot: Tsena ke tseo o ka di hlokang ho etsa hore bana ba dule ba sebetsa: 1. Setshwantsho se seng se takilwe sa daenaso bakeng sa ngwana ka mong 2. Dikgutlonnetsepa tse ka lekanang le setempe ka mebala e 2 kapa 3 e fapaneng 3. Sekgomaretsi 4. Dikere

source: We started from the ground up by making dinosaur footprints in the last activity, so how about we move on to Making Dinosaurs? 🦕
sot: Re qadile fatshe ka ho etsa dikgato tsa maoto a daenaso ketsahalong e fetileng, ho ka ba jwang ha re ka fetela ho Ho Etsa Didaenaso? 🦕

source: ✔️Numbers , Shapes & Sizes ✔️Skills for Learning
sot: ✔️ Dinomoro, dibopeho le boholo ✔️Bokgoni bakeng sa ho ithuta

source: Keep the kids wide awake by encouraging them to make dinosaur noises while they work. 🦖🦕 1. Give each child a picture of a dinosaur. 2. Cut out the colourful squares for younger children. 3. Let older children cut their own little squares. 4. Sort the little squares into piles depending on their colour. 5. Show the children how to stick the squares onto their dinosaurs. 6. Help the younger ones while encouraging the older ones. 7. Help them make a pattern using colours (red, blue, red, blue, red, etc).
sot: Boloka bana ba hlaphohetswe ka ho ba kgothaletsa ho etsa medumo ya didaenaso ha ba ntse ba sebetsa. 🦖🦕 1. Nea ngwana ka mong setshwantsho sa daenaso. 2. Seha o ntshe dikgutlonne tse mebalabala bakeng sa bana ba banyenyane. 3. Ere bana ba baholwanyana ba itshehele dikgutlonnetsepa tsa bona. 4. Hlophisa dikgutlonnetsepa tse nyane ka diqubu ho ya ka mebala ya tsona. 5. Bontsha bana kamoo ba ka kgomaretsang dikgutlonnetsepa ho didaenaso ka teng. 6. Thusa ba banyenyane ha o ntse o kgothatsa ba baholwanyane. 7. Ba thuse ho etsa paterone ba sebedisa mebala (kgubedu, bolou, kgubedu, bolou, kgubedu, jj).

source: Not sure what to ask the children next? Here are some ideas: Level 1 • What does this dinosaur need? • Where will these spikes go? • How many do you need? • What colours will you choose? Level 2 • What pattern will you make? • Which one shall we start with? • When did dinosaurs live? (The answer can be something like: a long, long time ago). • Are there still dinosaurs on earth? (Answer: no, they have all died). • What do they eat? (Answer: some eat plants, some eat other animals). Level 3 • What sound does dinosaur start with? (da) • What else starts with ‘da’? • Do you know the names of different types of dinosaurs? (Answer: T. rex, brontosaurus, triceratops).
sot: Ha o na bonnete ba seo o ka se botsang bana kamora moo? Mehopolo ke ena: Mohato wa 1 • Daenaso ee e hloka eng? • Metsu ee e kena hokae? • O hloka e mekae? • O tla kgetha mebala efe? Mohato wa 2 • O tla etsa dipaterone dife? • Ke efe eo re tla qalang ka yona? • Didaenaso di phetse mehleng efe? (Karabo e ka nna ya eba e kang: mehleng ya boholoholo). • Na ho sa ntse ho ena le didaenaso lefatsheng? (Karabo: tjhe, di ne di shwe kaofela mme di fedisitswe). • Di ja eng? (Karabo: tse ding di ja dijalo, tse ding di ja diphoofolo). Mohato wa 3 • Daenaso e qala ka modumo ofe? (d) • Ke eng e nngwe hape e qalang ka ‘d’? • Na o tseba mabitso a mefuta e fapaneng ya didaenaso? (Karabo: T.rex, brontosaurus, triceratops).
