Repository: Ari-Ramkilowan/po-files
Catalog: translations/SGroup5(Release (open))_Zulu.po
Languages: zul

source: Some little ones might get stuck, but that’s fine. Here are some questions to help them talk about what’s happening and learn from it: 💬 Level 1 (simple structure) • Who can remember the pattern? • Which colour was on the bottom? • Which colour was on the top? Level 2 (more complex structure) • Who can remember the pattern? • Which colour was on the bottom? • Which colour was on the top? • Which colours will you use to repeat the pattern? • What does the pattern look like? Level 3 (even more complex structure) • Who can remember the pattern? • Which colours will you use to repeat the pattern? • What does the pattern look like? • How did you remember? • What else can you build with the bricks?
zul: Ezinye izingane ezisencane zingase zixakeke, kodwa akunankinga. Nansi eminye yemibuzo engazisiza zixoxe ngalokho okwenzekayo futhi zifunde kukhona: 💬 Izinga 1 • Ubani oyikhumbulayo iphethini? • Yimuphi umbala obusezansi? • Yimuphi umbala obungaphezulu? Izinga 2 • Ubani oyikhumbulayo iphethini? • Yimuphi umbala obusezansi? • Yimuphi umbala obungaphezulu? • Yimiphi imibala ozoyisebenzisa ukuze uphinde iphethini? • Ibukeka kanjani iphethini? Izinga 3 • Ubani oyikhumbulayo iphethini? • Yimiphi imibala ozoyisebenzisa ukuze uphinde iphethini? • Ibukeka kanjani iphethini? • Ukhumbule kanjani? • Yini enye ongayakha ngamabhuloki?

source: See what you need
zul: Bheka ukuthi yini oyidingayo

source: See how it works
zul: Bheka ukuthi kusebenza kanjani

source: Read the notes
zul: Funda amanothi

source: Back to menu
zul: Buyela kumenyu

source: It’s time to test that memory with a game called Lego — Can You Remember? 🏅
zul: Sekuyisikhathi sokuvivinya inkumbulo yakho ngomdlalo obizwa nge-LEGO — Uyakwazi Ukukhumbula? 🏅

source: The aim is to see if the kids can remember what you did and repeat it. It helps them learn to pay attention. 🧐 1. Build a pattern of 2 bricks (e.g. red then yellow). 2. Show children for 5 seconds and then ask them to remember. 3. Hide the bricks and ask them to see if they can remember the pattern. 4. Repeat with another pattern using different colours or a different order. 5. Each time add more bricks. 6. Use fewer bricks (simple structure) with young children (ages 2 — 4). 7. Use more bricks with older children (ages 4 — 8). 8. Get the children to build patterns for everyone to copy. 9. Talk to the children about shapes, colours, or the number of bricks.
zul: Inhloso ukubona ukuthi izingane ziyakwazi na ukukhumbula lokho okwenzile bese zikwenza nazo. Kuzisiza zikwazi ukugxilisa ingqondo kokwenziwayo. 🧐 1. Yakha iphethini yamabhuloki ama-2 (Isibonelo, okubomvu bese kuba okuphuzi). 2. Khombisa izingane imizuzwana emi-5 bese uzicela zikhumbule. 3. Fihla amabhuloki bese uzibuza ukuze ubone ukuthi ziyayikhumbula na iphethini. 4. Phinda enye iphethini usebenzisa eminye imibala noma ukuma okwehlukile. 5. Isikhathi ngasinye, ungengeza amanye amabhuloki. 6. Sebenzisa amabhuloki ambalwa (isakhiwo esilula) ezinganeni ezincane (iminyaka emi- 2 kuya kwemi-4). 7. Sebenzisa amabhuloki amaningana ezinganeni ezindadlala (iminyaka emi-4 kuya kweyisi-8). 8. Tshela izingane zakhe amaphethini okuzobukelwa kuwo wonke umuntu. 9. Khuluma nezingane mayelana nemimo, imibala, noma inani lamabhuloki.

source: This game develops:
zul: Lo mdlalo uthuthukisa:

source: ✔️Numbers , Shapes & Sizes ✔️Skills for Learning
zul: ✔️Izinombolo, imimo nosayizi ✔️Amakhono okufunda

source: Get as many Lego, Duplo or building blocks as you have. Each child is going to need the same amount as you.
zul: Qoqa wonke ama-LEGO, DUPLO, noma amabhuloki okwakha onawo. Ingane ngayinye izodinga inani elilingana nelakho.
