Repository: Ari-Ramkilowan/po-files
Catalog: translations/SGroup7(Release (open))_Xhosa.po
Languages: xho

source: Read the notes
xho: Funda amanqaku

source: See what you need
xho: Bona okudingayo

source: See how it works
xho: Jonga ukuba isebenza njani

source: Back to menu
xho: Buyela kwimenyu

source: The lion is the king of the jungle, let’s see what the kids know about it: Level 1 • What sound does a lion make? • Where do they live? • What do they eat? • What should you do if you see a lion? Level 2 • What kind of animals are they? (Cats and mammals) • What do they look like? • How big are they? • What colour are they? Level 3 • What else can you tell me about lions? • What other animals live near lions? • Let’s talk about those – what do you know about elephants, or rhinos? • What sound does the word ‘lion’ start with? • What sound does the word ‘rhino’ start with? • What sound does the word ‘elephant’ start with?
xho: Ingonyama yinkosi yasendle, masibone ukuba abantwana babona ntoni ngayo: Umgangatho 1 • Ingaba ingonyama yenza esiphi isandi? • Zihlala phi? • Zitya ntoni? • Yintoni onokuyenza xa ubona ingonyama? Umgangatho 2 •Ingaba zuluhlobo luni lezilwanyana? (Amakati kunye neemamali) • Zithanda ntoni? • Bangakanani na? • Nguwuphi umbala? Umgangatho 3 • Yintoni enye ongayandixelela ngeengonyama? • Ziziphi ezinye izilwanyana ezihlala kufuphi neengonyama? • Masithethe ngalabo - uyazi ntoni ngeendlovu, okanye iirhin? • Yisiphi isandi igama elithi "ingonyama" eqala ngalo? • Sesiphi isandi igama elithi 'ibhino' eqala ngalo? • Sesiphi isandi igama elithi "ingonyama" eliqala ngalo?

source: This game develops:
xho: Lo mdlalo uphuhlisa:

source: Have you made any Little Lions yet? 🦁
xho: Ingaba Zikhona iiNgonyama eziNcinci osele uzenzile? 🦁

source: ✔️Walking & Moving ✔️Arm & Hand control
xho: ✔️Ukuhamba nokushukuma ✔️Ulawulo lwengalo kunye nesandla

source: If you have time, get the children cut these things out themselves: ✂ - 1 paper per child for the lion’s face - 2 black eyes per child cut out of paper - 1 nose per child cut out of paper - 2 ears per child cut out of paper - 1 plastic / onion bag per child
xho: Ukuba unexesha, fumana abantwana bazisike ngokwabo ezi zinto: ✂ 1. 1 iphepha ngalinye ngomntwana ngobuso beengonyama 2. 2 amehlo omnyama ngamnye ngomntwana anqunywe ephepheni 3. Iipumlo 1 ngomntwana uthathe iphepha 4. Iindlebe ezi-2 ngomntwana zinqunywe ephepheni 5. 1 iplastiki / ibeki yetswele umntwana ngamnya

source: You can use this activity as an opportunity to teach children about animals. 1.Talk about lions before you make the lion face. 2.Ask each child to cut out a circle to make the lions face. 3.They can colour in the face of the lion and stick on eyes, nose and ears. 4.Get them to cut strips of plastic or onion bag for the mane of the lion. 5.Stick on the strips. 6.If you have string, you could make holes in the eyes and turn the lion face into a mask. 7.Get children to crawl around and roar like lions.
xho: Ungawusebenzisa lo msebenzi njengethuba ukufundisa abantwana ngezilwanyana. 1. Thetha ngeengonyama ngaphambi kokuba ubhekene neengonyama. 2. Buza ngamnye umntwana ukuba anqumle isangqa ukwenza iingonyama zijongane. 3. Bangakwazi ukubala imibala ebusweni bengonyama baze banamathe amehlo, impumlo kunye neendlebe. 4. Yibanike ukusika imiqhekeza yeplastiki okanye i-onion isikhwama se-mane yengonyama. 5. Yibambelele kwimida. 6. Ukuba unomtya, unokwenza imingxuma emehlweni uze uphendule ingonyama ibe yimaski. 7.Yenza abantwana baqhawule baze bhonga njengeengonyama.
