Repository: Ari-Ramkilowan/po-files
Catalog: translations/SGroup6(Release (open))_Swati.po
Languages: ssw

source: Read the notes
ssw: Fundza emanotsi

source: See what you need
ssw: Buka kutsi yini loyidzingako

source: See how it works
ssw: Buka kutsi isebenta njani

source: Back to menu
ssw: Buyela emuva kumenyu

source: Find the budding scientists and engineers in the class with the game Making Tunnels. 👩🏿‍🔬👨🏿‍🔬
ssw: Tfola bososayensi nabonjiniyela bakusasa lapha eklasini ngekusebentisa lemihume yalomdlalo. 👩🏿‍🔬👨🏿‍🔬

source: First you have to make the tunnel, then you show the children how it works. 🚇 1. Give each child 2 or 3 toilet rolls. 2. Help them to stick their toilet rolls together to make a long tunnel. 3. They can decorate their tunnel with paper and crayons if they want to. 4. Ask one of the children to hold the tunnel up straight. 5. Place a little bowl at the bottom of the tunnel to catch the stones. 6. Give other children stones and get them to ‘post’ the stones into the top of the tunnel. Use words like ‘up, down, through, top, bottom’ etc. 7. Allow older children to make more complex tunnels if they want to.
ssw: Kufanele ucale ngekwenta umhume, bese ukhombisa bantfwana kutsi kusebenta njani. 🚇 1. Nika umntfwana ngamunye tikopokopo temathishu ti-2 noma 3. 2. Basite kutsi banamatsisele ndzawonye letikopokopo temathishu kute bente umhume lomudze. 3. Bangahlobisa lomhume wabo ngemaphepha noma ngemakhrayoni uma ngabe batsandza. 4. Cela munye walabantfwana kutsi abambe lomhume ucondze tfwi. 5. Bopha thayinyana ekugcineni kwalomhume kute kutsi kubambeke lamatje. 6. Niketa labanye bantfwana ematje bese utsi ‘abawafake’ ngetulu kwalomhume. Sebentisa emagama lafana nabo ‘ngetulu, phansi, faka ekhatsi, ngetulu, ngaphansi’ njll. 7. Vumela bantfwana labasebancane kutsi bakhe imihume lelukhuni uma ngabe batsandza.

source: ✔️Exploring & Finding Out ✔️Arm & hand control
ssw: ✔️Kulandzelela nekutfola lokufanele ✔️Kulawula umkhono nesandla

source: Because you’re teaching kids about gravity, it’s a good idea to ask them lots of questions about how they think it works. ⚗ Easiest version • How tall is our tunnel? • How many toilet rolls have we used? More advanced version • What will happen to this stone? • Where will it land? • Whose turn is it now? For older children • Do it 10 times • How many times did it land in the bowl? • How many times did it NOT land in the bowl? • Tell me about your decoration.
ssw: Ngoba ufundzisa bantfwana ngekwehla kwetintfo letisindzako, kubalulekile kubabuta imibuto leminyenti ngekutsi bacabanga kutsi isebenta njani. ⚗ Lizinga1 • Lomhume mudze kangakanani? • Usebentise tikopokopo temathishu letingaki? Lizinga2 • Kutawentekani kulelitja? • Litawuwela kuphi? • Ngabe nyalo sekusikhatsi sabani? Lizinga3 • Kwente emahlandla lali-10 • Mangaki emahlandla leliwele kulo kulesitja? • Mangaki emahlandla lelingakaweli kulo kulesitja? • Ngitjele ngekuhlobisa.

source: This game develops:
ssw: Lomdlalo utfutfukisa:

source: This game is a fun way to combine crafts with learning, and let’s kids make their own toys. 1. Empty toilet rolls (2 per child) 2. Sticky tape 3. Stones 4. Paper (optional) 5. Crayons (optional)
ssw: Lomdlalo uyindlela lemnandzi yekuhlanganisa buciko ngekufundza, isite bantfwana kutsi batakhele emathoyisi abo. Utawudzinga: 1. Tikopokopo temathishu (timbili umntfwana ngamunye) 2. Isalothephu lebambako 3. Ematje 4. Liphepha (uma likhona) 5. Emakrayoni (uma likhona)
