Repository: Ari-Ramkilowan/po-files
Catalog: translations/SGroup4(Release (open))_Xhosa.po
Languages: xho

source: See how it works
xho: Jonga ukuba isebenza njani

source: See what you need
xho: Bona okudingayo

source: Read the notes
xho: Funda amanqaku

source: Back to menu
xho: Buyela kwimenyu

source: It’s time to decorate your classroom by Making Flowers. 🌸
xho: Lixesha lokuhombisa igumbi lenu lokufundela Ngokwenza Iintyatyambo. 🌸

source: This game doesn’t just let the the kids be creative byn painting, but also teaches them to be creative in how they make their brushes. 1. A piece of paper per child 2. 1 peg per child 3. 1 small piece of sponge per child 4. Paint 5. Crayons
xho: Lo mdlalo awuvumeli umntwna qha abenobugcisa ngokupeyinta, kwaye isose ibafundse ukubanobugcisa ekwenzeni iibrashi zabo. Baz kudinga: 1. Icandelo lephepha ngomntwana 2. 1 isikhonkwane ngomntwana 3. 1 encinci yesiponsi ngomntwana 4. Peyinta 5. Iikhrayoni

source: This is the fun part. 😃 1. Tell the children they are going to make flowers. 2. Tell them to draw a few circles on their page. Circles are the centre of the flower. They can also draw stems. 3. Help children to peg the small piece of sponge (making a paintbrush). 4. Ask them to dip the sponges in paint and make petals around the circles. 5. Encourage the older children to add other things to their paintings like the sun, grass or butterflies. 6. Allow pictures to dry then hang them around your room. 7. Extend learning while you work by asking questions.
xho: Le yeyona ndawo emnandi. 😃 1. Xelela abantwana abaya kwenza iintyatyambo. 2. Baxelele ukuba badwebe imijikelezo embalwa kwiphepha labo. Iingqimba ziphakathi kwentyatyambo. Bangakwazi ukuzoba isisekelo. 3. Ncedisa abantwana batyebe isiqwengwana sincinci (ukwenza ibrashi yepeyinti). 4. Buza ukuba badibanise iipongipi kwipende kunye nokwenza iipalali ezijikelezayo. 5. Khuthaza abantwana abadala ukuba bangeze ezinye izinto kwimifanekiso yazo njengelanga, ingca okanye iifabhethi. 6. Vumela imifanekiso ukuba yomile uze uwaxhomeke egumbini lakho. 7. Ukwandisa ukufunda ngelixa usebenza ngokubuza imibuzo.

source: Make sure you talk to the kids about what they’re drawing and painting and help them if they get stuck. You can ask them some of these questions: • How many flowers will you make? • What colours will your petals be? • Is your flower tall or short? • Where does it grow? • What do flowers need to grow? • What else can you tell me about your flowers?
xho: Qinisekisa ukuba uthetha nabantwana malunga nokudweba kunye nokudweba, kwaye uncede xa bebanamathela. Ungababuza enye yemibuzo: • Zingaphi iintyatyambo ongazenza? • Ziyiphi imibala eya kuba ziifalesi zakho? • Ingaba intyatyambo yakho iyinde okanye imfutshane? • Ikhula phi? • Ziziphi iintyatyambo ezifuna ukukhula? • Yintoni enye ongayandixelela ngeentyatyambo zakho?

source: This game develops:
xho: Lo mdlalo uphuhlisa:

source: ✔️Arm & Hand Control ✔️Talking & Understanding
xho: ✔️Ulawulo lwengalo kunye nesandla ✔️Ukuthetha kunye nokuqonda
