Repository: Ari-Ramkilowan/po-files
Catalog: translations/SGroup9(Release (open))_Southern Sotho.po
Languages: sot

source: Use this activity as a bigger learning opportunity by asking the children some fun questions. Level 1 • Who likes blowing bubbles? • What do we normally use dishwashing soap for? • What colours do we have here? Level 2 • What does this pattern look like? • What shapes can you see? • What colours have you made? • How many bubbles can you see here? Level 3 • Let’s mix some colours. • Now what colours do you have? • What does blue and yellow make? (green) • What does red and yellow make? (orange) • What does blue and red make? (purple) • What sound does blue start with? (ba) • What sound does red start with? (rrrrrr) • What sound does yellow start with? (ya) • What sound does green start with? (ga) • What sound does orange start with? (o) • What sound does purple start with? (pa)
sot: Sebedisa ketsahalo ena jwaloka monyetla o moholo wa ho ithuta ka ho botsa bana dipotso tsa boithabiso. Mohato wa 1 • Ke mangy a ratang ho butswela dipudulana? • Hangata re sebedisa sesepa sa ho hlatswa dijana bakeng sa eng? • Re na le mebala efe mo? Mohato wa 2 • Paterone ee e shebahala jwaloka eng? • Ke dibopeho dife tseo o di bonang? • Ke mebala efe eo o e entseng? • Ke dipudulana tse kae tseo o di bonang mo? Mohato wa 3 • Ha re tswakeng mebala e itseng. • Jwale o se o ena le mebala efe? • Mmala o bolou le o mosehla e etsa mmala ofe? (o motala) • Mmala o mofubedu le o mosehla e etsa ofe? (wa lamunu) • Mmala o bolou le o mofubedu e etsa ofe? (Perese) • Bolou e qala ka modumo ofe? (b) • Fubedu e qala ka modumo ofe? (fffff) • Tshehla e qala ka modumo ofe? (Tsh) • Tala e qala ka modumo ofe?(ta) • Lamunu e qala ka modumo ofe? (l) • Perese e qala ka modumo ofe? (pe)

source: Read the notes
sot: Bala dinoutso

source: See what you need
sot: Sheba seo o se hlokang

source: See how it works
sot: Bona hore e sebetsa jwang

source: Back to menu
sot: Kgutlela ho menu

source: Have the children tried Painting with Bubbles yet? 🎨
sot: Na bana ba se ba lekile ho Penta ka Dipudulana? 🎨

source: This game develops:
sot: Papadi ena e ntshetsa pele:

source: ✔️Exploring & Finding Out ✔️Early Reading & Writing
sot: ✔️Ho sibolla le ho fumana dikarabo ✔️Ho bala le ho ngola ho tloha bonyaneng

source: It’s really simple. All you need is: 1. Paint 2. Dishwashing liquid 3. Straws 4. Paper
sot: Ho bonolo. Seo o se hlokang feela ke: 1. Pente 2. Sesepa sa ho hlatswa dijana 3. Distroye 4. Pampiri

source: Read the note
sot: Bala dinoutso

source: This activity breathes new life into having fun with paint. No paintbrushes required! 🖌 1. Mix some paint with some dishwashing liquid in a cup. 2. Add a little bit of water to the mixture. 3. Give each child a straw and some paper, and ask them to share the paint. 4. Ask them to blow (not suck) through the straw into the cup. This will make bubbles. 5. Then ask the children to hold the paper over the cup and bubbles and press down gently. 6. The bubbles will leave a bubble pattern on the paper. 7. The children can repeat this with other colours and then leave their art to dry.
sot: Ketsahalo ena e tlisa bophelo bo botjha ka ho natefelwa ke ho penta. Ha ho diborosolo tsa ho penta tse hlokehang! 🖌 1. Tswaka pente le mokedikedi wa ho hlatswa dijana ka hara kopi. 2. Tshela metsi a manyane motswakong oo. 3. Efa ngwana ka mong setroye le pampiri, mme o re ho bona ba abelane ka pente. 4. Ere ba butswele (ba se ke ba hula) ka setroye ka hara kopi. Sena se tla baka dipudulana. 5. Jwale kopa bana ho bea pampiri ka hodima kopi le dipudulana mme ba hatelle ha bobebe. 6. Dipudulana di tla siya paterone ya dipudulana pampiring. 7. Bana ba ka pheta sena ka mebala e meng mme ba tlohele bonono ba bona hore boo me.
