Repository: Ari-Ramkilowan/po-files
Catalog: translations/SGroup14(Release (open))_Zulu.po
Languages: zul

source: Read the notes
zul: Funda amanothi

source: See what you need
zul: Bheka ukuthi yini oyidingayo

source: See how it works
zul: Bheka ukuthi kusebenza kanjani

source: Back to menu
zul: Buyela kumenyu

source: While their creative juices are flowing, get their brains going by asking them some questions. Level 1 • What colour is this? • What shape is this • How many colours can you see? • Where will you stick this? Level 2 • How many pieces do you have? • What pattern is this? Level 3 • How will you use these pieces to make a picture? • What is your picture? • Can you tell me about it? • Can you make your name?
zul: Ngenkathi ubuciko buvuleleka, qaqa ubuchopho bazo ngokubabuza imibuzo ethile. Izinga 1 • Yimuphi lo mbala? • Yimuphi lo mumo • Mingaki imibala oyibonayo? • Uzokufaka kuphi lokhu? Izinga 2 • Zingaki izingcezu onazo? • Iyiphi le phethini? Izinga 3 • Uzozisebenzisa kanjani lezi zicucu ukwenza isithombe? • Siyini isithombe sakho? • Ungangixoxela ngaso? • Ungalenza igama lakho?

source: ✔️Arm & Hand Control ✔️Numbers , Shapes & Sizes
zul: ✔️Amakhono okulawula izingalo nezandla ✔️Izinombolo, imimo nosayizi

source: Now it’s time to turn trash into treasure. 1. Make sure the chip packets are clean. 2. Ask the kids to share the chip packets between themselves. 3. Then ask them to cut or tear up chip packets into small pieces or shapes. 4. Get them to stick these pieces of chip packet onto the paper. 5. Encourage creativity as they make their pictures. 6. Talk about shapes, sizes, colour, texture, patterns, etc. 7. Help them to cut and stick as is needed. 8. Older children can even make spell their names out with the pieces.
zul: Manje yisikhathi sokushintsha udoti ube umcebo. 1. Qinisekisa ukuthi amaphakethe ama-chip ahlanzekile. 2. Cela izingane ukuthi zabelane ngamaphakethe ama-chip. 3. Bese uzicela ukuba zisike noma zidabule amaphakethe ama-chip abe yizicucu ezincane noma imimo. 4. Zitshele zinamathelise kulezi ephepheni. 5. Khuthaza ubuciko njengoba zenza izithombe zazo. 6. Khuluma ngemimo, osayizi, umbala, isimo sokuklaya, amaphethini, njll. 7. Zisize ukuba zisike zinamathisele njengoba kudingeka. 8. Izingane ezindadlana zingaphinde zipele amagama azo ngezicucu.

source: Use Chip Packet Fun to teach the kids about not only making art, but recycling too.🥔
zul: Sebenzisa i-Chip Packet Fun ukuze ufundise izingane hhayi nje mayelana nokwnza ubuciko bezandla, kodwa nokusetshenziswa kwezinto ngokuphindelela.🥔

source: If there’s litter in the area, why not get the kids to collect it and throw it away while they look for chip packets? This is what you’ll for this game: • A clean chip packet per child • Piece of paper per child • Glue and scissors
zul: Uma kunodoti endaweni, kungani ungatsheli izingane ziwucoshe bese ziwulahla ngenkathi zifuna amaphakethe ama-chip? Nakho ozokudingela lo mdlalo: • Iphakethe elihlanzekile lama-chip ingane ngayinye • Ucezu lwephepha ingane ngayinye • I-glue • Isikele

source: This game develops:
zul: Lo mdlalo uthuthukisa:
