Repository: Ari-Ramkilowan/po-files
Catalog: translations/SGroup9(Release (open))_Pedi; Sepedi;  Northern Sotho.po
Languages: nso

source: Use this activity as a bigger learning opportunity by asking the children some fun questions. Level 1 • Who likes blowing bubbles? • What do we normally use dishwashing soap for? • What colours do we have here? Level 2 • What does this pattern look like? • What shapes can you see? • What colours have you made? • How many bubbles can you see here? Level 3 • Let’s mix some colours. • Now what colours do you have? • What does blue and yellow make? (green) • What does red and yellow make? (orange) • What does blue and red make? (purple) • What sound does blue start with? (ba) • What sound does red start with? (rrrrrr) • What sound does yellow start with? (ya) • What sound does green start with? (ga) • What sound does orange start with? (o) • What sound does purple start with? (pa)
nso: Šomiša mošomo wo bjalo ka sebaka se segolo sa go ithuta ka go botšiša bana tše dingwe tša dipotšišo tša boipshino. Kgato ya 1 • Ke mang yo a ratago go budulela maphilo? • Naa sešepe sa go hlatswa dibjana se šomišwa eng gantši? • Naa re na le mebala ya mohuta mang mo? Kgato ya 2 • Naa phethene ye e swana le eng? • Naa o bona dibopego dife? • Naa o dirile mebala ya mohuta mang? • Naa ke maphilo a makae ao o a bonago? Kgato ya 3 • A re tswake mebala ya mengwe. • Gabjale o na le mebala ya mohuta ofe? • Naa mmala o motalalerata le o serolane di bopa eng? (motalamorago) • Naa mmala o mohwibidu le o serolane di bopa eng? (serolane) • Naa mmala o motalalerata le o mohwibidu di bopa eng? (phepolo) • Naa mmala o motalalerata o thoma ka modumo ofe? (ta) • Naa mmala o mohwibidu o thoma ka modumo ofe? (hwi) • Naa mmala o serolane o thoma ka modumo ofe? (se) • Naa mmala o motalamorogo o thoma ka modumo ofe? (ta) • Naa mmala o serolane o thoma ka modumo ofe? (se) • Naa mmala o phepole o thoma ka modumo ofe? (phe)

source: Read the notes
nso: Bala dinoutse

source: See what you need
nso: Bona se o se hlokago

source: See how it works
nso: Bona ka moo e šomago ka gona

source: Back to menu
nso: Re boela morago go menyu

source: Have the children tried Painting with Bubbles yet? 🎨
nso: Naa bana ba šetše ba lekile papadi ya Go penta ka Maphilo? 🎨

source: This game develops:
nso: Papadi ye e kaonafatša:

source: ✔️Exploring & Finding Out ✔️Early Reading & Writing
nso: ✔️Go nyankolla le go utolla ✔️Go ithuta go bala le go ngwala bonnyaneng

source: It’s really simple. All you need is: 1. Paint 2. Dishwashing liquid 3. Straws 4. Paper
nso: E tloga e le bonolo. Tšeo o di hlokago ke: 1. Pente 2. Sešepe sa go hlatswa dibjana 3. Mahlaka 4. Pampiri

source: Read the note
nso: Bala dinoutse

source: This activity breathes new life into having fun with paint. No paintbrushes required! 🖌 1. Mix some paint with some dishwashing liquid in a cup. 2. Add a little bit of water to the mixture. 3. Give each child a straw and some paper, and ask them to share the paint. 4. Ask them to blow (not suck) through the straw into the cup. This will make bubbles. 5. Then ask the children to hold the paper over the cup and bubbles and press down gently. 6. The bubbles will leave a bubble pattern on the paper. 7. The children can repeat this with other colours and then leave their art to dry.
nso: Mošomo wo o tliša bophelo bjo boswa ka go ipshina ka pente. Ga go nyakege diporaše tša go penta! 🖌 1. Hlakanya pente le sešepe sa go hlatswa dibjana ka komiking. 2. Tšhela meetse a mannyane ka motswakong. 3. Efa ngwana yo mongwe le yo mongwe lehlaka le pampiri, gomme o ba kgopele go abelana ka pente. 4. Ba kgopele go budulela (e sego go goga) ka komiking ka lehlaka. Se se tla hlola maphilo. 5. Morago ga moo kgopela bana go swara pampiri godimo ga komiki le maphilo gomme ba e pitlele fase gannyane. 6. Maphilo a tla tlogela phethene ya maphilo godimo ga pampiri. 7. Bana ba ka bušeletša se ka mebala ye mengwe gomme ba tlogela bokgabo bja bona gore bo ome.
