Repository: Ari-Ramkilowan/po-files
Catalog: translations/SGroup17(Release (open))_Venda.po
Languages: ven

source: See what you need
ven: Zwine vha ṱoḓa

source: See how it works
ven: Zwi shumisa hani

source: Read the notes
ven: Kha vha vhale notsi kha menyu

source: Back to menu
ven: Kha vha humele murahu kha zwirengomu

source: This game develops:
ven: Mutambo uyu u bveledza:

source: Here’s what you’ll need to keep the kids busy: 1. A pre-drawn picture of a dinosaur for each child. 2. Squares about the size of a stamp in 2 or 3 different colours. 3. Glue. 4. Scissors.
ven: Izwi ndi zwine vha ṱoḓa uri vhana vha dzule vha tshi khou shuma: 1. Tshifanyiso tsho dzulaho tsho oliwa tsha dinosaur tsha ṅwana muṅwe na muṅwe 2. Tshikwea tshi linganaho na saizi ya tshiṱemmbe nga mivhala mivhili (2) kana miraru (3) 3. Guḽuu 4. Zwigero

source: We started from the ground up by making dinosaur footprints in the last activity, so how about we move on to Making Dinosaurs? 🦕
ven: Ro thoma fhasi u ita ṋayo dza dinosaur kha mushumo wo fhiraho, zwi nga vha hani arali ra bvela phanḓa na U ola Dinosaur? 🦕

source: ✔️Numbers , Shapes & Sizes ✔️Skills for Learning
ven: ✔️ Nomboro, zwivhumbeo na saizi ✔️Vhukoni ha u guda

source: Keep the kids wide awake by encouraging them to make dinosaur noises while they work. 🦖🦕 1. Give each child a picture of a dinosaur. 2. Cut out the colourful squares for younger children. 3. Let older children cut their own little squares. 4. Sort the little squares into piles depending on their colour. 5. Show the children how to stick the squares onto their dinosaurs. 6. Help the younger ones while encouraging the older ones. 7. Help them make a pattern using colours (red, blue, red, blue, red, etc).
ven: Kha vha ite uri vhana vha si eḓele nga u vha ṱuṱuwedza u lila sa dinosaur musi vha tshi khou shuma. 🦖🦕 1. Kha vha ṋee ṅwana muṅwe na muṅwe tshifanyiso tsha dinosaur. 2. Kha vha gere zwikwea zwa mivhalavhala zwa vhana vhaṱuku. 3. Kha vha litshe vhana vhahulwane vha ḓigerele zwikwea zwavho zwiṱuku. 4. Kha vha vheekanye zwikwea zwiṱuku vho tou zwikuvhanganya zwi tshi ya nga mivhala. 5. Kha vha sumbedze vhana uri vha nambatedzisa hani zwikwea kha dinosaur dzavho. 6. Kha vha thuse vhana vhaṱuku ngeno vha tshi khou ṱuṱuwedza vhahulwane. 7. Kha vha vha thuse u ita phetheni nga u shumisa mivhala (mutswuku, lutombo, mutswuku, lutombo u ya ngauralo).

source: Not sure what to ask the children next? Here are some ideas: Level 1 • What does this dinosaur need? • Where will these spikes go? • How many do you need? • What colours will you choose? Level 2 • What pattern will you make? • Which one shall we start with? • When did dinosaurs live? (The answer can be something like: a long, long time ago). • Are there still dinosaurs on earth? (Answer: no, they have all died). • What do they eat? (Answer: some eat plants, some eat other animals). Level 3 • What sound does dinosaur start with? (da) • What else starts with ‘da’? • Do you know the names of different types of dinosaurs? (Answer: T. rex, brontosaurus, triceratops).
ven: A vha na vhuṱanzi kha zwine vha nga bvela phanḓa na u vhudzisa vhana? Miṅwe mihumbulo a siyi: Ḽiga 1 • Dinosaur i ṱoda mini? • Mipfa iyi i ḓo dzhena ngafhi? • Ni khou ṱoḓa mingana? • Ni ḓo nanga mivhala ifhio? Ḽiga 2 • Ni ḓo ita phetheni ifhio? • Ri ḓo thoma nga ifhio? • Dinosaur dzo vha hone lini? (Phindulo i nga vha: kalekale). • Hu tshe na dinosaur afha ḽifhasini? (Phindulo: hai, dzo fa dzoṱhe nahone a dzi tsha wanala). • Dzi ḽa mini? (Phindulo: dziṅwe dzi ḽa zwimela: dziṅwe dzi ḽa ṋama dziṅwe dzi ḽa zwipuka). Ḽiga 3 • Dinosaur i thoma nga mubvumo ufhio? (da) • Ndi mini tshiṅwe tshine tsha thoma nga ‘da’? • Ni a ḓivha madzina a tshakha dzo fhambanaho dza dinosaur? (Phindulo: T. rex, brontosaurus, triceratops).
