Repository: Ari-Ramkilowan/po-files
Catalog: translations/SGroup10(Release (open))_Southern Sotho.po
Languages: sot

source: If the children haven’t tried Pass the Cube yet, now could be the perfect time! ⏰
sot: Haeba bana ba eso ka ba leka Fetisa Tjhubu(Pass the Cube), jwale e ka ba nako e loketseng! ⏰

source: Read the notes
sot: Bala dinoutso

source: Back to menu
sot: Kgutlela ho menu

source: See what you need
sot: Sheba seo o se hlokang

source: See how it works
sot: Bona hore e sebetsa jwang

source: This game develops:
sot: Papadi ena e ntshetsa pele:

source: ✔️Walking & Moving ✔️Arm & Hand Control
sot: ✔️Ho tsamaya le ho sisinyeha ✔️Taolo ya sephaka le letsoho

source: There’s only one item on the list! You’ll need: 1. LEGO blocks
sot: Ho na le ntho e le nngwe feela lenaneng! O tla hloka: 1. Diboloko tsa LEGO

source: Take the learning to the next level by getting the children to multitask and asking them some questions: Level 1 • What are all the ways we can pass the cube? • Who has any other ideas on how we could pass the cube? (Eg, through their legs, under their arms, they could skip a person, etc.) Level 2 Here’s an example of rhyme you could sing: This is the way we pass the cube Through our legs, through our legs This is the way we pass the cube On a sunny Monday morning… Level 3 • Ask the older children to come up with ideas as to how to pass the cube next. (Eg, over their head, with a sound, with a jump, etc.)
sot: Fetisetsa ho ithuta mohatong o latelang ka ho etsa hore bana ba etse diketso tse mengata ka nako e le nngwe mme o ba botse dipotso: Mohato wa 1 • Ke ditsela dife tsohle tseo re ka neheletsanang ka tjhubu ka tsona? • Ke mang ya ka tlang ka ditsela tse ding tseo re ka neheletsanang ka tjhubu ka tsona? (Mohlala, ka tlasa menoto, ka tlasa diphaka, ba ka nna ba tlodisa motho a le mong, jj.) Mohato wa 2 Mohlala wa raeme eo le ka e binang ke ena: Re neheletsana tjhubu tjena Ka tlasa maoto, ka tlasa maoto a rona Re neheletsana tjhubu tjena Ka Mantaha hosing ho tjhesa… Mohato wa 3 • Kopa bana ba baholwanyane ho fana ka mehopolo ya kamoo ho ka neheletsanwang ka tjhubu e latelang ka teng. (mohlala, ka hodima dihlooho tsa bona, ka modumo o itseng, ba tlola, jj.)

source: Take this chance to teach the children about teamwork. 1. Together, use six blocks of Duplo LEGO to build a cube. It should be the right size for children to hold in one hand. 2. Get the children to sit in a circle or stand in a line, and pass it from one to another. 3. Tell them to change direction and pass the cube the other way. 4. Ask them to pass it with one hand. 5. You can then ask them to pass it with the other hand. 6. Ask the children to pass the cube with their eyes closed. 7. They can then pass it over their heads. 8. You can also sing a little rhyme to go with your actions.
sot: Nka monyetla ona ho ruta bana mabapi le ho sebetsa ka dihlopha. 1. Mmoho, sebedisang diboloko tse tsheletseng tsa DUPLO LEGO ho aha tjhupu. E lokela ho ba boholo bo lekaneng hore bana ba kgone ho e tshwara ka letsoho le le leng. 2. Ere bana ba dule ka sedikadikwe kapa ba eme ka mola, mme ba nne ba e neheletsane. 3. Ere ba fetole tsela ka ho neheletsana tjhubu e kgutlela morao. 4. Ere ba e neheletsane ka letsoho le le leng. 5. Jwale o ka ba kopa hore ba neheletsane ka yona ba sebedisa letsoho le leng. 6. Kopa bana ho neheletsana tjhubu ba tutubetse. 7. Jwale ba ka nna ba e neheletsana ka hodima dihlooho tsa bona. 8. Hape le ka nna la bina raemenyana e tsamaisanang le diketso tsa lona.
