Repository: Ari-Ramkilowan/po-files
Catalog: translations/SGroup18(Release (open))_Xhosa.po
Languages: xho

source: Need some inspiration? Keep the game going with questions like these: Level 1 • Look around and choose an item that everyone can see. • Don’t tell the others what it is. • Then say “I spy with my little eye, something that is green.” • Let the children guess what it is by calling out all the green things they see. • Try not to make it too difficult. Level 2 • Then say “I spy with my little eye, something beginning with ‘w’.” • Use the sound “w”, not the letter. • Let the kids guess the item. • Give each child a turn to take a guess. Level 3 • Then say “I spy with my little eye, something beginning with ‘ch’.” • Use the sound “ch”, not the letter. • Let the kids guess the item. • Give each child a turn to take a guess.
xho: Ingaba udinga ukukhuthazwa? Qhuba umdlalo eqhubeka kanje: Umgangatho 1 • Jonga ngapha kwaye ukhethe into umntu ayibonayo. • Musa ukuxelela abanye ukuba yintoni. • Bese uthi "Ndiya kuhlola iliso lam elincinane, into eluhlaza." • Vumela abantwana baqikelele oko kukubiza zonke izinto eziluhlaza abazibonayo. • Zama ukungabi nzima. Umgangatho 2 • Bese uthi "Ndiya kuhlola iliso lam elincinane, into eqala nge 'w'." • Sebenzisa i-isandi u "w", kungekhona le leta. • Vumela abantwana bayiqikelele lonto. • Nika umntwana ngamnye ithuba lokuqikelela Umgangatho 3 • Emva koko uthi "Ndiyifake iliso lam elincinane, into eqala nge 'ch'." • Sebenzisa i-isandi u "ch", hayi igama. • Vumela abantwana bayiqikelele lonto. • Nika umntwana ngamnye ithuba lokuqikelela

source: We’re taking I Spy to the next level with some eye glasses. Here’s what you’ll need 👓: • 2 used toilet rolls per child. • String. • Scissors. • 2 sticks per child. • Cellotape.
xho: Sithatha uNdiyaNgcothoza kumgangatho olandelayo ngezispeks zamehlo. Naku oza kudinga 👓: • Iiroli zetholeyithi pheyipha zibe 2 umntwana ngamnye • Intambo • Izikere • Amaswazi ama2 umntwana ngamnye • Iteyiphi encamatiselayo

source: Read the notes
xho: Funda amanqaku

source: Back to menu
xho: Buyela kwimenyu

source: You’ll be showing these cool kids how to make a pair of glasses.😎 1. Cut the toilet roll into 2 rings and tie them together to make glasses 2. Attach the sticks to the sides of the glasses to make the ‘arms’ of the glasses. 3. Support the younger kids. 4. Encourage the older ones to this on their own. 5. Ask the children to put their glasses on and talk about what glasses do. 6. Play I Spy: Find something in the room that everyone can see, for example, a table. 7. Say: “I Spy with my little eye, something beginning with ‘t’ (sound)” 8. Let each child have a turn guessing. 9. Walk around the room and tell them what you see through your glasses. 10. Get them to walk with you, glasses on!
xho: Ubonisa aba bantwana abalungileyo ukuba zenziwa njani ipere zespekhsi.😎 1. Sika indlu yangasese ibe ngamacangci amabili uze uwabophe ndawonye ukuze wenze iiglasi. 2. Namathisela iintonga kumacala eglasi ukuze wenze 'iingalo' zeglasi. 3. Ukuxhasa abantwana abancinci. 4. Khuthaza abantu abadala ukuba benze oku ngokwabo. 5. Buza abantwana ukuba babeke iiglasi zabo baze bathethe ngeentlobo zeziglasi. 6. Dlala u I-Spy: Fumana into egumbini elowo wonke umntu angayibona, umzekelo, itafile. 7. Yithi: "Ndiya kuhlola ngeyeso elincinane, into eqala nge 't' (isandi)" 8. Umntwana ngamnye makabe nokuguqulwa kokujika. 9. Hamba ujikeleze kwigumbi uze ubatshele oko ubona kwiiglasi zakho. 10. Benze bahambe nawe, benzibe iiglasi!

source: See what you need
xho: Bona okudingayo

source: See how it works
xho: Jonga ukuba isebenza njani

source: We put a spin on the classic game, I Spy. 🔍
xho: Sifaka utshintso kumdlalo ophucukile uNdiyaMpimpa. 🔍

source: This game develops:
xho: Lo mdlalo uphuhlisa:

source: ✔️Social ✔️Early Reading & Writing
xho: ✔️Ekuhlaleni ✔️Ukufunda kwangoko kunye nokubhala
