Repository: Ari-Ramkilowan/po-files
Catalog: translations/SGroup3(Release (open))_South Ndebele.po
Languages: nbl

source: On a rainy day, or if you’ve got a very physical Large group activity planned, why not have some Puzzle Fun? 🌧= 🖼
nbl: Imvula nayinako namkha nawuAwamsebenzi ohleliweko wesiqhema esikhulu, kuba yini ningabi ne - Puzzle Fun? 🌧= 🖼

source: You don’t even need to go buy puzzles, all you need is: 1. 3 homemade puzzles made from pictures in magazines (choose pictures that children enjoy). 2. Ensure that there are some easier puzzles for younger children, but not too easy.
nbl: Abe awutlhogi Awakuthi uyokuthenga amaphazili, okutllhogako ngilokhu: 1. Amaphazili wokuzenzela ama – 3, ngokusika iinthoombe eencwadini (Khetha iinthombe ezithandwa bentwana). 2. Qinisekisa ukuthi kunamaphazili alula wabantwana abancane, kodwana angabi lula khulu.

source: Once you have your amazing, custom puzzles you can begin. 1. Choose easier puzzles for young children and give more difficult puzzles to older children. 2. Give each child a piece of a puzzle. 3. Ask them to put their pieces down so that everyone can see. 4. Then give them additional pieces, one by one. 5. Slowly help them arrange the pieces so that they can make the puzzle. 6. Talk about the picture. 7. Repeat with the other puzzles. 8. If you think they are able, mix up the 3 puzzles and see if they can sort them out, and build the 3 separate puzzles.
nbl: Nasele unawo amaphazili wakho amahle wokuzenzela, sowungathoma. 1. Khethela abantwana abancane iphazili elula amaphazili alula kuthi laba abadala ubakhethele abudisinyana. 2. Nikela umntwana ngamunye isiquntu sephazili. 3. Babawe bona bawabeke phasi benzele bona bakwazi ukuwabona kuhle. 4. Banikele iinquntu godu ngamunye ngamunye. 5. Kancani barhelebhe ukuhlela iinquntu zabo bazokwazi ukwenza amaphazili. 6. Khuluma ngesithombe. 7. Phinda godu ngamanye amaphazili. 8. Nawubona ukuthi bayakghona, vanganisa woma – 3 amaphazili ukubona ukuthi bazokwazi ukuwahlukanisa bese bayakha amaphazili angafaniko ama – 3.

source: See what you need
nbl: Bona ukuthi utlhoga ini

source: See how it works
nbl: Bona ukuthi isebenza bunjani

source: Read the notes
nbl: Funda amaAwathi

source: Back to menu
nbl: Asibuyele emva

source: This game develops:
nbl: Umdlalo lo uthuthukisa:

source: ✔️Exploring & Finding out ✔️Skills for Learning
nbl: ✔️Ukuhlola Awakuthola ✔️AmakghoAwa wokufunda

source: And because this game is to help develop the children’s thinking skills, ask some questions along the way. For the easier puzzles: • What do you think this picture is? • Where do you think this piece goes? While putting the puzzle together: • Tell me about this picture? • What can you see? • Is this an edge or a middle piece? If you mix all three puzzles: • What happens if we mix up the puzzles? • Who has this piece?
nbl: Ngombana umdlalo lo wokuthuthukisa ikghonao labantwana lokucabanga, buza imibuzo hlangana nendlela. Amaphazili alula: • Ucabanga bona isithombesi siyini? • Ucabanga bona isiquntesi singena kuphi? Nawuhlanganisa iphazili: • Ungangitjelani ngesithombesi? • Ubona ini? • Ingabe lesi siquntu sasekupheleni namkha ngaphakathi? Nawuvanganisa womathathu amaphazili: • Kwenzakalani nasiwavanganisako amaphazili la? • Ngubani ophethe isiquntwesi?
