Repository: Ari-Ramkilowan/po-files
Catalog: translations/SGroup11(Release (open))_Pedi; Sepedi;  Northern Sotho.po
Languages: nso

source: The little ones might struggle with the higher levels, but these questions are a great way to ease them into basic maths, and an education on money. 💸 Level 1 • What colours have you used? • What shape are the coins? • Which is the biggest coin? • Which is the smallest? • How many coins do we have? • What do we do with money? • Where should we keep our money? Level 2 • Who can show me a R1 coin? • Who can show me a R2 coin? • Who can show me a R5 coin? • How can you make R6? • How can you make R3 etc? • Etc Level 3 • Who can show me a 5 cent coin? • Who can show me a 10 cent coin? • Who can show me a 20 cent coin? • Who can show me a 50 cent coin? • How can you make 20 cents? • How can you make 10 cents? • Etc
nso: Bana ba digotlane ba ka swara bothata ge thutišo e hlatlogela godimo, eupša dipotšišo tše ke tsela ye kaonekaone ya go ba nolofaletša gore ba tsebe motheo wa dipalo, le thuto mabapi le tšhelete. 💸 Kgato ya 1 • Naa o šomišitše mebala ya mohuta mang? • Naa ditšheletetshipi di ka sebopego sefe? • Naa ke efe yeo e lego tšheletetshipi ye kgolokgolo? • Naa ke efe yeo e lego tšheletetshipi ye nnyanenyane? • Naa re na le ditšheletetshipi tše kae? • Naa re dira eng ka tšheletetshipi? • Naa ke kae moo re ka bolokago tšhelete ya rena? Kgato ya 2 • Ke mang yo a ka mpontšhago tšheletetshipi ya R1? • Ke mang yo a ka mpontšhago tšheletetshipi ya R2? • Ke mang yo a ka mpontšhago tšheletetshipi ya R5? • Naa o ka dira bjang R6? • Naa o ka dira bjang R3, bjalobjalo? Kgato ya 3 • Ke mang yo a ka mpontšhago tšheletetshipi ya disente tše 5? • Ke mang yo a ka mpontšhago tšheletetshipi ya disente tše 10? • Ke mang yo a ka mpontšhago tšheletetshipi ya disente tše 20? • Ke mang yo a ka mpontšhago tšheletetshipi ya disente tše 50? • Naa o ka dira bjang disente tše 20? • Naa o ka dira bjang disente tše 10?

source: Engage the children in a conversation about money while they go about this game. 1. Make sure each coin has been washed and is clean. 2. While you talk about money and what it’s used for, give each child a coin. 3. Ask them to look at their coin and tell you what they see. 4. Give them each a crayon and a piece of paper. 5. Show them that if you put the coin under the paper and then rub the crayon over it, you’ll see the picture of a coin. 6. Get them to share their items and explore different coins and colours.
nso: Thomiša ka poledišano mabapi le tšhelete mola bana ba tsene fase ka papadi ye. 1. Kgonthiša gore tšheletetshipi ye nngwe le ye nngwe e hlatswitšwe ebile e hlwekišitšwe. 2. Ge o le gare o bolela ka tšhelete le gore e šomišwa eng, efa ngwana yo mongwe le yo mongwe tšheletetshipi. 3. Ba kgopele gore ba lebelele tšheletetshipi le go go botša gore ba bona eng. 4. Efa yo mongwe le yo mongwe kherayone le karolwana ya pampiri. 5. Ba bontšhe gore ge o phuthela tšheletetshipi ka pampiri gomme wa thala pampiri yeo ka kherayone, o tla bona seswantšho sa tšheletetshipi. 6. Ba laele gore ba abelane ka tšeo ba di thadilego le go nyankolla ka ditšheletetshipi tše di fapafapanego le mebala.

source: Back to menu
nso: Re boela morago go menyu

source: See what you need
nso: Bona se o se hlokago

source: See how it works
nso: Bona ka moo e šomago ka gona

source: Read the notes
nso: Bala dinoutse

source: Remind the kids they’ll need to be very responsible when they’re each given one of the following: 1. A coin 2. A piece of paper 3. A crayon
nso: Gopotša bana gore ba swanetše go rwala maikarabelo a magolo ge yo mongwe le yo mongwe a fiwa e tee ya tše di latelago: 1. Tšheletetshipi 2. Karolwana ya pampiri 3. Kherayone

source: This game develops:
nso: Papadi ye e kaonafatša:

source: It’s never too early to start learning about money with Money Rubs! 💰
nso: Ke nako ya maleba gore bana ba ka thoma go ithuta mabapi le tšhelete ka Ditšhelete tše di Gatišitšwego! 💰

source: ✔️Numbers , shapes & sizes ✔️ Arm & Hand Control
nso: ✔️ Dinomoro, dibopego le bogolo ✔️Taolo ya letsogo le seatla
