Repository: Ari-Ramkilowan/po-files
Catalog: translations/SGroup4(Release (open))_South Ndebele.po
Languages: nbl

source: See how it works
nbl: Bona ukuthi isebenza njani

source: See what you need
nbl: Bona ukuthi utlhoga ini

source: Read the notes
nbl: Funda amaAwathi

source: Back to menu
nbl: Buyela erhelweni

source: It’s time to decorate your classroom by Making Flowers. 🌸
nbl: Sikhathi sokobana ukgabise iklasi lakho ngoKwenza amathuthumbo. 🌸

source: This game doesn’t just let the the kids be creative byn painting, but also teaches them to be creative in how they make their brushes. 1. A piece of paper per child 2. 1 peg per child 3. 1 small piece of sponge per child 4. Paint 5. Crayons
nbl: Umdlalo lo awenzi abantwana bona babe nekghoAwa lokupenda kwaphela, kodwana ubafundisa Awakuthi bakwazi ukuzenzela amabratjhi.. 🔧 Bazakutlhoga: 1. Isiquntu sephepha umntwana munye 2. Ipegsi li – 1 umntwana munye 3. Isiquntwana si – 1 sesipontji umntwana munye 4. Ipende 5. Amakhrayoni

source: This is the fun part. 😃 1. Tell the children they are going to make flowers. 2. Tell them to draw a few circles on their page. Circles are the centre of the flower. They can also draw stems. 3. Help children to peg the small piece of sponge (making a paintbrush). 4. Ask them to dip the sponges in paint and make petals around the circles. 5. Encourage the older children to add other things to their paintings like the sun, grass or butterflies. 6. Allow pictures to dry then hang them around your room. 7. Extend learning while you work by asking questions.
nbl: Ngilokhu okumnandi. 😃 1. Tjela abantwana ukuthi bazokwenza amathuthumbo. 2. Batjele ukuthi badwebe iinyingi ekhasini. Iinyingezo ngizo ingaphakathi lwethuthumbo. Bangadweba godu isiqu sethuthumbo. 3.Basize ukubamaba ispontji esincani ngepegsi (benza ibratjhi yokupenda). 4. Babawe ukuthi bacwilise ispontji ependeni bese benza amaphethalsi mazombe nesiyingi. 5. Gcugcuzela abantwana abadala ukuthi bafake ezinye izinto, njengotshani, ilanga namabhebhelwane. 6. Lisa iinthombe ukuthi zome bese uyazilengisa ngekamurweni. 7. Thuthukisa isifundo ngokubuza imibuzo.

source: Make sure you talk to the kids about what they’re drawing and painting and help them if they get stuck. You can ask them some of these questions: • How many flowers will you make? • What colours will your petals be? • Is your flower tall or short? • Where does it grow? • What do flowers need to grow? • What else can you tell me about your flowers?
nbl: Qinisekisa bona ukhuluma nabantwana ngalokhu abakudwebako neenthombe begodu ubarhelebhe lapho babhalelwa khona. Ungababuza eminye imibuzonjengale: • Uzokwenza amathuthumbo amangaki? • Amaphethalsi wakho azakuba mibala enjani? • Ithuthumbo lakho lide namkha lifitjhane? • Likhulela kuphi? • amatthuthumbo atlhogani nakazakukhula? • Khuyini okhunye eningangitjela khona ngamathuthumbenu?

source: This game develops:
nbl: Umdlalo lo uthuthukisa:

source: ✔️Arm & Hand Control ✔️Talking & Understanding
nbl: ✔️Ukulawula umkhoAwa nesandla ✔️Ukukhuluma Awakuzwisisa
