Repository: Ari-Ramkilowan/po-files
Catalog: translations/SGroup20(Release (open))_Southern Sotho.po
Languages: sot

source: See how it works
sot: Bona hore e sebetsa jwang

source: Animal Pond
sot: If you haven’t already told the children a story today, Animal Pond could be the perfect activity. 🐘🐂🐪

source: Read the notes
sot: Bala dinoutso

source: Back to menu
sot: Kgutlela ho menu

source: See what you need
sot: Sheba seo o se hlokang

source: Let the children build on their brilliant stories by asking them these questions: Level 1 • What animal do you have? • Where does he want to go? • How will you help him? • What will you build? • How will you build it? • How will the animal cross? • Where is he going now? Level 2 • How does your goat feel? • What does he feel that way? • What will make him feel scared? • What will make him feel safe and happy? Level 3 • Tell me the story of your little goat.
sot: Ere bana ba ahelle dipaleng tsa bona tse bohlale ka ho ba botsa dipotso tsena: Mohato wa 1 • O na le phoofolo efe? • E batla ho ya kae? • O tla e thusa jwang? • O tla aha eng? • O tla bo aha jwang? • Phoofotswana eo e tla tshela jwang? • E ya kae jwale? Mohato wa 2 • Podi e ikutlwa jwang? • Hobaneng e ikutlwa jwalo? • Ke eng e ka etsang hore e ikutlwe a tshohile? • Ke eng e ka etsang hore e ikutlwe a bolokehile a thabile? Mohato wa 3 • Mphetele pale ya potsanyane ya hao.

source: This game develops:
sot: Papadi ena e ntshetsa pele:

source: ✔️Skills for Learning ✔️Exploring & Finding Out
sot: ✔️Bokgoni bakeng sa ho ithuta ✔️Ho sibolla le ho fumana dikarabo

source: So many benefits, so few items needed: 1. Duplo LEGO blocks 2. Plastic animals 3. Blue paper 4. Scissors
sot: Melemo e mengata hakaalo, dintho tse mmalwa hakaalo tse hlokehang: 1. Diboloko tsa DUPLO LEGO 2. Diphoofolo tsa polasetiki 3. Pampiri e bolou 4. Dikere

source: How does it work? 1. Cut a circle out of the blue paper and use it as the pond. 2. Tell the story about a little animal who is trying to get across the pond to see its mommy. 3. It can’t swim and it’s too far to walk around the pond. 4. Divide the children into pairs and give them some duplo blocks. 5. Ask them to build a bridge for the little animal. 6. Once they have finished, ask them to show you how their animal crosses the bridge 7. Get them to tell you the story in their own way
sot: E sebetsa jwang? 1. Seha sedikadikwe pampiring e bolou mme o se sebedise jwaloka letangwana. 2. Pheta pale e mabapi le phoofotswana e nyane e lekang ho tshelela ka nqane ho letangwana ho ya bona mma yona. 3. Ha e tsebe ho sesa mme ho hole haholo hore e ka potoloha letangwana. 4. Arola bana ka bobedi ka bobedi mme o ba fe diboloko tsa DUPLO. 5. Ba kope ho aha borogo bakeng sa phoofotswana eo. 6. Hang ha ba qetile, ere ba o bontshe hore phoofotswana ya bona e tshela borogo jwang 7. Ere ba o phetele pale eo ka tsela ya bona.
