Repository: Ari-Ramkilowan/po-files
Catalog: translations/SGroup20(Release (open))_Xhosa.po
Languages: xho

source: See how it works
xho: Jonga ukuba isebenza njani

source: Animal Pond
xho: Ukuba ubungekabaxeleli abantwna ibali namhlanje ibai elingeZilwanyana lingabalungela. 🐘🐂🐪

source: Read the notes
xho: Funda amanqaku

source: Back to menu
xho: Buyela kwimenyu

source: See what you need
xho: Bona okudingayo

source: Let the children build on their brilliant stories by asking them these questions: Level 1 • What animal do you have? • Where does he want to go? • How will you help him? • What will you build? • How will you build it? • How will the animal cross? • Where is he going now? Level 2 • How does your goat feel? • What does he feel that way? • What will make him feel scared? • What will make him feel safe and happy? Level 3 • Tell me the story of your little goat.
xho: Yenza abantwana bake kumabali abo akrelekrele ngokubabuza le mibuzo: Umgangatho 1 • Sesiphi isilwanyana onaso? • Ufuna ukuhamba phi? • Ingaba uya kumnceda njani? • Yintoni oza kuyakha? • Uya kuyakha njani? • Isilwanyana siya kuwela njani? • Uya kuphi na ngoku? Umgangatho 2 • Ingaba ibhokhwe yakho ivakalelwa njani? Kutheni uvakalelwa ngaloo ndlela? • Yintoni eya kumenza azive esoyika? • Yintoni eya kumenza azive ekhuselekile kwaye evuya? Umgangatho 3 Ndixelele ibali lebhokhwe yakho.

source: This game develops:
xho: Lo mdlalo uphuhlisa:

source: ✔️Skills for Learning ✔️Exploring & Finding Out
xho: ✔️Izakhono zokufunda ✔️Ukukhangela nokufumanisa

source: So many benefits, so few items needed: 1. Duplo LEGO blocks 2. Plastic animals 3. Blue paper 4. Scissors
xho: Ukuxhamla okuninzi, kwizinto ezimbalwa ezidingekayo: 1. Izitena zeDUPLO LEGO 2. Izilwanyana zeplastikhi 3. Iphepha eliluhlaza okwesibhakabhaka 4. Izikere

source: How does it work? 1. Cut a circle out of the blue paper and use it as the pond. 2. Tell the story about a little animal who is trying to get across the pond to see its mommy. 3. It can’t swim and it’s too far to walk around the pond. 4. Divide the children into pairs and give them some duplo blocks. 5. Ask them to build a bridge for the little animal. 6. Once they have finished, ask them to show you how their animal crosses the bridge 7. Get them to tell you the story in their own way
xho: Ingaba isebenza njani? 1. Sika isangqa kwiphepha eliluhlaza uze ulisebenzise njengesibi. 2. Xelela ibali ngesilwanyana esincinci esilinga ukuwela ngaphantsi kwidesi ukuze ubone umama wayo. 3. Ayikwazi ukugebha kwaye ide kakhulu ukuhamba ngeenxa zonke. 4. Hlula abantwana ngazibini kwaye ubanike iziten zeDUPLO. 5. Buza ukuba bakhe ibhuloho yesilwanyana esincinane. 6. Xa sele begqibile, bacele ukuba bakubonise indlela iilwanyana zabo eziwela ngayo ibhulorho 7. Bafumane ukuba bakuxelele ibali ngendlela yabo.
