Repository: Ari-Ramkilowan/po-files
Catalog: translations/SGroup4(Release (open))_Venda.po
Languages: ven

source: See how it works
ven: Zwi shumisa hani

source: See what you need
ven: Zwine vha ṱoḓa

source: Read the notes
ven: Kha vha vhale notsi

source: Back to menu
ven: Kha vha humele murahu kha menyu

source: It’s time to decorate your classroom by Making Flowers. 🌸
ven: Ndi tshifhinga tsha u khavhisa kiḽasi yavho nga u ita Maluvha. 🌸

source: This game doesn’t just let the the kids be creative byn painting, but also teaches them to be creative in how they make their brushes. 1. A piece of paper per child 2. 1 peg per child 3. 1 small piece of sponge per child 4. Paint 5. Crayons
ven: Mutambo uyu a u iti uri vhana vha sumbedze vhukoni nga u pennda/ u ola fhedzi, u dovha wa vha funza u vha na vhukoni ha uri vha shumisa hani bulatsho dzavho. 🔧 Vha ḓo ṱoḓa: 1. Tshipiḓa tsha bambiri tsha ṅwana 2. Pekhisi nthihi (1) ya ṅwana 3. Tshipiḓa tshiṱuku tshithihi (1) tsha nwana 4. Pennde 5. Khirayoni

source: This is the fun part. 😃 1. Tell the children they are going to make flowers. 2. Tell them to draw a few circles on their page. Circles are the centre of the flower. They can also draw stems. 3. Help children to peg the small piece of sponge (making a paintbrush). 4. Ask them to dip the sponges in paint and make petals around the circles. 5. Encourage the older children to add other things to their paintings like the sun, grass or butterflies. 6. Allow pictures to dry then hang them around your room. 7. Extend learning while you work by asking questions.
ven: Itshi ndi tshipiḓa tshi takadzaho. 😃 1. Kha vha vhudze vhana uri vha khou ya u ola maluvha. 2. Kha vha vha vhudze vha ole zwidanga zwi si gathi kha siaṱari ḽavho. Zwidanga zwi tea u vha vhukati ha luvha. Vha nga dovha vha ola na matsinde. 3. Kha vha thuse vhana vha pekhise tshipiḓa tsha tshipontshi (tsha u ita bulatsho ya u pennda). 4. Kha vha vha vhudze vha mbwandamedze tshipotshi kha pennde vha ole maluvha u mona na zwidanga. 5. Kha vha ṱuṱuwedze vhana vhahulwane uri vha engedze nga u ola zwiṅwe zwithu kha zwifanyiso zwavho u fana na ḓuvha, mahatsi kana zwisusu. 6. Kha vha litshe zwifanyiso zwi ome vha zwi nembeledze u mona na lufhera lwavho. 7. Kha vha engedze kha u guda musi vha tshi khou shuma nga u vhudzisa mbudziso.

source: Make sure you talk to the kids about what they’re drawing and painting and help them if they get stuck. You can ask them some of these questions: • How many flowers will you make? • What colours will your petals be? • Is your flower tall or short? • Where does it grow? • What do flowers need to grow? • What else can you tell me about your flowers?
ven: Kha vha vhone uri vha a kona u amba na vhana nga ha zwine vha khou ola na u pennda, vha vha thuse arali vha tshi khou konḓelwa. Vha nga vha vhudzisa dziṅwe dza hedzi mbudziso: • Ni nga ita maluvha mangana? • Mivhala ya maluvha aṋu i do vha minzana? • Luvha ḽanu ndi ḽilapfu kana ḽipfufhi? • Ḽi mela ngafhi? • Maluvha a ṱoda mini uri a aluwe? • Ni nga mmbudza tshiṅwe tshifhio nga ha maluvha aṋu?

source: This game develops:
ven: Mutambo uyu u bveledza:

source: ✔️Arm & Hand Control ✔️Talking & Understanding
ven: ✔️Ndaulo ya tshanḓa tshoṱhe ✔️U amba na u pfesesa
