Repository: Ari-Ramkilowan/po-files
Catalog: translations/SGroup14(Release (open))_Pedi; Sepedi;  Northern Sotho.po
Languages: nso

source: Read the notes
nso: Bala dinoutse

source: See what you need
nso: Bona se o se hlokago

source: See how it works
nso: Bona ka moo e šomago ka gona

source: Back to menu
nso: Re boela morago go menyu

source: While their creative juices are flowing, get their brains going by asking them some questions. Level 1 • What colour is this? • What shape is this • How many colours can you see? • Where will you stick this? Level 2 • How many pieces do you have? • What pattern is this? Level 3 • How will you use these pieces to make a picture? • What is your picture? • Can you tell me about it? • Can you make your name?
nso: Ge ba le gare ga tšweletša boithagišetšo bja bona, e re ba tšwele pele ka go šoga mabjoko a bona ka go botšiša dipotšišo tše dingwe. Kgato ya 1 • Naa mmala wo ke ofe? • Naa sebopego se ke sefe • Naa o bona mebala ye mekae? • Naa o tla e kgomaretša kae? Kgato ya 2 • Naa o na le dikarolwana tše kae? • Naa ye ke phethene ya mohuta mang? Kgato ya 3 • O ka šomiša bjang dikarolwana tše go dira seswantšho? • Naa seswantšho sa gago ke eng? • O ka mpotša mabapi le sona? • O ka dira leina la gago?

source: ✔️Arm & Hand Control ✔️Numbers , Shapes & Sizes
nso: ✔️Taolo ya letsogo le seatla ✔️ Dinomoro, dibopego le bogolo

source: Now it’s time to turn trash into treasure. 1. Make sure the chip packets are clean. 2. Ask the kids to share the chip packets between themselves. 3. Then ask them to cut or tear up chip packets into small pieces or shapes. 4. Get them to stick these pieces of chip packet onto the paper. 5. Encourage creativity as they make their pictures. 6. Talk about shapes, sizes, colour, texture, patterns, etc. 7. Help them to cut and stick as is needed. 8. Older children can even make spell their names out with the pieces.
nso: Ke nako gabjale go fetoša ditlakala wa di dira selo se bohlokwa. 1. Kgonthiša gore diphakethe tša ditshetlana di hlwekile. 2. Kgopela digotlane go abelana diphakethe tša ditshetlana magareng ga tšona. 3. Ba kgopele gore ba ripe goba go gagola diphakethe tša ditshetlana ka dikarolo goba dibopego tše nnyane. 4. Ba laele gore ba kgomaretše dikarolo tša diphakethe tša ditshetlana mo pampiring. 5. Hlohleletša boitlhagišetšo ge ba le gare ba dira diswantšho tša bona. 6. Bolela ka dibopego, bogolo, mmala, phopholego, diphethene, bjalobjalo. 7. Ba thuše go di ripa le go di kgomaretša ge go nyakega. 8. Bana ba bagolo ba ka ngwala le maina a bona ka dikarolwana.

source: Use Chip Packet Fun to teach the kids about not only making art, but recycling too.🥔
nso: Šomiša papadi ya Boipshino ya Phakethe ya Ditshetlana go ruta bana mabapi le go dira tša bokgabo, le go šomiša dilo leboelela.🥔

source: If there’s litter in the area, why not get the kids to collect it and throw it away while they look for chip packets? This is what you’ll for this game: • A clean chip packet per child • Piece of paper per child • Glue and scissors
nso: Ge e le gore go lahlwa ditlakala mo tikologong, ke ka lebaka la eng o sa laele digotlane gore di tope le go di lahla ge ba nyakana le diphakethe tša ditshetlana? Se ke seo o tla go se dira papading ye: • Efa ngwana yo mongwe le yo mongwe phakethe ye e hlwekilego ya ditshetlana • Pampišana go ngwana yo mongwe le yo mongwe • Sekgomaretši • Sekero

source: This game develops:
nso: Papadi ye e kaonafatša:
