Repository: Ari-Ramkilowan/po-files
Catalog: translations/SGroup9(Release (open))_Tsonga.po
Languages: tso

source: Use this activity as a bigger learning opportunity by asking the children some fun questions. Level 1 • Who likes blowing bubbles? • What do we normally use dishwashing soap for? • What colours do we have here? Level 2 • What does this pattern look like? • What shapes can you see? • What colours have you made? • How many bubbles can you see here? Level 3 • Let’s mix some colours. • Now what colours do you have? • What does blue and yellow make? (green) • What does red and yellow make? (orange) • What does blue and red make? (purple) • What sound does blue start with? (ba) • What sound does red start with? (rrrrrr) • What sound does yellow start with? (ya) • What sound does green start with? (ga) • What sound does orange start with? (o) • What sound does purple start with? (pa)
tso: Tirhisa nghingiriko lowu tanihi nkarhi lowukulu wo dyondza hi ku vutisa vana swivutiso swo tsakisa. Levhele ya 1 • Xana i mani a tsakelaka ku bulusa mabomubomu? • Xana xisibi xo hlantswa swibye xi tirhisiwa ku endla yini hi ntolovelo? • Xana hi na mihlovo yihi laha? Levhele ya 2 • Xana phetheni leyi yi languteka njhani? •Xana u vona swivumbeko swihi? • Xana u endle mihlovo yihi? • Xana u vona mabomubomu mangani laha? Levhele ya 3 • A hi hlanganiseni mihlovo. • U na mihlovo yingani sweswi? • Xana wasi na xitshopani swi endla muhlovo muni? (rihlaza) • Xana muhlovo wo tshwuka na xitshopani swi endla muhlovo muni? (xilamula) • Xana wasi na muhlovo wo tshwuka swi endla muhlovo muni? (xivunguvungu) • Xana wasi yi sungula hi mpfumawulo wihi? (wa) • Xana tshwuka yi sungula hi mpfumawulo wihi? (tshw) • Xana xitshopani yi sungula hi mpfumawulo wihi? (xxx) • Xana rihlaza yi sungula mpfumawulo wihi? (rrr) • Xana xilamula yi sungula hi mpfumawulo wihi? (xxx) • Xana xivunguvungu yi sungula hi mpfumawulo wihi? (xxx)

source: Read the notes
tso: Hlaya tinotsi

source: See what you need
tso: Vona leswi u swi lavaka

source: See how it works
tso: Vona leswaku swi tirha njhani

source: Back to menu
tso: Ku tlhelela eka menyu

source: Have the children tried Painting with Bubbles yet? 🎨
tso: Xana vana se va ringetile ku Penda hi Mabomubomu? 🎨

source: This game develops:
tso: Ntlangu lowu wu ya emahlweni:

source: ✔️Exploring & Finding Out ✔️Early Reading & Writing
tso: ✔️Ku valanga na ku kuma ✔️ku hlaya ka masungulo na ku tsala

source: It’s really simple. All you need is: 1. Paint 2. Dishwashing liquid 3. Straws 4. Paper
tso: Swi olovile swinene. Leswi lavekaka i: 1. Pende 2. Xisibi xo hlantswa swibye 3. Switorowu 4. Phepa

source: Read the note
tso: Hlaya tinotsi

source: This activity breathes new life into having fun with paint. No paintbrushes required! 🖌 1. Mix some paint with some dishwashing liquid in a cup. 2. Add a little bit of water to the mixture. 3. Give each child a straw and some paper, and ask them to share the paint. 4. Ask them to blow (not suck) through the straw into the cup. This will make bubbles. 5. Then ask the children to hold the paper over the cup and bubbles and press down gently. 6. The bubbles will leave a bubble pattern on the paper. 7. The children can repeat this with other colours and then leave their art to dry.
tso: Nghingiriko lowu wu tisa swilo swintshwa eka ku tiphina hi pende. A ku laveki tiburachi to penda! 🖌 1. Hlanganisa pende na xisibi xo hlantswa swibye endzeni ka khapu. 2. Chela mati mantsongo endzeni ka swona. 3. Nyika n’wana un’wana na un’wana xitoruwu na phepha, na ku va byela leswaku va avelana pende. 4. Va byeli leswaku va furhetela (ku nga ri ku tswonga) hi xitirowu endzeni ka khapu. Leswi swi ta endla mabomubomu. 5. Kutani u byela vana ku khoma phepha ehenhla ka khapu na mabomubomu va tshikelela swintsongo. 6. Mabomubomu ma ta siya phetheni ya mabomubomu eka phepha. 7. Vana va nga ha vuyelela leswi hi mihlovo yin’wana kutani va tshika leswi va nga swi endla swi oma.
