Repository: Ari-Ramkilowan/po-files
Catalog: translations/SGroup7(Release (open))_Swati.po
Languages: ssw

source: Read the notes
ssw: Fundza emanotsi

source: See what you need
ssw: Buka kutsi yini loyidzingako

source: See how it works
ssw: Buka kutsi isebenta njani

source: Back to menu
ssw: Buyela emuva kumenyu

source: The lion is the king of the jungle, let’s see what the kids know about it: Level 1 • What sound does a lion make? • Where do they live? • What do they eat? • What should you do if you see a lion? Level 2 • What kind of animals are they? (Cats and mammals) • What do they look like? • How big are they? • What colour are they? Level 3 • What else can you tell me about lions? • What other animals live near lions? • Let’s talk about those – what do you know about elephants, or rhinos? • What sound does the word ‘lion’ start with? • What sound does the word ‘rhino’ start with? • What sound does the word ‘elephant’ start with?
ssw: Libhubesi liyinkhosi yemahlatsi, ase sibuke kwekutsi bantfwana batini ngalo: Lizinga1 • Libhubesi lenta muphi umsindvo? • Lihlala kuphi? • Lidlani? • Yini lekufanele uyenta uma ubona libhubesi? Lizinga2 • Lisilwane lesinjani? (Emakati noma letimunyisako) • Abukeka njani? • Makhulu kangakanani? • Anembala lonjani? Lizinga3 • Yini lenye longangitjela ngayo ngemabhubesi? • Ngutiphi letinye tilwane letihlala dvutane nemabhubesi? • Asikhulume ngaleto – Yini loyatiko ngetindlovu, noma bobhejane? • Leligama lelitsi ‘Libhubesi’ licala ngawuphi umsindvo? • Leligama lelitsi ‘bhejane’ licala ngawuphi umsindvo? • Leligama lelitsi ‘indlovu’ licala ngawuphi umsindvo?

source: This game develops:
ssw: Lomdlalo utfutfukisa:

source: Have you made any Little Lions yet? 🦁
ssw: Ngabe sewuke wawenta emabhubesi lamancane? 🦁

source: ✔️Walking & Moving ✔️Arm & Hand control
ssw: ✔️Kuhamba nekunyakata ✔️Kulawula sandla nemkhono

source: If you have time, get the children cut these things out themselves: ✂ - 1 paper per child for the lion’s face - 2 black eyes per child cut out of paper - 1 nose per child cut out of paper - 2 ears per child cut out of paper - 1 plastic / onion bag per child
ssw: Uma ngabe unesikhatsi, cela bantfwana kutsi bajube letintfo ngekwabo: ✂ 1. 1 liphepha emntfwaneni ngamunye lekwakha buso belibhubesi 2. 2 emaphepha lamnyama lajutjwe ngulomntfwana 3. 1 imphumulo yemntfwana ngamunye lejutjwe emphumulweni 4. 2 tindlebe ngemntfwana ngamunye letijutjwe kuleliphepha 5. 1 liplastiki/umgodla longenalutfo wema-anyanisi lemntfwana munye

source: You can use this activity as an opportunity to teach children about animals. 1.Talk about lions before you make the lion face. 2.Ask each child to cut out a circle to make the lions face. 3.They can colour in the face of the lion and stick on eyes, nose and ears. 4.Get them to cut strips of plastic or onion bag for the mane of the lion. 5.Stick on the strips. 6.If you have string, you could make holes in the eyes and turn the lion face into a mask. 7.Get children to crawl around and roar like lions.
ssw: Ungasebentisa lomsebenti njengelitfuba lekufundzisa bantfwana ngetilwane. 1. Khuluma ngetindlovu ngembi kwekutsi wakhe buso bendlovu. 2. Cela umntfwana ngamunye kutsi ajube indingilizi kute akhe lobuso belibhubesi. 3. Bangahlobisa lobuso balelibhubesi bese banamatsisela emehlweni, imphumulo nasetindlebeni. 4. Bacele bajube ipulastiki ibe ticucu noma lisaka lema-anyanisi kute bakhe tinwele talelibhubesi. 5. Uma ngabe unetintsambo, ungenta imigodzi emehlweni bese ujika lobuso balelibhubesi buba yimaskhi. 6. Tsani bantfwana abakhase banyakate bese babhodla njengelibhubesi.
