Repository: Ari-Ramkilowan/po-files
Catalog: translations/SGroup19(Release (open))_Swati.po
Languages: ssw

source: Back to menu
ssw: Buyela emuva kumenyu

source: See what you need
ssw: Buka kutsi yini loyidzingako

source: Read the notes
ssw: Fundza emanotsi

source: See how it works
ssw: Buka kutsi isebenta njani

source: This game develops:
ssw: Lomdlalo utfutfukisa:

source: It’s time to decorate your classroom by Making Chains. Don’t worry, the children’s chains will be way nice than these: ⛓
ssw: Sekusikhatsi sekuhlobisa liklasi lakho ngeKwenta Emaketane. Ungakhatsateki, lamaketane ebantfwana atawuba mahle kundlula lawa: ⛓

source: ✔️Skills for Learning ✔️Arm & hand control
ssw: ✔️Emakhono ekufundza ✔️Kulawula sandla nemkhono

source: Good news! You probably have everything you need under your nose right now. 1. Coloured paper 2. Scissors 3. Glue
ssw: Tindzaba letimnandzi! Ngiyetsemba kutsi unayo yonkhe intfo loyidzingako ngaphansi kwemphumulo yakho nyalo. 1. Liphepha lelinembala 2. Tikelo 3. Iglue

source: Not exactly sure what to ask? Try out some of these questions: Level 1 • What colour do you like? • How many links will you make? • What could you use your chain for? Level 2 • What is your pattern? • How many colours do you have? Level 3 • How many links do you have? • How many links does your friend have? • How many links do you have together? • What if I take 5 links away? • How many will you have left?
ssw: Anginaliciniso lekutsi ngibute ini? Zama nayi imibuto: Lizinga1 • Utsandza muphi umbala? • Utawenta kungaki lokuhlanganisako? • Utalisebentiselani liketane lakho? Lizinga2 • Iyini iphethini yakho? • Unemibala lemingaki? Lizinga3 • Unakungaki kwekuhlanganisa? • Umngani wakho unakungaki kwekuhlanganisa? • Nobabili ninakungaki kwekuhlanganisa? • Kutawentekani uma ngabe ngitsatsa kwekuhlanganisa loku-5? • Utawusala nakungaki?

source: This activity is great for the children’s hand-eye coordination! 🖐🏿 👁 • Help the children cut the coloured paper into short strips. • They should each have about 10 strips . • Stick the 2 short edges of one strip together, making a ring. • Thread a new strip through the ring and stick its ends together, linking the 2 rings. • Continue with at least 10 strips, and make rings that link to each other. • Make scarves, necklaces, or belts with them before hanging them up in the classroom. • Ask questions as you work to help the kids learn.
ssw: Lomsebenti muhle kakhulu kutsi bantfwana bakhone kusebentisa tandla nemehlo! 🖐🏿 👁 • Sita labantfwana kujuba emaphepha lanemibala abe ticucu letimfishane. • Ngamunye akabe neticucu letili-10. • Namatsisela lamakona lama-2 lamafishane sicucu ngasinye usinamatsisele nalesinye, wente indingilizi. • Tfungela lesicucu ngekhatsi kwalendingilizi bese uhlanganisa lapho tigcina khona kanye kanye, uhlanganise letindingilizi leti-2. • Chubeka lokungenani neticucu leti-10, bese wenta tindingilizi letichumanisa lenye kulenye. • Yenta tikhafu, imigaco, noma emabhande ngato ngembi kwekutsi utilengise eklasini. • Buta imibuto ngalesikhatsi usita labantfwana kutsi bafundze.
