Repository: Ari-Ramkilowan/po-files
Catalog: translations/SGroup7(Release (open))_Venda.po
Languages: ven

source: Read the notes
ven: Kha vha vhale notsi

source: See what you need
ven: Zwine vha ṱoḓa

source: See how it works
ven: Zwi shumisa hani

source: Back to menu
ven: Kha vha humele murahu kha zwirengomu (Menu)

source: The lion is the king of the jungle, let’s see what the kids know about it: Level 1 • What sound does a lion make? • Where do they live? • What do they eat? • What should you do if you see a lion? Level 2 • What kind of animals are they? (Cats and mammals) • What do they look like? • How big are they? • What colour are they? Level 3 • What else can you tell me about lions? • What other animals live near lions? • Let’s talk about those – what do you know about elephants, or rhinos? • What sound does the word ‘lion’ start with? • What sound does the word ‘rhino’ start with? • What sound does the word ‘elephant’ start with?
ven: Ndau ndi yone khosi ya ḓakani, kha ri vhone arali vhana vha tshi zwi ḓivha: Ḽiga 1 • Ndau i lilisa hani? • Dzi dzula ngafhi? • Dzi ḽa mini? • Ni tea u ita mini arali na nga vhona ndau? Ḽiga 2 • Ndi lushaka lufhio lwa phukha? (Zwimange na zwimami) • Dzi vhonala sa mini? • Dzo hula lungafhani? • Dzi na muvhala munzana? Ḽiga 3 •Ndi zwifhio zwiṅwe zwine na nga ri vhudza nga ha ndau? • Ndi dzifhio dziṅwe phukha dzine dza dzula tsini na ndau? • Kha ri ambe nga hadzo – ni ḓivha mini nga ha nḓou, kana tshugulu? • Ipfi ‘ndau’ ḽi thoma nga mubvumo ufhio? • Ipfi ‘tshugulu’ ḽi thoma nga mubvumo ufhio? • Ipfi ‘nḓou’ ḽi thoma nga mubvumo ufhio?

source: This game develops:
ven: Mutambo u bveledza:

source: Have you made any Little Lions yet? 🦁
ven: Vho no ita zwa Zidahwana? 🦁

source: ✔️Walking & Moving ✔️Arm & Hand control
ven: ✔️U tshimbila na u sudzuluwa ✔️Ndaulo ya tshanḓa tshoṱhe

source: If you have time, get the children cut these things out themselves: ✂ - 1 paper per child for the lion’s face - 2 black eyes per child cut out of paper - 1 nose per child cut out of paper - 2 ears per child cut out of paper - 1 plastic / onion bag per child
ven: Arali vha na tshifhinga, kha vha ri vhana vha ḓi kokodzele izwi zwithu nga vhone vhaṋe: ✂ 1. Bambiri ḽithihi (1) nga ṅwana, tshifhatuwo tsha ndau 2. Maṱo matswu mavhili (2) nga ṅwana o gerwaho kha bammbiri 3. Ningo nthihi (1) nga ṅwana yo gerwaho kha bammbiri 4. Nḓevhe mbili (2) nga ṅwana dzo gerwaho kha bammbiri 5. Puḽasiṱiki nthihi (1) nga ṅwana

source: You can use this activity as an opportunity to teach children about animals. 1.Talk about lions before you make the lion face. 2.Ask each child to cut out a circle to make the lions face. 3.They can colour in the face of the lion and stick on eyes, nose and ears. 4.Get them to cut strips of plastic or onion bag for the mane of the lion. 5.Stick on the strips. 6.If you have string, you could make holes in the eyes and turn the lion face into a mask. 7.Get children to crawl around and roar like lions.
ven: Vha nga shumisa mushumo uyu sa tshikhala tsha u gudisa vhana nga ha zwipuka. 1. Kha vha ambe nga ha ndau vha sa athu thoma u ita tshifhaṱuwo tsha ndau 2. Kha vha humbele ṅwana muṅwe na muṅwe uri a gere tshidanga tsha u ita tshifhaṱuwo tsha ndau. 3. Vha nga khaḽara tshifhaṱuwo tsha ndau vha nambatedza na maṱo, ningo na nḓevhe. 4. Kha vha vha vhudze vha gere zwipuḽasiṱiki zwisekene uri vha ite ndebvu dza ndau. 5. Kha vha nambatedze zwipuḽasitiki izwo. 6. Arali vha na thambo, vha nga phula mabuli kha maṱo vha shumisa tshifhaṱuwo tsha ndau sa masiki. 7. Kha vha ri vhana vha kokovhe vha tshi mona na u vhomba sa ndau.
