Repository: Ari-Ramkilowan/po-files
Catalog: translations/SGroup15(Release (open))_Zulu.po
Languages: zul

source: Read the notes
zul: Funda amanothi

source: Back to menu
zul: Buyela kumenyu

source: See what you need
zul: Bheka ukuthi yini oyidingayo

source: See how it works
zul: Bheka ukuthi kusebenza kanjani

source: ✔️Arm & hand control ✔️Talking & Understanding
zul: ✔️Amakhono okulawula izingalo nezandla ✔️Ukukhuluma nokuqonda

source: Have the kids given Pick it Up and Turn it Over a try yet?
zul: Ingabe izingane sezike zazam i-Pick it Up ne-Turn it Over kuze kube manje?

source: This game develops:
zul: Lo mdlalo uthuthukisa:

source: Running a bit low on ideas? Try giving the children some of these instructions: Level 1 Use the peg to… • Put the block up. • Put it behind you. • Turn it over. • Put it in front of you. • Put it in your other hand. Level 2 • Put it next to your knee. • Hold it high in the sky. • Put it in your pocket. • Put it under your shoe. • Walk around the room holding it. • Run around the room holding it above your head. Level 3 • Put it on your left hand side. • Put it on your right hand side. • Use the blocks to make the first letter of your name.
zul: Ingabe imibono iyancipha? Zama ukunikeza izingane eminye zale miyalelo: Izinga 1 Sebenzisa ipheksi ukuba… • Uphakamise ibhuloki. • Ukulibeka emva kwakho. • Ukuliguqula. • Ukulibeka phambi kwakho. • Ukulibeka kwesinye isandla sakho. Izinga 2 • Ukulibeka eduze kwedolo lakho. • Ukuligcina liphezulu esibhakabhakeni. • Ukulifaka ephaketheni lakho. • Ukulibeka ngaphansi kwesicathulo sakho. • Ukuhambahamba egumbini ulibambile. • Ukugijima egumbini ulibambe phezu kwekhanda lakho. Izinga 3 • Ukulibeka ngasesandleni sakho sesokunxele. • Ukulibeka ngasesandleni sakho sesokudla. • Sebenzisa amabhuloki ukwenza uhlamvu lokuqala lwegama lakho.

source: You’ll only need two things before you can get going with this game: • Lego blocks • A clothing peg for each child
zul: Uzodinga izinto ezimbili kuphela ngaphambi kokuqhubeka nalo mdlalo: • Amabhuloki e-LEGO • Ipheksi lokuneka ingane ngayinye

source: Our future surgeons will need steady hands. 🏥 1. Give each child a peg. 2. Ask them to choose a block from the pile and pick it up with a peg. 3. Now ask them to put it down on the floor next to them. 4. Ask them to turn the block upside down using the peg. 5. Now ask them to put it behind the person sitting next to them using their peg. 6. Next, ask them to put it in the middle of the circle using the peg. 7. Continue with these kinds of instructions. 8. Keep instructions simple for younger children. 9. Make the instructions for the older kids more challenging. 10. Ask the older kids to give their own instructions to the group.
zul: Odokotela bethu abahlinzayo bakusasa bazodinga izandla ezingaqhaqhazeli. 🏥 1. Nikeza ingane ngayinye ipheksi. 2. Bacele bakhethe ibhuloki enqwabeni bese beyiphakamise ngepheksi. 3. Manje bacele ukuba balibeke phansi eduze kwabo. 4. Bacele ukuthi baguqule ibhuloki besebenzisa ipheksi. 5. Manje bacele ukuba balibeke ngemuva komuntu ohlezi eceleni kwabo besebenzisa ipheksi labo. 6. Ngemva kwalokho, bacele ukuba balibeke phakathi kwesiyingi besebenzisa ipheksi. 7. Qhubeka nalezi zinhlobo zemiyalelo. 8. Gcina imiyalo ilula wenzele izinganeni ezisencane. 9. Yenza imiyalelo yezingane ezindadla ibe nzima kakhudlwana. 10. Tshela izingane ezindadlana ukuthi zinikeze imiyalelo yazo eqenjini.
