Repository: Ari-Ramkilowan/po-files
Catalog: translations/SGroup8(Release (open))_Swati.po
Languages: ssw

source: Another great arts and crafts activity is Making Faces 😃🙃🤪😜🤩😎😠🤗🤐😴🤕🤒🤠🤯😍
ssw: Lomunye umdlalo lomuhle webuciko nekubumba kwakha buso 😃🙃🤪😜🤩😎😠🤗🤐😴🤕🤒🤠🤯😍

source: But I don’t mean pulling faces, I mean making them with: 1. 1 piece of paper per child 2. Wool 3. Scissors and glue For younger children: 1. Cut out 1 pair of eyes per child. 2. Cut out 1 pair of ears per child. 3. Cut out nose per child. 4. Cut out mouth per child. For older children: 1. Pictures where they can cut out the eyes, nose, mouth etc.
ssw: Kodvwa angisho kwekutsi advonse buso, kodvwa ngisho kwekutsi abente ngabo: 1. 1 licetu leliphepha lemntfwana ngamunye 2. Insondvo 3. Sikelo 4. Iglu Kwebantfwana labancane: 1. Juba 1 incenye yemehlo emntfwana ngamunye. 2. Juba incenye 1 yelipheyi letindlebe lemntfwana munye. 3. Jubela umntfwana ngamunye imphumulo. 4. Jubela umntfwana ngamunye umlomo. Kwebantfwana labakhulu: 1. Titfombe lapho bangajuba khona emahlo, imphumulo, nemlomo njll.

source: Read the notes
ssw: Fundza emanotsi

source: See what you need
ssw: Buka kutsi yini loyidzingako

source: See how it works
ssw: Buka kutsi isebenta njani

source: Back to menu
ssw: Buyela emuva kumenyu

source: This game develops:
ssw: Lomdlalo utfutfukisa:

source: ✔️Arm & Hand Control ✔️Talking & Understanding
ssw: ✔️Kulawula sandla nemkhono ✔️Kukhuluma nekuvisisa

source: Once you have everything you need: 1. Give each child a piece of paper and cut-out pictures of noses, eyes, ears and mouths to give to younger children. 2. Give pictures of faces to older children. 3. Ask them to use the pictures to make a face. 4. Talk about the senses as you do it (smell, taste, seeing, hearing etc.). 5. Get them to stick their pictures down when they have made their faces. 6. Give them each some wool and ask them to turn it into hair. 7. They can cut and stick the materials in any way they want to. 8. Look at the faces together and talk about them to help the kids learn. There are examples of what to ask in the notes. 9. Cut the faces out and attach them to a stick. 10. You can use these to tell stories.
ssw: Uma sewunako konkhe lokudzingako: 1. Nika umntfwana ngamunye incenye yeliphepha kanye naletitfombe latijubile temphumulo, emehlo, tindlebe nemilomo kute unikete labantfwana labancane. 2. Niketa titfombe tebuso ebantfwaneni lesebakhulile. . 3. Bacele kutsi basebentise lesitfombe kwenta buso. 4. Khuluma ngetimvo ngalesikhatsi ukwenta (kuhogela, kunambitsa, kubona, kuva, kubamba njll.). 5. Bacele kutsi banamatsisele titfombe tabo uma ngabe sebabentile buso babo. 6. Niketa munye wabo insondvo bese ubacela kutsi bakhe ngako tinwele. 7. Bangajuba banamatsisele tintfo nganoma yiphi indlela lebafuna ngayo. 8. Bukani lobuso kanye kanye bese nikhuluma ngabo kusita labantfwana kutsi bafundze. Kunetibonelo tekutsi kubutwe ini kulamanotsi. 9. Juba ukhiphe lobuso bese ubunamatsisela elutsini. 10. Ungasebentisa loku kucoca tindzaba.

source: As promised, here are some questions: ❓ Level 1 • What do we use our noses for? • What do we use our eyes for? • And our ears? • Is your face happy or sad? • What kind of hair will you make? • What is the name of this face? Level 2 • What is your favourite taste? • What do you like to smell? • What can you hear right now? • What can you see with your eyes if you look left? • What can you see with your eyes if you look to the right? Level 3 Allow older children to make up a story - for example: • Who does your face belong to? • Mine is a gogo • What do you want to say to gogo? • Gogo asks: “What you would like for supper?” • Gogo asks if you will help her make supper. • What shall we do first? You can even act the story out if you like.
ssw: Njengoba kutsenjisiwe, nayi leminye imibuto: Lizinga1 • Sitisebentise lani timphumulo tetfu? • Siwasebentise lani emehlo etfu? • Tindlebe tetfu? • Ngabe buso bakho bujabulile noma budvumele? • Utawenta tinwele letinjani? • Yini ligama lalobuso? Lizinga2 • Yini lotsandza kuyinambitsa? • Yini lotsandza kuyihogela? • Yini loyivaka njenganyalo? • Yini longayibona ngemehlo akho uma ubuka esencele? • Yini longayibona ngemehlo akho uma ubuka kusekudla? Lizinga3 Vumela bantfwana labadzadlana kutsi betse indzaba – Sibonelo: • Buso bakho babani? • Bami bagogo. • Ufuna kutsini kugogo? • Gogo uyabuta: “Ungatsandza kudla ini ntsambama?” • Gogo ubuta kutsi utamsita yini kupheka kudla kwantsambama. • Yini lekufanele siyente kucala? Ungayilingisa lendzaba uma ngabe ufuna.
