Repository: Ari-Ramkilowan/po-files
Catalog: translations/SGroup8(Release (open))_Tswana.po
Languages: tsn

source: Another great arts and crafts activity is Making Faces 😃🙃🤪😜🤩😎😠🤗🤐😴🤕🤒🤠🤯😍
tsn: Tiro e nngwe e kgolo ya botsweretshi le botaki ke go Dira Difatlhego😃🙃🤪😜🤩😎😠🤗🤐😴🤕🤒🤠🤯😍

source: But I don’t mean pulling faces, I mean making them with: 1. 1 piece of paper per child 2. Wool 3. Scissors and glue For younger children: 1. Cut out 1 pair of eyes per child. 2. Cut out 1 pair of ears per child. 3. Cut out nose per child. 4. Cut out mouth per child. For older children: 1. Pictures where they can cut out the eyes, nose, mouth etc.
tsn: Legale ga ke reye go bontsha maikutlo ka sefatlhego, ke raya go di dira: 1. Pampiri e le 1 ngwana mongwe le mongwe 2. Wulu 3. Sekere 4. Tloluo Ya bana ba bannye: 1. Segolola para e le 1 ya matlho ngwana mongwe le mongwe. 2. Segolola para e le 1 ya ditsebe ngwana mongwe le mongwe. 3. Segolola nko ngwana mongwe le mongwe. 4. Segolola molomo ngwana mongwe le mongwe. Ya bana ba bagolwane. 1. Ditshwantsho tse ba ka kgonang go segolola matlho, nko, molomo, jalo le jalo mo go tsone.

source: Read the notes
tsn: Bala dintlha

source: See what you need
tsn: Bona se o se tlhokang

source: See how it works
tsn: Bona kafa o tshamekiwang ka teng

source: Back to menu
tsn: Boela kwa mmenyung

source: This game develops:
tsn: Motshameko o o a tswelela:

source: ✔️Arm & Hand Control ✔️Talking & Understanding
tsn: ✔️Taolo ylebogo le seatla ✔️Go bua le go tlhaloganya

source: Once you have everything you need: 1. Give each child a piece of paper and cut-out pictures of noses, eyes, ears and mouths to give to younger children. 2. Give pictures of faces to older children. 3. Ask them to use the pictures to make a face. 4. Talk about the senses as you do it (smell, taste, seeing, hearing etc.). 5. Get them to stick their pictures down when they have made their faces. 6. Give them each some wool and ask them to turn it into hair. 7. They can cut and stick the materials in any way they want to. 8. Look at the faces together and talk about them to help the kids learn. There are examples of what to ask in the notes. 9. Cut the faces out and attach them to a stick. 10. You can use these to tell stories.
tsn: Fa o na le sengwe le sengwe se o se batlang. 1. Naya ngwana mongwe le mongwe pampiri le ditshwantsho tse di segolotsweng tsa dinko, matlho, ditsebe le melomo gore ba di neye bana ba bannye. 2. Naya bana ba bagolwane ditshwantsho tsa difatlhego. 3. Ba kope gore ba dirise ditshwantsho go dira sefatlhego. 4. Bua ka ditemosi fa o ntse o e dira (go nkga, tatso, go bona, go utlwa, go kgoma jalo jalo.). 5. Dira gore ba kgomaretse ditshwantsho tsa bone fa ba se na go dira difatlhego. 6. Naya mongwe le mongwe wa bone wulu mme o ba kope gore ba dire moriri ka yone. 7. Ba ka sega le go kgomaretsa dimatheriale ka tsela e ba batlang ka yone. 8. Lebang difatlhego mmogo mme le bue ka tsone go thusa bana go ithuta. Go na le dikai tsa se o tshwanetseng go se botsa mo dintlheng tse di kwadilweng. 9. Segolola difatlhego o bo o di kgomaretsa mo thobanyaneng. 10. O ka di dirisa go bolela ditori.

source: As promised, here are some questions: ❓ Level 1 • What do we use our noses for? • What do we use our eyes for? • And our ears? • Is your face happy or sad? • What kind of hair will you make? • What is the name of this face? Level 2 • What is your favourite taste? • What do you like to smell? • What can you hear right now? • What can you see with your eyes if you look left? • What can you see with your eyes if you look to the right? Level 3 Allow older children to make up a story - for example: • Who does your face belong to? • Mine is a gogo • What do you want to say to gogo? • Gogo asks: “What you would like for supper?” • Gogo asks if you will help her make supper. • What shall we do first? You can even act the story out if you like.
tsn: Jaaka go solofeditswe, dipotso dingwe ke tse: Maemo 1 • Re dirisa dinko tsa rona go dira eng? • Re dirisa matlho a rona go dira eng? • Ditsebe tsa rona tsone? • A sefatlhego sa gago se itumetse kgotsa se hutsafetse? • O tlile go dira moriri wa mofuta ofe? • Leina la sefatlhego se ke mang? Maemo 2 • Tatso e o e ratang thata ke efe? • Ke eng se o ratang go utlwa monkgo wa sone? • O kgona go utlwa eng gone jaanong jaana? • O kgona go bonang ka matlho a gago fa o leba kafa molemeng? • O kgona go bonang ka matlho a gago fa o leba kafa mojeng? Maemo 3 Dira gore bana ba bagolwane ba tlhame setori – ka sekai: • Sefatlhego sa gago ke sa ga mang? • Sa me ke nkoko. • O batla go raya nkoko o reng? • Nkoko o botsa ka go re: “O ka rata go ja eng maitseboa?” • Nkoko o botsa gore a o tla mo thusa go apaya dijo tsa maitseboa. • Ke eng se re tshwanetseng go se dira pele? Ebile o ka nna wa diragatsa setori seno fa o batla?
