Repository: Ari-Ramkilowan/po-files
Catalog: translations/SGroup19(Release (open))_South Ndebele.po
Languages: nbl

source: Back to menu
nbl: Buyela erhelweni

source: See what you need
nbl: Bona ukuthi utlhoga ini

source: Read the notes
nbl: Funda amaAwathi

source: See how it works
nbl: Bona ukuthi isebenza bunjani

source: This game develops:
nbl: Umdlalo lo uthuthukisa:

source: It’s time to decorate your classroom by Making Chains. Don’t worry, the children’s chains will be way nice than these: ⛓
nbl: Sikhathi sokobana ukghabise iklasi lakho ngokwenza iketanga - Making Chains. Ungakhathazeki, amaketanga wabantwana azakuba mahle khulu kunalawo owabonako: ⛓

source: ✔️Skills for Learning ✔️Arm & hand control
nbl: ✔️AmakghoAwa wokufunda ✔️Ukulawula umkhoAwa nesandla

source: Good news! You probably have everything you need under your nose right now. 1. Coloured paper 2. Scissors 3. Glue
nbl: Iindaba ezihle! Kungenzeka unakho koke okutlhogako. 1.Iphepha lombala 2.Iinkere 3.Irhomu

source: Not exactly sure what to ask? Try out some of these questions: Level 1 • What colour do you like? • How many links will you make? • What could you use your chain for? Level 2 • What is your pattern? • How many colours do you have? Level 3 • How many links do you have? • How many links does your friend have? • How many links do you have together? • What if I take 5 links away? • How many will you have left?
nbl: Awazi bona ubuzeni? Zama nasi imibuzo: Ileveli yoku - 1 • Uthanda muphi umbala? • Uzohlanganisa kangaki? • Iketanga yakho ungayisebenzisela ini? Ileveli Iyei - 2 • Yini iphethini yakho? • Unemibala emingaki? Ileveli Iyei - 3 • Unezihlanganiso ezingaki? • Umnganakho yena unazingaki? • Awababili ninangaki? • Kungenzakalani nange ngingathatha ezi - 5? • Uzokusala nezingaki ?

source: This activity is great for the children’s hand-eye coordination! 🖐🏿 👁 • Help the children cut the coloured paper into short strips. • They should each have about 10 strips . • Stick the 2 short edges of one strip together, making a ring. • Thread a new strip through the ring and stick its ends together, linking the 2 rings. • Continue with at least 10 strips, and make rings that link to each other. • Make scarves, necklaces, or belts with them before hanging them up in the classroom. • Ask questions as you work to help the kids learn.
nbl: Umsebenzi lo ulungele khulu ukusebenzisa izandla namehlo ngasikhathi sinye! 🖐🏿 👁 • Rhelebha abantwana ukusika iphepha lombala iinquntwana ezifishane. • Kufanele boke babe neenquntu ezili – 10 okungasenani. • Hlanganisa iinquntu ngokwenza irenghi. • Thunga isiquntu esitjha nerenghi uhlanganise ekugcineni namarenghi ama – 2. • Ragela phambili ngeenquntu Awama iinstrepe ezi – 10 okungasenani, wenze amarenghi ahlanganako. • Yenza izikhafu, imincamo, amabhande ngazo ngaphambi kokobana uzilengise eklasini. • Buza imibuzo nawurhelebha abafundi bona bafunde.
