Repository: Ari-Ramkilowan/po-files
Catalog: translations/SGroup3(Release (open))_Tswana.po
Languages: tsn

source: On a rainy day, or if you’ve got a very physical Large group activity planned, why not have some Puzzle Fun? 🌧= 🖼
tsn: Fa pula, kgotsa fa o rulagantse tirwana ya setlhopha se segolo ya go dirisa mmele, gore o sa dire motshameko wa go Tshameka Monate ka go Dira Malepa? 🌧= 🖼

source: You don’t even need to go buy puzzles, all you need is: 1. 3 homemade puzzles made from pictures in magazines (choose pictures that children enjoy). 2. Ensure that there are some easier puzzles for younger children, but not too easy.
tsn: Ga o tlhoke le eleng go reka malepa, se o se tlhokang fela ke: 1. Malepa a le 3 a a itiretsweng ka ditshwantsho tse di bonweng mo dimakasineng (tlhopha ditshwantsho tse bana ba di ratang). 2. Tlhomamisa gore go nne le malepa a a bonolonyana a bana ba bannye, mme a se bonolo thata.

source: Once you have your amazing, custom puzzles you can begin. 1. Choose easier puzzles for young children and give more difficult puzzles to older children. 2. Give each child a piece of a puzzle. 3. Ask them to put their pieces down so that everyone can see. 4. Then give them additional pieces, one by one. 5. Slowly help them arrange the pieces so that they can make the puzzle. 6. Talk about the picture. 7. Repeat with the other puzzles. 8. If you think they are able, mix up the 3 puzzles and see if they can sort them out, and build the 3 separate puzzles.
tsn: Fa o na le malepa a a kgatlhang thata, a a itiretsweng o ka simolola. 1. Tlhopha malepa a a bonolonyana a bana ba bannye mme o neye bana ba bagolwane malepa a a thata. 2. Naya ngwana mongwe le mongwe karolo ya malepa. 3. Ba botse gore ba beye karolo ya bone fa fatshe gore mongwe le mongwe a kgone go e bona. 4. O bo o ba naya dikarolo tse dingwe, mongwe le mongwe wa bone. 5. Ka bonya ba thuse gore ba rulaganye dikarolo tseo gore di dire malepa. 6. Bua ka setshwantsho. 7. Boeletsa ka malepa a mangwe. 8. Fa o bona gore ba a kgona, tlhakanya malepa a le 3 mme fa ba kgona go a rarabolola, ba bo ba dira maleba a le mararo a a farologaneng.

source: See what you need
tsn: Bona se o se tlhokang

source: See how it works
tsn: Bona kafa o tshamekiwang ka teng

source: Read the notes
tsn: Bala dintlha

source: Back to menu
tsn: Boela kwa mmenyung

source: This game develops:
tsn: Motshameko o o a tswelela:

source: ✔️Exploring & Finding out ✔️Skills for Learning
tsn: ✔️Go utolola le go bona ✔️Bokgoni jwa go ithuta

source: And because this game is to help develop the children’s thinking skills, ask some questions along the way. For the easier puzzles: • What do you think this picture is? • Where do you think this piece goes? While putting the puzzle together: • Tell me about this picture? • What can you see? • Is this an edge or a middle piece? If you mix all three puzzles: • What happens if we mix up the puzzles? • Who has this piece?
tsn: Mme ka gonne motshameko o ke wa go thusa bana go kgona go akanya, ba botse dipotso fa ba ntse ba dira. Ka malepa a a bonolonyana: • O akanya gore setshwantsho se ke eng? • O akanya gore setshwantsho se se tsena fa kae? Fa o kopanya ditshwantsho sa malapa: • O ka mpolelelang ka setshwantsho seno? • O kgona go bonang? • A karolo eno ke ya kafa thoko kgotsa ke ya fa gare? Fa o tlhakanya malepa otlhe ka boraro: • Go diragalang fa re tlhakanya malepa? • Ke mang yo o tshotseng karolo eno?
