Repository: Ari-Ramkilowan/po-files
Catalog: translations/SGroup6(Release (open))_Xhosa.po
Languages: xho

source: Read the notes
xho: Funda amanqaku

source: See what you need
xho: Bona okudingayo

source: See how it works
xho: Jonga ukuba isebenza njani

source: Back to menu
xho: Buyela kwimenyu

source: Find the budding scientists and engineers in the class with the game Making Tunnels. 👩🏿‍🔬👨🏿‍🔬
xho: Fumana iingcaphephe zobuhlobo nobunjineli eklasini ngeeNdlela zokwenza Amaqela. 👩🏿‍🔬👨🏿‍🔬

source: First you have to make the tunnel, then you show the children how it works. 🚇 1. Give each child 2 or 3 toilet rolls. 2. Help them to stick their toilet rolls together to make a long tunnel. 3. They can decorate their tunnel with paper and crayons if they want to. 4. Ask one of the children to hold the tunnel up straight. 5. Place a little bowl at the bottom of the tunnel to catch the stones. 6. Give other children stones and get them to ‘post’ the stones into the top of the tunnel. Use words like ‘up, down, through, top, bottom’ etc. 7. Allow older children to make more complex tunnels if they want to.
xho: Okokuqala kufuneka wenze i-tunnel, uze ubonise abantwana ukuba isebenza njani. 🚇 1. Nika umntwana ngamnye 2 okanye 3 zangasese. 2. Bancede ukuba banamathele kunye neendlwana zabo zangasese ukuze benze i-tunnel ende. 3. Baya kuhobisa i-tunnel yabo kunye nephepha kunye neekrayoni ukuba zifuna. 4. Buza omnye wabantwana ukuba abambe iqonde ngqo. 5. Beka isitya esincinane kwinqanaba lokubamba amatye. 6. Nika abanye abantwana ngamatye kwaye bawenze ukuba 'bathumele' amatye abe phezulu kwindlela. Sebenzisa amagama afana 'phezulu, phantsi, ngoku, phezulu, ngezantsi' njl 7. Vumela abantwana abadala ukuba benze iingxube ezinzima xa zifuna.

source: ✔️Exploring & Finding Out ✔️Arm & hand control
xho: ✔️Ukukhangela nokufumanisa ✔️Ulawulo lwengalo kunye nesandla

source: Because you’re teaching kids about gravity, it’s a good idea to ask them lots of questions about how they think it works. ⚗ Easiest version • How tall is our tunnel? • How many toilet rolls have we used? More advanced version • What will happen to this stone? • Where will it land? • Whose turn is it now? For older children • Do it 10 times • How many times did it land in the bowl? • How many times did it NOT land in the bowl? • Tell me about your decoration.
xho: Ngenxa yokuba ufundisa abantwana malunga nokuvumba, kuyisiphumo esihle sokubabuza imibuzo eninzi malunga nendlela abacinga ngayo isebenza. ⚗ Umgangatho 1 • Umde kangakanani umjelo wethu? • Zingaphi iindwangu zangasese esazisebenzisileyo? Umgangatho 2 • Yintoni eya kwenzeka kweli litye? • Liya kuhlala phi? • Nguwuphi na umjikelo ngoku? Umgangatho 3 • Yenza amaxesha angama-10 • Zingaphi kangangexesha elithe zafika kwisitya? • Zingaphi kangangezinye izihlandlo ezingazange zihlale kwisitya? Ndixelele ngomhlobiso wakho.

source: This game develops:
xho: Lo mdlalo uphuhlisa:

source: This game is a fun way to combine crafts with learning, and let’s kids make their own toys. 1. Empty toilet rolls (2 per child) 2. Sticky tape 3. Stones 4. Paper (optional) 5. Crayons (optional)
xho: Lo mdlalo uyindlela edibanisayo yokudibanisa ubugcisa kunye nokufunda, kwaye ivumela abantwana ukuba bazenzele amathoyizi abo. Uza kudinga: 1. Iingcambu zokungcebeleka zangasese (2 ngomntwana) 2. Iteyiphu encamathelayo 3. Amatye 4. Iphepha (ngokuzikhethela) 5. Iikhrayoni (ukhetho)
