Repository: Ari-Ramkilowan/po-files
Catalog: translations/SGroup12(Release (open))_Swati.po
Languages: ssw

source: It’s time for these budding entrepreneurs to learn about the value of money. 1. Give each child their coin rubbings from the previous activity. 2. Ask them to cut out the coins. 3. Help those that need it. 4. Help them to fold over their piece of paper to make a purse. 5. Ask the children to put their coins into their new purse for safekeeping. 6. Set up a shop. 7. Talk about the items in your shop as you set up. 8. Have words under your items. Eg, milk, bread, cereal, etc. 9. Ask each child to come to your shop and buy something. 10. When they give you their money, tell them what they can buy with it. 11. Talk as you play and ask questions to help the children learn. 12. For the older children, ask them for money and give them change.
ssw: Sekusikhatsi salabosomabhizinisi labasafufusa kutsi bafundze ngekubaluleka kwemali. 1. Niketa umntfwana ngamunye luhlavu lwakhe lwemali lekatakhele lona kulomsebenti lebawente ngaphambilini. 2. Bacele kutsi bajube loluhlavu lwemali. 3. Sita labo labadzinga lusito. 4. Basite kutsi bagoce lesidleshana seliphepha labo kute bente sipashi. 5. Cela labantfwana kutsi bafake lemali yabo kulesipashi kute bayigcine iphephile. 6. Lungiselela sitolo. 7. Khuluma ngaletintfo letisesitolo sakho ngalesikhatsi usilungiselela. 8. Bani nemagama ngaphansi kwentfo ngayinye. Sibonelo, lubisi, sinkhwa, emasiriyeli, njll. 9. Cela umntfwana ngamunye kutsi ete esitolo sakho atotsenga lokutsite. 10. Ngalesikhatsi bakuniketa imali yabo, batjele kutsi yini lebangayitsenga ngayo. 11. Khuluma ngalesikhatsi nidlala ubute nemibuto kute usite labantfwana kutsi bafundze. 12. Kulabantfwana lesebabadzala, bacele kutsi bakhokhele lokutsite bese ubaniketa intjintji.

source: See what you need
ssw: Buka kutsi yini loyidzingako

source: See how it works
ssw: Buka kutsi isebenta njani

source: Read the notes
ssw: Fundza emanotsi

source: Back to menu
ssw: Buyela emuva kumenyu

source: Spending money is easy, it’s saving money that’s hard. Try remind the children how important saving is while you talk to them. 🏦 Level 1 • Where do you keep your money? • What do you want to buy at my shop? • What are you going to cook with these things…? • What else would you like to buy? Level 2 • How much money have you got? • That will cost… Level 3 • Have you got any money left? • Would you like to use that money to buy something else? • Do you have enough? • Or would you rather save it for next time? • What sounds does milk start with? (mmmm) • What sound does fish start with? (ffff)
ssw: Kusebentisa imali kulula, konga imali ngiko lokulukhuni. Zama kukhumbuta labantfwana ngekubaluleka kwekonga imali ngalesikhatsi ukhuluma. 🏦 Lizinga1 • Uyigcina kuphi imali yakho? • Yini longatsandza kuyitsenga esitolo sami? • Uyopheka ini ngaletintfo? • Yini lenye longatsandza kuyipheka? Lizinga2 • Unamalini? • Loku kutawubita… Lizinga3 • Ngabe unayo lenye imali lesele? • Ungatsandza kuyisebentisa leyo mali kutsenga lokunye? • Unemali leyanele? • Noma ungatsandza kuyongela sikhatsi lesitako? • Leligama lelitsi Lubisi lucala ngamuphi umsindvo? (lllll) • Leligama lelitsi inhlanti licala ngamuphi umsindvo? (iiii)

source: Let’s put the Money Rubs the children did to good use with Spending Coins!💰
ssw: Asesifake lokwekuhlobisa imali lokwentiwe ngulabantfwana lapho sitakusebentisa kahle khona nemali letinhlavu letawusetjentiswa! 💰

source: This game develops:
ssw: Lomdlalo utfutfukisa:

source: ✔️Talking & Understanding ✔️Social
ssw: ✔️Kukhuluma nekuvisisa ✔️Emakhono ekuphila

source: Now that the children have created their own money during the previous activity, it’s time to give them something to spend it on. You’ll need: 1. Coin drawings from the previous Small Group Activity. 2. Scissors. 3. A piece of paper for each child to make a purse. 4. Empty food containers such as cereal boxes, milk bottles, egg boxes, etc. Have enough for each child to “buy” a few items. 🍞🥔🥚
ssw: Nyalo njengoba labantfwana sebatakhele imali yabo ngalesikhatsi benta lomsebenti wangaphambilini, sekusikhatsi sekubanika lokutsite labatayisebentisa kuko. Utawudzinga: 1. Kudvwetjwa kwetinhlavu temali lebekwentiwa kulomsebenti weMacembu Lamancane londlulile ngaphambilini. 2. Sikelo. 3. Sidlephu seliphepha semntfwana ngamunye kute ente sipashi. 4. Titja tekudla letingenalutfo letifana nemabhokisi emasiriyeli, emabhodlela elubisi, emabhokisi emacandza, njll. Bani nalokwanele kute umntfwana ngamunye akhone “kutsenga” tintfo letimbalwa. 🍞🥔🥚
