Repository: Ari-Ramkilowan/po-files
Catalog: translations/SGroup17(Release (open))_Xhosa.po
Languages: xho

source: See what you need
xho: Bona okudingayo

source: See how it works
xho: Jonga ukuba isebenza njani

source: Read the notes
xho: Funda amanqaku

source: Back to menu
xho: Buyela kwimenyu

source: This game develops:
xho: Lo mdlalo uphuhlisa:

source: Here’s what you’ll need to keep the kids busy: 1. A pre-drawn picture of a dinosaur for each child. 2. Squares about the size of a stamp in 2 or 3 different colours. 3. Glue. 4. Scissors.
xho: Naku oza kudinga ukugcina abantwana bexakekile: 1. Umzobo sele ezotyiwe wedayinaso kumntwana ngamnye 2. Iskweri esilingana nestampu kwimibala emi 2 kanye emi 3 3. Iglu 4. Izikere

source: We started from the ground up by making dinosaur footprints in the last activity, so how about we move on to Making Dinosaurs? 🦕
xho: Siqale emhlabeni ukwenyuka senza amanyawo azotyiwe edayinaso kumsebenzi wokugqibela, ke ngoku kunganjani sigithele ekwenzeni iidayinaso? 🦕

source: ✔️Numbers , Shapes & Sizes ✔️Skills for Learning
xho: ✔️ Amanani, ukumila kunye nesayizi ✔️Izakhono zokufunda

source: Keep the kids wide awake by encouraging them to make dinosaur noises while they work. 🦖🦕 1. Give each child a picture of a dinosaur. 2. Cut out the colourful squares for younger children. 3. Let older children cut their own little squares. 4. Sort the little squares into piles depending on their colour. 5. Show the children how to stick the squares onto their dinosaurs. 6. Help the younger ones while encouraging the older ones. 7. Help them make a pattern using colours (red, blue, red, blue, red, etc).
xho: Gcina abantwana bevuke qwa ngokuba benze ingxolo yedayinaso ngoku besebenzayo. 🦖🦕 1. Nika umntwana ngamnye umfanekiso wedayinaso. 2. Sika izikwere ezimibalabala kubantwana abancinci. 3. Bayeke abantwana abadala ukuba banqande izikwere zabo ezincinane. 4. Hlela izikwere ezincinci zibe yimilingo ngokuxhomekeke kumbala wazo. 5. Bonisa abantwana ukuba banamathele izikwere zabo kwiidinosaurs zabo. 6. Nceda abatsha ngelixa bekhuthaza abadala. 7. Bancedise benze ipatheni usebenzisa imibala (obomvu, obomvu, obomvu, obomvu, obomvu, njl njl.).

source: Not sure what to ask the children next? Here are some ideas: Level 1 • What does this dinosaur need? • Where will these spikes go? • How many do you need? • What colours will you choose? Level 2 • What pattern will you make? • Which one shall we start with? • When did dinosaurs live? (The answer can be something like: a long, long time ago). • Are there still dinosaurs on earth? (Answer: no, they have all died). • What do they eat? (Answer: some eat plants, some eat other animals). Level 3 • What sound does dinosaur start with? (da) • What else starts with ‘da’? • Do you know the names of different types of dinosaurs? (Answer: T. rex, brontosaurus, triceratops).
xho: Ingaba awuqinisekanga ukuba ungababuza ntoni abantwana kwilixa elilandelayo? Nazi ezinye izimvo: Umgangatho 1 • Ingaba ifuna ntoni le dayinaso? • Ingaba ezi zinto zinkulu ziza kuyaphi? • Ingaba zingaphi ozidingayo? • Ingaba yeyiphi imibala onokuyikhetha? Umgangatho 2 • Ingaba yeyiphi iphatheni anokuyenza? • Yiyiphi esingayiqala ngomso • Ingaba beziphila nini iidayinaso? (Impendulo ingaba yinto efana nale: ixesha elide, elide elidlulileyo). • Ingaba kusekho iidinosaurs emhlabeni? (Phendula: Hayi, bonke bafe baze baphela). • Zitya ntoni? (Phendula: abanye badla izityalo, abanye badla ezinye izilwanyana). Umgangatho 3 • Ingaba isiphi isandi u-dinosaur uqala ngalo (da) • Yintoni enye eqala nge 'da'? • Ingaba uyayazi amagama eentlobo ezahlukeneyo zeeDinosaurs? (Phendula: T. rex, brontosaurus, triceratops).
