Repository: Ari-Ramkilowan/po-files
Catalog: translations/SGroup1(Release (open))_Venda.po
Languages: ven

source: This is the story, as well as Mandla’s actions and emotions: 1. Mandla wants to go and play with his friend Lebo (he’s excited) 😃 2. Mandla’s mama says he can go (he’s happy) 🙂 3. Mandla walks to Lebo’s house (he’s walking)🚶 4. When he gets to Lebo’s house she’s not there (he’s sad) 😞 5. So Mandla sits on the step and waits for her (he sits and feels tired) 😓 6. Lebo’s mama arrives (he’s pleased) 😁and Mandla asks where Lebo is (he’s polite) 🗣 7. She says that Lebo has gone to Mandla’s house (he’s surprised) 😱 8. Mandla runs home to find Lebo (he’s running). 🏃 9. She is there and he is happy. 😆 10. He hugs her. 🤗 You can add to the story to make it more exciting and give the children more chances to mime actions or express feelings.
ven: Tshiṱori khetsho, khathihi na nyito na vhuḓipfi ha Maanda: 1. Maanḓa u khou ṱoḓa u ya u tamba na khonani yawe Livhu (o takala nga maanḓa). 😃 2. Mme a Maanḓa vho tenda uri a ṱuwe (o takalesa). 🙂 3. Maanda u dzhena nḓuni ya ha Livhu (u khou tou tshimbila).🚶 4. Musi a tshi dzhena nḓuni ya ha Livhu o wana a siho (o vhaisala). 😞 5. Zwenezwo Maanḓa a dzula zwiṱepisini a mu lindela (o dzula fhasi nahone u ḓipfa o neta). 😓 6. Mme a Livhu vha khou dzhena (o takala) 😁 Maanḓa u vhudzisa uri Livhu u ngafhi (o tou khuthala). 🗣 7. Vha mu fhindula uri Livhu o ya ha Maanḓa (u a mangala). 😱 8. Maanḓa u gidimela hayani u wana Livhu (u khou tou gidima). 🏃 9. O mu wana a takalesa. 😆 10. A mu kuvhatedza. 🤗 Tshiṱori itshi vha nga tshiengedza uri tshi takadzese na u ṋea vhana zwikhala zwinzhi uri vha edzisele nga nyito kana u sumbedza vhuḓipfi.

source: Why not do The Feelings Story activity? 🎭
ven: Ndi ngani vha sa iti mushumo nga ha tshiṱori tsha nga ha zwipfi? 🎭

source: See what you need
ven: Zwine vha ṱoḓa

source: See how it works
ven: Zwi shumisa hani

source: Read the notes
ven: Kha vha vhale notsi

source: Back to menu
ven: Kha vha humele murahu kha zwirengomu (Menu)

source: Get ready for some acting. Lights, camera, action! 🎬 1. Tell the children the story, using puppets if you have them. 2. If not, use lots of actions, facial expressions and different voices to make it exciting. 3. Then ask the children to stand up. 4. Tell them the story again, one line at a time and ask the children to do the actions of the character Mandla. 5. Also encourage them to do facial expressions by saying, “What does a sad face look like?” or “Show me a happy face.” 6. Encourage them to take part and do any action they want to, so that they’re a part of the story.
ven: Kha vha ḓidzudzanyele u zwi tamba. Mavhone/Lights, Khamera/camera, nyito/action! 🎬 1. Kha vha ṱalutshedze tshiṱori vha tshi khou shumisa dziphaphethe arali vha nadzo. 2. Arali zwi songo ralo, kha vha tou zwi sumbedza nga u shumisa tshifhaṱuwo na u shandukisa ipfi uri zwi takadze nga maanda. 3. Vha kone u humbela vhana vha ime nga milenzhe. 4. Kha vha dovholole tshiṱori, mutaladzi nga mutaladzi vha humbele vhana uri vha sumbedze nyito dza mutambi Mandla. 5. Kha vha vha ṱuṱuwedze u shumisa tshifaṱuwo nga u amba uri, “tshifhaṱuwo tsho sinywaho tshi vhonala hani?” kana “ntsumbedzeni tshifhaṱuwo tsho takalaho.” 6. Kha vha ṱuṱuwedze vhana u dzhenelela na u ita nyito iṅwe na iṅwe ine vha funa, uri vha kone u vha tshipiḓa tsha tshiṱori.

source: This game develops:
ven: Mutambo uyu u bveledza:

source: ✔️Social skills ✔️Emotional skills
ven: ✔️Vhukoni kha zwa matshilisano ✔️Vhukoni kha zwa mihumbulo

source: This game is all about imagination, so all you need is the children, and the story in the notes. But you can use puppets
ven: Mutambo uyu u ndi wa ngau humbulela, zwenezwo zwine vha ṱoḓa ndi vhana fhedzi, khathihi na notsi nga ha nganea. Fhedzi vha nga shumisa na mipopi/phaphethe.
