Repository: Ari-Ramkilowan/po-files
Catalog: translations/SGroup6(Release (open))_South Ndebele.po
Languages: nbl

source: Read the notes
nbl: Funda amaAwathi

source: See what you need
nbl: Bona ukuthi utlhoga ini

source: See how it works
nbl: Bona ukuthi isebenza bunjani

source: Back to menu
nbl: Buyela erhelweni

source: Find the budding scientists and engineers in the class with the game Making Tunnels. 👩🏿‍🔬👨🏿‍🔬
nbl: Thola abangani abasosayensi namanjinyela ngeklasini ngomdlalo we - Making Tunnels. 👩🏿‍🔬👨🏿‍🔬

source: First you have to make the tunnel, then you show the children how it works. 🚇 1. Give each child 2 or 3 toilet rolls. 2. Help them to stick their toilet rolls together to make a long tunnel. 3. They can decorate their tunnel with paper and crayons if they want to. 4. Ask one of the children to hold the tunnel up straight. 5. Place a little bowl at the bottom of the tunnel to catch the stones. 6. Give other children stones and get them to ‘post’ the stones into the top of the tunnel. Use words like ‘up, down, through, top, bottom’ etc. 7. Allow older children to make more complex tunnels if they want to.
nbl: Kokuthoma kufuze wenze ithanela, bese utjengisa abantwana ukuthi lisebenza njani.. 🚇 1. Nikeza umntwana munye amarolo ama – 2 Awama ama - 3 . 2. Barhelebhe ukuwahlanganisa ukwenza ithaneli ede. 3. Bangayikghabisa ithaneli ngephepha nangamakhrayoni. 4. Bawa omunye ukuthi ayiphakamise. 5. Beka isikotlelo ngaphasi kwethanela ukubamba amatje. 6. Nikela abanye abantwana amatje bese uthi ‘bawapose’ phezuzulu kwethaneli. Sebenzisa amagama afana nala’phezulu, phasi, phakathi, ngaphezulu, ngaphasi, njll.’ 7. Vumela abantwana abakhulu ukuthi benze amanye amathanela abudisi nabafunako.

source: ✔️Exploring & Finding Out ✔️Arm & hand control
nbl: ✔️Ukuhlola Awakuthola ✔️Ukulawula umkhoAwa nesandla

source: Because you’re teaching kids about gravity, it’s a good idea to ask them lots of questions about how they think it works. ⚗ Easiest version • How tall is our tunnel? • How many toilet rolls have we used? More advanced version • What will happen to this stone? • Where will it land? • Whose turn is it now? For older children • Do it 10 times • How many times did it land in the bowl? • How many times did it NOT land in the bowl? • Tell me about your decoration.
nbl: Ngombanyana ufundisa abantwana ngamandla , mboAwa omuhle ukubabuza imibuzo eminengi ukuthi bacabanga bona isebenza njani. ⚗ Ileveli yoku - 1 • Ithanela yide kangangani? • Sisebenzise amaphepha wethoyilethi amangaki? Ileveli Iyei - 2 • Kuzakwenzekani ngelitjeli? • Lizakuwela kuphi? • Sekulandela bani nje? Ileveli Iyei - 3 • Yenza kube yi - 10 • Iwele kangaki esikotleleni? • Kukangaki lapho INGAKAWELI esikotleleni? • Ngitjela ngomkghabiso wakho.

source: This game develops:
nbl: Umdlalo lo uthuthukisa:

source: This game is a fun way to combine crafts with learning, and let’s kids make their own toys. 1. Empty toilet rolls (2 per child) 2. Sticky tape 3. Stones 4. Paper (optional) 5. Crayons (optional)
nbl: Umdlalo lo indlela emnandi yokuhlanganisa ubukghwari Awakufunda begodu yenza abantwana bazenzele amathoyisi wabo.Uzakutlhoga: 1. Amarolo wephepha lethoyilethi anganalitho ( ma - 2 umntwana ngamunye) 2. Irhomu 3. Amatje 4. Iphepha (nawuthandako) 5. Amakhrayoni (nawuthandako)
