Repository: Ari-Ramkilowan/po-files
Catalog: translations/SGroup14(Release (open))_Tsonga.po
Languages: tso

source: Read the notes
tso: Hlaya tinotsi

source: See what you need
tso: Vona leswi u swi lavaka

source: See how it works
tso: Vona leswaku swi tirha njhani

source: Back to menu
tso: Ku tlhelela eka menyu

source: While their creative juices are flowing, get their brains going by asking them some questions. Level 1 • What colour is this? • What shape is this • How many colours can you see? • Where will you stick this? Level 2 • How many pieces do you have? • What pattern is this? Level 3 • How will you use these pieces to make a picture? • What is your picture? • Can you tell me about it? • Can you make your name?
tso: Loko va ha taleriwe hi mafulufulu ya vutumbuluxi, va tlhontlhi miehleketo ku ya emahlweni hi ku va vutisa swivutiso swo karhi. Levhele ya 1 • Xana lowu i muhlovo muni? • Xana lexi i xivumbeko xa njhani? • Xana u vona mihlovo yingani? • Xana lexi u nga xi damarheta kwihi? Levhele ya 2 • Xana u na swiphemu swingani? • Xana leyi i phetheni yihi? Levhele ya 3 • Xana u nga tirhisa njhani swiphemu leswi ku endla xifaniso? • Xana xifaniso xa wena i yini? • Xana u nga ndzi byela haxona? • Xana u nga endla vito ra wena?

source: ✔️Arm & Hand Control ✔️Numbers , Shapes & Sizes
tso: ✔️Ku lawula voko na xandla ✔️Tinomboro, swivumbeko na tisayizi

source: Now it’s time to turn trash into treasure. 1. Make sure the chip packets are clean. 2. Ask the kids to share the chip packets between themselves. 3. Then ask them to cut or tear up chip packets into small pieces or shapes. 4. Get them to stick these pieces of chip packet onto the paper. 5. Encourage creativity as they make their pictures. 6. Talk about shapes, sizes, colour, texture, patterns, etc. 7. Help them to cut and stick as is needed. 8. Older children can even make spell their names out with the pieces.
tso: Sweswi i nkarhi wo cinca thyaka ri va xilo xo durha. 1. Vona leswaku maphakiti ya mazimba ya basile. 2. Byela vana va avelana maphakiti ya mazimba. 3. Kutani u va byela ku tsema kumbe ku tsemelela maphakete ya mazimba ya va swiphemu lswintsongo kumbe swivumbeko. 4. Endla leswaku va damarheta swiphemu leswi swa maphakete ya mazimba ephepheni. 5. Khutaza vutumbuluxi loko va ri karhi va endla swifaniso swa vona. 6. Vulavula hi swivumbeko, tisayizi, muhlovo, fukelo, tiphetheni, na swin’wana 7. Va pfuni ku tsema na ku damarheta tanihilaha swi lavekaka hakona. 8. Vana lavakulu va nga ha peleta mavito ya vona hi ku tirhisa swiphemu swa swiphephana.

source: Use Chip Packet Fun to teach the kids about not only making art, but recycling too.🥔
tso: Tirhisa ku Hungasa hi Phakete ya Mazimba ku dyondzisa vana ku nga ri vutshila ntsena, kambe na ku tirhisa hi ku vuyelela.🥔

source: If there’s litter in the area, why not get the kids to collect it and throw it away while they look for chip packets? This is what you’ll for this game: • A clean chip packet per child • Piece of paper per child • Glue and scissors
tso: Loko ku ri na thyaka endhawini, hikokwalaho ka yini u nga endli leswaku vana va ri rholela na ku ri cukumeta ekule loko va ri karhi va lava maphekete ya mazimba? U ta lava leswi eka ntlangu lowu: • Phakete ra mazimba leri nga basa hi n’wana • Xiphephana hi n’wana • Dlilu • Xikero

source: This game develops:
tso: Ntlangu lowu wu ya emahlweni:
