Repository: Ari-Ramkilowan/po-files
Catalog: translations/SGroup12(Release (open))_South Ndebele.po
Languages: nbl

source: It’s time for these budding entrepreneurs to learn about the value of money. 1. Give each child their coin rubbings from the previous activity. 2. Ask them to cut out the coins. 3. Help those that need it. 4. Help them to fold over their piece of paper to make a purse. 5. Ask the children to put their coins into their new purse for safekeeping. 6. Set up a shop. 7. Talk about the items in your shop as you set up. 8. Have words under your items. Eg, milk, bread, cereal, etc. 9. Ask each child to come to your shop and buy something. 10. When they give you their money, tell them what they can buy with it. 11. Talk as you play and ask questions to help the children learn. 12. For the older children, ask them for money and give them change.
nbl: Sikhathi sokobana abangani bamabhizinisi bafunde ngokubaluleka kwemali. 1.Nikela umntwana ngamunye ihlamvu elitlikitliweko lesifundweni esidlulile. 2.Babawe ukuthi basike iinhlamvu. 3.Rhelebha labo abafuna irhelebho. 4.Basize ukugoqa isiquntu sephepha ukwenza isikhwama. 5.Bawa abantwana ukuthi bafake iinhlamvu zabo esikhwameni zizobulungeka ziphephile. 6.Yenza isitolo. 7.Coca ngezinto ezisesitolo sakho nawusenzako. 8.Tlola ammagama ngaphasi kwalezo zinto. Isibonelo, ibisi, uburotho, isireli, njll. 9.Bawa umntwana ngamunye ukuthi eze esitolo azokuthenga okuthile. 10.Nabakunikela imali, batjele ukuthi bangathenga ini ngayo. 11.Coca njengoba nidlala bese ubuza imibuzo ukubasiza ukuthi bafunde. 12.Ebantwaneni abakhulu, babawe ukuthi babhadele okuthile bese ubapha itjintji.

source: See what you need
nbl: Bona ukuthi utlhoga ini

source: See how it works
nbl: Bona ukuthi isebenza bunjani

source: Read the notes
nbl: Funda amaAwathi

source: Back to menu
nbl: Buyela erhelweni

source: Spending money is easy, it’s saving money that’s hard. Try remind the children how important saving is while you talk to them. 🏦 Level 1 • Where do you keep your money? • What do you want to buy at my shop? • What are you going to cook with these things…? • What else would you like to buy? Level 2 • How much money have you got? • That will cost… Level 3 • Have you got any money left? • Would you like to use that money to buy something else? • Do you have enough? • Or would you rather save it for next time? • What sounds does milk start with? (mmmm) • What sound does fish start with? (ffff)
nbl: Ukusebenzisa imali kulula, kuyibulunga okubudisi. Khumbuza abantwana ukuthi kuqakatheke kangangani ukubulunga imali nawukhuluma nabo. 🏦 Ileveli yoku - 1 • Uyibeka Kuphi imalakho? • Ufuna ukuthenga ini esitolo sami? • Uyokupheka ini ngeentwezo? • Khuyini futhi ongathanda ukukuthenga? Ileveli Iyei - 2 • Ingangani imali onayo? • Lokho kuzobiza… Ileveli Iyei - 3 • Unayo imali esele? • Ungathanda ukuyisebenzisa uthenge okhunye? • Unayo eyaneleko? • Awama kungcoAwa uyibulungele isikhathi esizako? • Ibisi lithoma ngamuphi umsindo? (b) • Ifesi ithoma ngamuphi umsindo? (f)

source: Let’s put the Money Rubs the children did to good use with Spending Coins!💰
nbl: Asithathe imali abayitlikitlileko i - Money Rubs siyisebenzise kuhle ngeenhlamvu zokuthenga -Spending Coins! 💰

source: This game develops:
nbl: Umdlalo lo uthuthukisa:

source: ✔️Talking & Understanding ✔️Social
nbl: ✔️Ukukhuluma Awakuzwisisana ✔️AmakghoAwa aphathelene Awamphakathi

source: Now that the children have created their own money during the previous activity, it’s time to give them something to spend it on. You’ll need: 1. Coin drawings from the previous Small Group Activity. 2. Scissors. 3. A piece of paper for each child to make a purse. 4. Empty food containers such as cereal boxes, milk bottles, egg boxes, etc. Have enough for each child to “buy” a few items. 🍞🥔🥚
nbl: Manje ngombana abantwana bazenzele yabo imali esifundweni esidlulile, sikhathi sokubanikela imali bona bayisebenzise. Uzakuthloga: Iinhlammvu zemidwebo zesifundo esidlulile sesifundo esidlulile soMsebenzi wesiQhema esiNcane. Iskere. Isiquntu sephepha umntwana ngamunye ukwenza isikhwama. Ibhokisi elingenalitho lamasireli, ibhodlelo lebisi, ibhokisi lamaqanda, njll. Iba Awakwanele umntwana ngamunye azokwazi ukuthenga. 🍞🥔🥚
