Repository: Ari-Ramkilowan/po-files
Catalog: translations/SGroup2(Release (open))_Zulu.po
Languages: zul

source: See what you need
zul: Bheka ukuthi yini oyidingayo

source: Read the notes
zul: Funda amanothi

source: Back to menu
zul: Buyela kumenyu

source: It’s time to play Knock Down Skittles. 🎳
zul: Sekuyisikhathi sokudlala i-Knock Down Skittles. 🎳

source: This game develops:
zul: Lo mdlalo uthuthukisa:

source: ✔️Arm & Hand Control ✔️Numbers , Shapes and Sizes
zul: ✔️Ikhono lokulawula izingalo nezandla ✔️Izinombolo, imimo nosayizi

source: This is a great to get the children playing in groups together so that they can make new friends. 1. A set of skittles (3 to 5). You can make these out of empty drinking bottles, but not glass. 2. A ball (you can make this out of plastic bags and onion bags). 3. Space to play skittles.
zul: Leli yithuba elihle kakhulu lokuba izingane zidlale ndawonye ngamaqembu ukuze zikwazi ukuthola abangani abasha. 1. Isethi yama-skittles (ama-3 kuya kwama-5). Ungawenza ngamabhodlela kadilinki angenalutho, kodwa hhayi ayingilazi. 2. Ibhola (ungakwenza lokhu ngezikhwama zepulastiki nezikhwama zika-anyanisi). 3. Indawo yokudlala ama-skittles.

source: See how it works
zul: Bheka ukuthi kusebenza kanjani

source: It’s also really straightforward, and you can play it over and over. All you have to do is: 1. Line the skittles up in a row. 2. Line the children up in front of the skittles. 3. Together take 5 steps back and count out loud as they step backwards. 4. Give each child a turn to roll the ball towards the skittles. 5. The ball should not leave the ground. 6. Reset the skittles when they have been knocked over. 7. This time take six steps back. 8. Have the children throw under arm first. 9. Then throw overarm. 10. Throw ball with two hands. 11. Throw ball with one hand.
zul: Kulula nje, futhi ningawudlala niphindelele. Enidinga nje ukukwenza ukuba: 1. Nikelise ama-skittles enze ulayini. 2. Ukelise izingane phambi kwama-skittles. 3. Ndawonye zithathe izinyathelo ezi-5 eziya emuva futhi zibale ziphimisele ngenkathi zihlehla ziya emuva. 4. Nika ingane ngayinye ithuba lokugingqa ibhola liqondiswe kuma-skittles. 5. Ibhola akufanele lisuke phansi. 6. Setha kabusha ama-skittles uma eshayisekile awa. 7. Kulokhu thatha izinyathelo eziyisithupha ezibuyela emuva. 8. Tshela izingane ziphonse ingalo eyesingezansi kuqala. 9. Bese ziphonsa ingalo yangenhla. 10. Phonsa ibhola ngezandla ezimbili. 11. Phonsa ibhola ngesandla esisodwa.

source: But it’s not just physical, you can also use these questions to help the kids learn more: Before you start: • How many skittles can you see? • What colours are they? While you’re taking turns: • How many did you knock over? • How many are left? • Can you catch the ball with 2 hands? Before you start the next round: • How many steps should we take now? • Is that more or less than last time? • Can you catch the ball 1-handed?
zul: Kodwa akusebenzisi umzimba kuphela. Ungasebenzisa le mibuzo ukusiza izingane zifunde okuningi: Ngaphambi kokuba uqale: • Mangaki ama-skittles owabonayo? • Anjani umbala? Ngenkathi nishintshisana: • Mangaki owashaye awa? • Mangaki asale emile? • Uyakwazi ukubamba ibhola ngezandla ezi-2? Ngaphambi kokuqala umzuliswano olandelayo: • Zingaki izinyathelo okufanele sizithathe manje? • Ingabe lokho kungaphezu noma kungaphansi kwalezi zangaphambilini? • Uyakwazi ukubamba ibhola ngesandla esisodwa?
