Repository: Ari-Ramkilowan/po-files
Catalog: translations/SGroup13(Release (open))_Venda.po
Languages: ven

source: Read the notes
ven: Kha vha vhale notsi

source: See what you need
ven: Zwine vha ṱoḓa

source: See how it works
ven: Zwi shumisa hani

source: Back to menu
ven: Kha vha humele murahu kha zwirengomu

source: Make sure the children don’t get too excited and take a bite out of their playdough! 🤢 1. Tell the children that they’re going to make an ice cream. 2. Talk about ice creams. 3. Show them how to roll the play dough into long, thin sausages, and then roll them round and round, making a circle. 4. Put a stick in to make an ice cream. 5. Show them the other kinds of ice creams you can make by rolling balls and decorating them. 6. Have fun, ask questions, and talk to help the children learn more as they play. 7. Set up an ice cream shop to sell the ice creams. 8. Put up pictures of the different kinds of flavours there are. 9. Sing a rhyme about ice cream if you want to. RHYME: I scream, you scream, we ALL scream for ice cream!
ven: Kha vha vhone uri vhana a vha khou takalesa vha vho ḽa vumba! 🤢 1. Kha vha vhudze vhana uri vha khou ḓo u ita aisi-khirimu. 2. Kha vha ambe nga ha aisi-khirimu. 3. Kha vha vha sumbedze uri vha vhumbuludza hani vumba ḽa vha ḽilapfu, u fana na vorosi/sosedzhi, vha kone u ḽi monisa ḽi ite tshipumbulu. 4. Kha vha dzhenise tshitanda vha ite aisi khirimu. 5. Kha vha vha sumbedze aisi-khirimu dza vhaṅwe vhana dzine vha nga ita nga u dzivhumbuludza dza nga bola vha dzi khavhisa. 6. Kha vha ḓiphine, vha vhudzise mbudziso, na u amba navho u itela u thusa vhana u guda zwinzhi musi vha tshi khou guda. 7. Kha vha ite vhengele ḽa aisi-khirimu u rengisa aisi-khirimu idzo. 8. Kha vha vhee zwifanyiso zwa tshakha dzo fhambanaho dza muthetshelo. 9. Kha vha imbe mutevhetsindo nga ha aisi-khirimu arali vha tshi tama u ita ngauralo. MUTEVHETSINDO: Ndi a vhidzelela, ndi a vhidzelela, roṱhe ri huwelelea uri aisia-khirimu!

source: Ask the children some questions to help their imaginations run wild. Level 1 • What ice creams do you like? • When do you eat them? • How do you feel when you have an ice cream? • What colour are you going to make? • What shape do you like? • Etc. Level 2 • What flavour are your ice creams? • How many do we have now? • Should we set up and ice cream shop? Level 3 • How much do your ice creams cost? • I only have this amount of money. Do I need change?
ven: Kha vha vhudzise vhana mbudziso u itela u vha thusa kha uri vha kone u humbula zwiṅwe na zwiṅwe. Ḽiga 1 • Ni funa aisi-khirimu ifhio? • Ni iḽa lini? • Ni ḓipfa hani arali no fara aisi-khirimu? • Ni khou ya u ita ya muvhala ufhio? • Ni funa tshivhumbeo tshifhio? • Na zwiṅwevho. Ḽiga 2 • Aisi-khirimu dza vhoiwe ndi dza muthetshelo ufhio? • Zwa zwino ri na nngana? • Ri tea u ita vhengele ḽa aisikhirimu? Ḽiga 3 • Aisi khirimu yaṋu ndi vhugai? • Ndi tou vha na heyi tshelede fhedzi. Ndi ḓo wana tshentshi?

source: ✔️Talking & Understanding ✔️Arm & hand control
ven: ✔️U amba na u pfesesa ✔️Ndaulo ya tshanḓa tshoṱhe

source: This is a great game to play during summer, and the good news is that these Playdough Ice Creams won’t melt. 🍦
ven: Uyu ndi mutambo wavhuḓisa wa u tamba tshilimo, nahone mafhungo avhuḓi ndi a uri aisi-khirimu ya vumba ḽa u tambisa a i ṋoki. 🍦

source: This one is super simple! All that’s needed is: 1. Playdough in a few different colours. 2. Ice cream sticks or something that could be used as an ice cream stick.
ven: Izwi zwo leluwa nga maanḓa! Zwine vha ṱoḓa ndi: 1. Vumba ḽa u tambisa nga mivhala yo fhambanaho i si gathi. 2. Zwitanda zwa aisi-khirimu kana zwithu zwine zwa nga shumiswa sa zwitanda zwa aisi khirimu.

source: This game develops:
ven: Mutambo uyu u bveledza:
