Repository: Ari-Ramkilowan/po-files
Catalog: translations/SGroup20(Release (open))_Pedi; Sepedi;  Northern Sotho.po
Languages: nso

source: See how it works
nso: Bona ka moo e šomago ka gona

source: Animal Pond
nso: Ge e le gore ga se wa tšwa o anegela bana kanegelo lehono, mošomo wa Letangwana la Diphoofolo e tla ba mošomo o mokaonekaone. 🐘🐂🐪

source: Read the notes
nso: Bala dinoutse

source: Back to menu
nso: Re boela morago go menyu

source: See what you need
nso: Bona se o se hlokago

source: Let the children build on their brilliant stories by asking them these questions: Level 1 • What animal do you have? • Where does he want to go? • How will you help him? • What will you build? • How will you build it? • How will the animal cross? • Where is he going now? Level 2 • How does your goat feel? • What does he feel that way? • What will make him feel scared? • What will make him feel safe and happy? Level 3 • Tell me the story of your little goat.
nso: E re bana ba hlame dikanegelo tše kaonekaone ka go ba botšiša dipotšišo tše di latelago: Kgato ya 1 • Phoofolo ye o nago le yona ke efe? • Naa e nyaka go ya kae? • Naa o ka e thuša bjang? • Ke eng seo o tla se agago? • O tlile go se aga bjang? • Naa phoofolo e tla se putla bjang? • Naa e lebile kae gabjale? Kgato ya 2 • Naa pudi ya gago e ikwa bjang? • Ke ka lebaka la eng e ikwa ka tsela yeo? • Ke eng se se tla dirago gore e ikwe e tšhogile? • Ke eng se se tla dirago gore e ikwe le bolokegile ebile e thabile? Kgato ya 3 • Nkanegele kanegelo ka pudi ya gago ye nnyane.

source: This game develops:
nso: Papadi ye e kaonafatša:

source: ✔️Skills for Learning ✔️Exploring & Finding Out
nso: ✔️Bokgoni bja go ithuta ✔️Go nyankolla le go utolla

source: So many benefits, so few items needed: 1. Duplo LEGO blocks 2. Plastic animals 3. Blue paper 4. Scissors
nso: Dikholego tše ntši, ka gona go nyakega didirišwa tše nnyane: 1. Dipoloko tša DUPLO LEGO 2. Diphoofolo tša polastiki 3. Pampiri ye talalerata 4. Sekero

source: How does it work? 1. Cut a circle out of the blue paper and use it as the pond. 2. Tell the story about a little animal who is trying to get across the pond to see its mommy. 3. It can’t swim and it’s too far to walk around the pond. 4. Divide the children into pairs and give them some duplo blocks. 5. Ask them to build a bridge for the little animal. 6. Once they have finished, ask them to show you how their animal crosses the bridge 7. Get them to tell you the story in their own way
nso: Naa e šoma bjang? 1. Ripa sediko sa go tšwa pampiring ye talalerata gomme o šomiše bjalo ka letangwana. 2. Anega kanegelo mabapi le phoofotšwana ye e lekago go tshela letangwana go hwetša mmago yona. 3. Ga e kgone go rutha le gona ke kgole go ka sepela go rarela letangwana. 4. Arola bana ka diripa tše pedi tše pedi gomme o ba fe ditena tša DUPLO. 5. Ba kgopele go agela phoofotšwana leporogo. 6. Morago ga gore ba fetše, ba kgopele gore ba go bontšhe ka moo phoofolo e namelago leporogo ka gona 7. E re ba go anegele kanegelo ka tsela ya bona.
