Repository: Ari-Ramkilowan/po-files
Catalog: translations/SGroup1(Release (open))_Tswana.po
Languages: tsn

source: This is the story, as well as Mandla’s actions and emotions: 1. Mandla wants to go and play with his friend Lebo (he’s excited) 😃 2. Mandla’s mama says he can go (he’s happy) 🙂 3. Mandla walks to Lebo’s house (he’s walking)🚶 4. When he gets to Lebo’s house she’s not there (he’s sad) 😞 5. So Mandla sits on the step and waits for her (he sits and feels tired) 😓 6. Lebo’s mama arrives (he’s pleased) 😁and Mandla asks where Lebo is (he’s polite) 🗣 7. She says that Lebo has gone to Mandla’s house (he’s surprised) 😱 8. Mandla runs home to find Lebo (he’s running). 🏃 9. She is there and he is happy. 😆 10. He hugs her. 🤗 You can add to the story to make it more exciting and give the children more chances to mime actions or express feelings.
tsn: Se ke setori, gammogo le ditiragatso tsa ga Mandla le maikutlo. 1. Mandla o batla go ya go tshameka le tsala ya gagwe Lebo (ga a tshwarege). 😃 2. Mmaagwe Mandla a re o ka tsamaya (o itumetse). 🙂 3. Mandla o tsamaya ka dinao go ya kwa ntlong ya ga Lebo (o tsamaya ka dinao). 🚶 4. Fa a ya kwa ntlong ya gabo Lebo o fitlhela a seyo (o hutsafetse)😞 5. Jalo Mandla o nna mo setepising a mo letile (o nna fa fatshe a ikutlwa a lapile) 😓 6. Mamaago Lebo o a goroga (o itumeletse seo) 😁 mme Mandla o botsa gore Lebo o kae (o maitseo). 🗣 7. A re Lebo o ile kwa gaabo Mandla (o gakgametse). 😱 8.Mandla o tabogela kwa gae go batla Lebo (o tabogile).🏃 9. O mo fitlhela koo mme o itumetse. 😆 10. O a mo tlamparela ka lorato. 🤗 O ka oketsa setori seno go se dira gore se itumedise mme o neye bana ditshono tse dingwe tsa go etsisa ditiragatso kgotsa go bontsha maikutlo a bone.

source: Why not do The Feelings Story activity? 🎭
tsn: Goreng le sa dire tirwana ya Setori sa Maikutlo? 🎭

source: See what you need
tsn: Bona se o se tlhokang

source: See how it works
tsn: Bona kafa o berekang ka teng

source: Read the notes
tsn: Bala dintlha

source: Back to menu
tsn: Boela kwa mmenyung

source: Get ready for some acting. Lights, camera, action! 🎬 1. Tell the children the story, using puppets if you have them. 2. If not, use lots of actions, facial expressions and different voices to make it exciting. 3. Then ask the children to stand up. 4. Tell them the story again, one line at a time and ask the children to do the actions of the character Mandla. 5. Also encourage them to do facial expressions by saying, “What does a sad face look like?” or “Show me a happy face.” 6. Encourage them to take part and do any action they want to, so that they’re a part of the story.
tsn: Ipaakanyetse go diragatsa. Dipone, khamera, diragatsa! 🎬 Bolelela bana setori, o dirisa dipopae fa e le gore o na le tsone. Fa o se na tsone, dirisa ditiragatso tse dintsi, go bontsha maikutlo ka sefatlhego le mantswe a a farologaneng go dira gore go kgatlhise. O bo o kopa bana gore ba eme ka dinao. O bo o ba bolelela setori gape, mola o le mongwe ka nako e le nngwe o bo o kopa bana go diragatsa ditiro dingwe tsa moanelwa Mandla. Gape ba kgothaletse go bontsha maikutlo a bone ka difatlhego ka go re, “Sefatlhego se se hutsafetseng se lebega jang?” kgotsa, “Mpontsheng sefatlhego se se itumetseng.” Ba kgothaletse go tsaya karolo le go dira tiragatso epe e ba e batlang, gore ba nne karolo ya setori.

source: This game develops:
tsn: Motshameko o o a tswelela:

source: ✔️Social skills ✔️Emotional skills
tsn: ✔️Bokgoni jwa tirisano le batho ✔️Bokgoni jwa maikutlo

source: This game is all about imagination, so all you need is the children, and the story in the notes. But you can use puppets
tsn: Motshameko o ke wa go itlhamela fela, jalo se o se tlhokang fela ke bana, le setori sa dintlha tse di kwadilweng. Mme o ka dirisa dipopae.
