Repository: Ari-Ramkilowan/po-files
Catalog: translations/SGroup20(Release (open))_South Ndebele.po
Languages: nbl

source: See how it works
nbl: Bona ukuthi isebenza bunjani

source: Animal Pond
nbl: Nange ungakabacoceli iAwalwana namhlanjesi, i- Animal Pond ingaba umsebenzi omuhle. 🐘🐂🐪

source: Read the notes
nbl: Funda amaAwathi

source: Back to menu
nbl: Buyela erhelweni

source: See what you need
nbl: Bona ukuthi utlhoga ini

source: Let the children build on their brilliant stories by asking them these questions: Level 1 • What animal do you have? • Where does he want to go? • How will you help him? • What will you build? • How will you build it? • How will the animal cross? • Where is he going now? Level 2 • How does your goat feel? • What does he feel that way? • What will make him feel scared? • What will make him feel safe and happy? Level 3 • Tell me the story of your little goat.
nbl: Lisa abantwana baragele phambili ngeAwalwana yabo ekarisako ngokubabuza imibuzo le. Ileveli yoku - 1 • Ngisiphi isilwana onaso? • Ufuna ukuya kuphi? • Uzomrhelebha bunjani? • Uzokwakha ini? • Uzoyakha bunjani? • Isilwanyana sizokweqa njani? • Uyaphi nje? Ileveli Iyei - 2 • Imbuzi yakho izizwa njani? • Kuba yini izizwe ngaleyo ndlela? • Khuyini okungayithusa? • Yini okungamenza athabe begodu avikeleke? Ileveli Iyei - 3 • Ngitjela iAwalwana yembuzi encane.

source: This game develops:
nbl: Umdlalo lo uthuthukisa:

source: ✔️Skills for Learning ✔️Exploring & Finding Out
nbl: ✔️AmakghoAwa wokufunda ✔️Ukuhlola Awakuthola

source: So many benefits, so few items needed: 1. Duplo LEGO blocks 2. Plastic animals 3. Blue paper 4. Scissors
nbl: Kuningi ongakuzuza, zincane izinto ozitlhogako: 1.Amabhlogo we - DUPLO LEGO 2.Iinlwana zeplastiki 3.Iphepha elihlaza 4.Iinkere

source: How does it work? 1. Cut a circle out of the blue paper and use it as the pond. 2. Tell the story about a little animal who is trying to get across the pond to see its mommy. 3. It can’t swim and it’s too far to walk around the pond. 4. Divide the children into pairs and give them some duplo blocks. 5. Ask them to build a bridge for the little animal. 6. Once they have finished, ask them to show you how their animal crosses the bridge 7. Get them to tell you the story in their own way
nbl: Isebenza bunjani? 1.Sika isiyingi ephepheni elihlaza, ullisebenzise njengesiziba. 2.Coca iAwalwana ngesilwanyana esincani esizama ukweqa isiziba siyobona unina. 3.Asikwazi ukududa, kukude ukukhamba esizibeni. 4.Hlukanisa abantwana ngamapara, ubanikele amabhlogo we - DUPLO. 5.Batjele bakhele isilwanyana ibhrorho. 6.Nabaqedileko, babawe bakutjengise ukuthi isilwanyana sizakweqa njani ibhroro. 7.Mabakutjele bona iAwalwana le ngendlela yabo.
