Repository: Ari-Ramkilowan/po-files
Catalog: translations/SGroup6(Release (open))_Tswana.po
Languages: tsn

source: Read the notes
tsn: Bala dintlha

source: See what you need
tsn: Bona se o se tlhokang

source: See how it works
tsn: Bona kafa o tshamekiwang ka teng

source: Back to menu
tsn: Boela kwa mmenyung

source: Find the budding scientists and engineers in the class with the game Making Tunnels. 👩🏿‍🔬👨🏿‍🔬
tsn: Batla borasaense ba ba santseng ba ithuta le diinjineere mo phaposing ya borutelo ka motshameko wa Go Dira Dithanele. ‍‍👩🏿‍🔬👨🏿‍🔬

source: First you have to make the tunnel, then you show the children how it works. 🚇 1. Give each child 2 or 3 toilet rolls. 2. Help them to stick their toilet rolls together to make a long tunnel. 3. They can decorate their tunnel with paper and crayons if they want to. 4. Ask one of the children to hold the tunnel up straight. 5. Place a little bowl at the bottom of the tunnel to catch the stones. 6. Give other children stones and get them to ‘post’ the stones into the top of the tunnel. Use words like ‘up, down, through, top, bottom’ etc. 7. Allow older children to make more complex tunnels if they want to.
tsn: Santlha o tshwanetse go dira thanele, o bo o bontsha bana gore e dira jang. 🚇 1. Naya ngwana mongwe le mongwe dirolo di le 2 kgotsa 3 tsa pampiri ya thoelete. 2. Ba thuse gore ba kgomaretsanye dirolo tsa bone tsa pampiri ya thoelete go dira thanele e telele. 3. Ba ka kgabisa dithanele tsa bone ka dipampiri le dikerayone fa ba batla. 4. Kopa mongwe wa bana go tshwara thanele a e lebisitse kwa godimo. 5. Baya mogoponyana o monnye kwa tlase ga thanele gore matlapa a wele mo go one. 6. Naya bana ba bangwe matlapa mme o dire gore ba ‘posetse’ matlapa kwa godimo ga thanele. Dirisa mafoko a ‘go ya kwa godimo, go ya kwa tlase, go tswa kwa godimo, go tswa kwa tlase' jalo jalo. 7. Dira gore bana ba bagolwane ba dire dithanele tse di raraaneng fa ba batla go dira jalo.

source: ✔️Exploring & Finding Out ✔️Arm & hand control
tsn: ✔️Go tlhotlhomisa le goiitse ✔️Taoloya lebogo le seatla

source: Because you’re teaching kids about gravity, it’s a good idea to ask them lots of questions about how they think it works. ⚗ Easiest version • How tall is our tunnel? • How many toilet rolls have we used? More advanced version • What will happen to this stone? • Where will it land? • Whose turn is it now? For older children • Do it 10 times • How many times did it land in the bowl? • How many times did it NOT land in the bowl? • Tell me about your decoration.
tsn: Ka gonne o ruta bana ka maatlakgogedi, ke mogopolo o o molemo go ba botsa dipotso tse dintsi ka gore ba akanya gore e bereka jang. ⚗ Maemo 1 • Thanele e boleele bo kae? • Re dirisitse dirolo di le kae tsa pampiri ya thoelete? Maemo 2 • Go tlile go diregang ka letlapa le? • Le tlile go wela kae? • Jaanong ke tshono ya ga mang? Maemo 3 • Dira jalo makgetlo a le 10 • A wetse mo mogoponyaneng makgetlo a le kae? • GA A wela mo mogoponyaneng makgetlo a le kae? • Ntlhalosetse ka mokgabiso wa gago.

source: This game develops:
tsn: Motshameko o o a tswelela:

source: This game is a fun way to combine crafts with learning, and let’s kids make their own toys. 1. Empty toilet rolls (2 per child) 2. Sticky tape 3. Stones 4. Paper (optional) 5. Crayons (optional)
tsn: Motshameko o ke tsela e e jesang monate ya go kopanya botsweretshi le go ithuta, mme e dira gore bana ba itirele dithoye tsa bone. O tla tlhoka: 1. Dirolo tsa pampiri ya mo thoeleteng tse di senang sepe (di le 2 ngwana mongwe le mongwe) 2. Theipi e e ngaparelang 3. Matlapa 4. Pampiri (fa o batla) 5. Dikerayone (fa o batla)
