Repository: Ari-Ramkilowan/po-files
Catalog: translations/SGroup6(Release (open))_Zulu.po
Languages: zul

source: Read the notes
zul: Funda amanothi

source: See what you need
zul: Bheka ukuthi yini oyidingayo

source: See how it works
zul: Bheka ukuthi kusebenza kanjani

source: Back to menu
zul: Buyela kumenyu

source: Find the budding scientists and engineers in the class with the game Making Tunnels. 👩🏿‍🔬👨🏿‍🔬
zul: Thola ososayensi nonjiniyela abasafufusa ekilasini ngomdlalo Wokwenza Imihubhe. 👩🏿‍🔬👨🏿‍🔬

source: First you have to make the tunnel, then you show the children how it works. 🚇 1. Give each child 2 or 3 toilet rolls. 2. Help them to stick their toilet rolls together to make a long tunnel. 3. They can decorate their tunnel with paper and crayons if they want to. 4. Ask one of the children to hold the tunnel up straight. 5. Place a little bowl at the bottom of the tunnel to catch the stones. 6. Give other children stones and get them to ‘post’ the stones into the top of the tunnel. Use words like ‘up, down, through, top, bottom’ etc. 7. Allow older children to make more complex tunnels if they want to.
zul: Okokuqala kufanele wakhe umhubhe, bese ukhombisa izingane ukuthi usebenza kanjani. 🚇 1. Nikeza ingane ngayinye izingqwembe zama-toilet rolls ezi-2 noma ezi-3. 2. Zisize zizinamathelise ndawonye ukwenza umhubhe omude. 3. Zingahlobisa imihubhe yazo ngephepha namakhrayoni uma zifuna. 4. Cela eyodwa yezingane ibambe umhubhe wayo uqonde. 5. Beka indishi encane ezansi nomhubhe ukuze ubambe amatshe. 6. Nikeza ezinye izingane amatshe bese uzitshela ‘ziphoste’ amatshe phezulu komhubhe. Sebenzisa amagama afana nathi ‘phezulu, phansi, phakathi, enhla, ezansi’ njll. 7. Zidedele izingane ezindadlana zakhe imihubhe elukhunyana uma zithanda.

source: ✔️Exploring & Finding Out ✔️Arm & hand control
zul: ✔️Amakhono okufunafuna ✔️Amakhono okulawula ingalo nesandla

source: Because you’re teaching kids about gravity, it’s a good idea to ask them lots of questions about how they think it works. ⚗ Easiest version • How tall is our tunnel? • How many toilet rolls have we used? More advanced version • What will happen to this stone? • Where will it land? • Whose turn is it now? For older children • Do it 10 times • How many times did it land in the bowl? • How many times did it NOT land in the bowl? • Tell me about your decoration.
zul: Ngenxa yokuthi ufundisa izingane mayelana nomfuthomandla wokudonsela phansi komhlaba, phecelezi i-gravity, kungumqondo omuhle ukuba uzibuze imibuzo eminingi mayelana nokuthi zicabanga ukuthi isebenza kanjani. ⚗ Izinga 1 • Mude kangakanani umhubhe wethu? • Zingaki izingqwembe zama-toilet rolls esizisebenzisile? Izinga 2 • Kuzokwenzekani ngaleli litshe? • Lizowela kuphi? • Kulandela bani manje? Izinga 3 • Kwenze izikhathi eziyi-10 • Iwele kangaki endishini? • Zingaki izikhathi lapho INGAZANGE iwele endishini? • Ake ungixoxele ngomhlobiso.

source: This game develops:
zul: Lo mdlalo uthuthukisa:

source: This game is a fun way to combine crafts with learning, and let’s kids make their own toys. 1. Empty toilet rolls (2 per child) 2. Sticky tape 3. Stones 4. Paper (optional) 5. Crayons (optional)
zul: Lo mdlalo yindlela emnandi yokuhlanganisa ubuciko bezandla nokufunda, futhi usiza izingane zizenzele amathoyizi azo. Uzodinga: 1. Izingqwembe zama-toilet rolls (ezi-2 ingane ngayinye) 2. I-Sticky tape 3. Amatshe 4. Iphepha (akuphoqelekile) 5. Amakhrayoni (akuphoqelekile)
