Repository: Ari-Ramkilowan/po-files
Catalog: translations/SGroup5(Release (open))_Tsonga.po
Languages: tso

source: Some little ones might get stuck, but that’s fine. Here are some questions to help them talk about what’s happening and learn from it: 💬 Level 1 (simple structure) • Who can remember the pattern? • Which colour was on the bottom? • Which colour was on the top? Level 2 (more complex structure) • Who can remember the pattern? • Which colour was on the bottom? • Which colour was on the top? • Which colours will you use to repeat the pattern? • What does the pattern look like? Level 3 (even more complex structure) • Who can remember the pattern? • Which colours will you use to repeat the pattern? • What does the pattern look like? • How did you remember? • What else can you build with the bricks?
tso: Van’wana va vana lavantsongo va nga ha hluleka ku ya emahlweni, kambe sweswo swi lulamile. Hi leswi swin’wana swa swikombiso swo va pfuna ku va va vulavula hi leswi humelelaka na ku dyondza haswona: 💬 Levhele ya 1 • Xana i mani loyi a tsundzukaka phetheni? • Xana hi wihi muhlovo lowu a wu ri ehansi? • Xana hi wihi muhlovo lowu awu ri ehenhla? Levhele ya 2 • Xana i mani a nga tsundzukaka phetheni? • Xana hi wihi muhlovo lowu a wuri ehansi? • Xana hi wihi muhlovo lowu a wu ri ehenhla? • Xana hi yihi mihlovo leyi u nga yi tirhisaka ku vuyelela phetheni? • Xana phetheni yi languteka njhani? Levhele ya 3 • Xana i mani loyi a tsundzukaka phetheni? • Xana hi yihi mihlovo leyi u nga yi tirhisaka ku vuyelela phetheni? • Xana phetheni yi languteka njhani? • Xana u swi tsundzuke njhani? • Xana i yini swin’wana u nga swi akaka hi tibuloko?

source: See what you need
tso: Vona leswi u swi lavaka

source: See how it works
tso: Vona leswaku swi tirha njhani

source: Read the notes
tso: Hlaya tinotsi

source: Back to menu
tso: Ku tlhelela eka menyu

source: It’s time to test that memory with a game called Lego — Can You Remember? 🏅
tso: I nkarhi wo kambela ku tsundzuka hi ntlangu lowu vuriwaka LEGO — Xana u nga swi tsundzuka? 🏅

source: The aim is to see if the kids can remember what you did and repeat it. It helps them learn to pay attention. 🧐 1. Build a pattern of 2 bricks (e.g. red then yellow). 2. Show children for 5 seconds and then ask them to remember. 3. Hide the bricks and ask them to see if they can remember the pattern. 4. Repeat with another pattern using different colours or a different order. 5. Each time add more bricks. 6. Use fewer bricks (simple structure) with young children (ages 2 — 4). 7. Use more bricks with older children (ages 4 — 8). 8. Get the children to build patterns for everyone to copy. 9. Talk to the children about shapes, colours, or the number of bricks.
tso: Xikongomelo i ku vona loko vana va tsundzuka leswi u swi endleke na ku swi vuyelela. Swi va pfuna ku dyondza na ku va na vurhonwana. 🧐 1. Aka phetheni ya switina swi 2 (Xikombiso, xo tshwuka ivi ku landzela xa xitshopana). 2. Komba vana ku ringana tisekoni ta 5 kutani u va byela ku va va swi tsundzuka. 3. Tumbeta switina kutani u va byela va vona loko ku ri leswaku va nga ha yi tsundzuka phetheni. 4. Vuyelela hi phetheni yin’wana u ri karhi u tirhisa mihlovo yo hambana kumbe nandzelelano wo hambana. 5. U nga ha engetla switina swin’wana nkarhi na nkarhi. 6. Tirhisa switina swintsongo (swivumbeko swo olova) eka vana lavantsongo (malembe ma 2-4). 7. Tirhisa switina swo tala eka vana lavakulu (malembe ya 4-8). 8. Endla leswaku vana va aka tiphetheni ku va vana hinkwavo va kopa. 9. Vulavula na vana hi swivumbeko, mihlovo kumbe nhlayo ya switina.

source: This game develops:
tso: Ntlangu lowu wu ya emahlweni:

source: ✔️Numbers , Shapes & Sizes ✔️Skills for Learning
tso: ✔️Tinomboro, swivumbeko na tisayizi ✔️Swikili swo dyondza

source: Get as many Lego, Duplo or building blocks as you have. Each child is going to need the same amount as you.
tso: Hlengeleta LEGO, DUPLO, kumbe tibuloko hinkwato to aka leti u nga na tona. N’wana un’wana na un’wana u ta lava ntsengo wo ringana na wa wena.
