Repository: Ari-Ramkilowan/po-files
Catalog: translations/SGroup2(Release (open))_South Ndebele.po
Languages: nbl

source: See what you need
nbl: Bona ukuthi utlhoga ini

source: Read the notes
nbl: Funda amaAwathi

source: Back to menu
nbl: Asibuyele emva

source: It’s time to play Knock Down Skittles. 🎳
nbl: Sikhathi sokudlala i- KAwack Down Skittles. 🎳

source: This game develops:
nbl: Umdlalo lo uthuthkisa:

source: ✔️Arm & Hand Control ✔️Numbers , Shapes and Sizes
nbl: ✔️Ukulawula umkhoAwa nesandla ✔️IiAwambolo, amajamo Awabukhulu

source: This is a great to get the children playing in groups together so that they can make new friends. 1. A set of skittles (3 to 5). You can make these out of empty drinking bottles, but not glass. 2. A ball (you can make this out of plastic bags and onion bags). 3. Space to play skittles.
nbl: Le yindlela ehle yokwenza abantwana badlale ngeenqhema bazokwazi ukwakha abangani abatjha. 1. Ibuthelelo lamasketele (3 kuya 5). Ungasebezisa amabhodlelo wokusela angenalitho ukwenza lokhu, ingesiwo werhalasi. 2. Ibholo (ungalenza ngethwarathwara Awama ngesaga le – eyi). 3.Yenza isikhala ukudlala umdlalo wamasketele.

source: See how it works
nbl: Bona ukuthi isebenza bunjani

source: It’s also really straightforward, and you can play it over and over. All you have to do is: 1. Line the skittles up in a row. 2. Line the children up in front of the skittles. 3. Together take 5 steps back and count out loud as they step backwards. 4. Give each child a turn to roll the ball towards the skittles. 5. The ball should not leave the ground. 6. Reset the skittles when they have been knocked over. 7. This time take six steps back. 8. Have the children throw under arm first. 9. Then throw overarm. 10. Throw ball with two hands. 11. Throw ball with one hand.
nbl: Ilula khulu begodu ungayidlala ngokuphindelela. Ekufanele ukwenze ngilokhu: 1. Yenza umjeje wamasketele. 2. Jamisa abaentwana ngaphambi kwamasketele. 3. NiAwake thathani amagadango ama - 5 nibuyele emva bese ubalela phezulu nabaBuyela erhelweni. 4. Nikela boke abantwana ithuba lokuphosela ibholo esketeleni. 5. Ibholo akufanelanga bona lisuke phasi. 6. Phindisela kuhle amasketele nabawawisile. 7. Nje thhatha amagadango asithandathu ukuBuyela erhelweni. 8. Ithi abantwana baphose ngaphasi komkhoAwa. 9. Nje thana baphose ngaphezu kommkhoAwa. 10. Phosa ibholo ngezandla zombili. 11. Phosa ibholo ngesandla sinye.

source: But it’s not just physical, you can also use these questions to help the kids learn more: Before you start: • How many skittles can you see? • What colours are they? While you’re taking turns: • How many did you knock over? • How many are left? • Can you catch the ball with 2 hands? Before you start the next round: • How many steps should we take now? • Is that more or less than last time? • Can you catch the ball 1-handed?
nbl: Kodwana akusizizinto eziphathelene Awamzimba kwaphela. Ungasebenzisa imibuzo le ukurhelebha abantwana bona bafunde khulu: Ngaphambi kokobana uthome: • Ubona amasketele amangaki? • Amibala enjani? Nanitjhentjhisanako: • Mangaki owawisileko? • Mangaki asele? • Ungalibamba ibholo ngezandla zombili? Ngaphambi kokobana uthome umzombe olandelako: • Mangaki amagadango ekufuze siwathathe njenganje? • Manengi namkha mancane kunekuthomeni? • Ungalibamba ibholo ngesandla sinye?
