Repository: Ari-Ramkilowan/po-files
Catalog: translations/SGroup13(Release (open))_South Ndebele.po
Languages: nbl

source: Read the notes
nbl: Funda amaAwathi

source: See what you need
nbl: Bona ukuthi utlhoga ini

source: See how it works
nbl: Bona ukuthi isebenza bunjani

source: Back to menu
nbl: Buyela erhelweni

source: Make sure the children don’t get too excited and take a bite out of their playdough! 🤢 1. Tell the children that they’re going to make an ice cream. 2. Talk about ice creams. 3. Show them how to roll the play dough into long, thin sausages, and then roll them round and round, making a circle. 4. Put a stick in to make an ice cream. 5. Show them the other kinds of ice creams you can make by rolling balls and decorating them. 6. Have fun, ask questions, and talk to help the children learn more as they play. 7. Set up an ice cream shop to sell the ice creams. 8. Put up pictures of the different kinds of flavours there are. 9. Sing a rhyme about ice cream if you want to. RHYME: I scream, you scream, we ALL scream for ice cream!
nbl: Qinisekisa ukuthi abantwana abathabi khulu bese uluma kancani ihlama yabo! 🤢 1.Tjela abantwana ukuthi bazoyenza i-ayisikhrimu. 2.Coca ngama –ayisikhrimu. 3.Batjengise bona ihlama bayirola njani ibe yide, ibe masoseji, ibe rondo bese yenza isiyingi. 4.Faka isgodo e-ayiskhrimini. 5.Batjengise eminye imihlobo ye-ayisikhrimu ongayenza ngokurola amabholo bese uwakghabisa. 6.Thokoza, ubuze imibuzo bese uyakhuluma ukubarhelebha nabafundako. 7.Yenza isitolo se-ayisikhrimu uzokuthengisa ama-ayisikhrimu. 8.Beka iinthombe zemihlobo ehlukeneko ezikhona. 9.Vuma ingoma nge-ayisikhrimu nawuthandako. Ingoma: Ngiyarhuwelela, uyarhuwelela, SOKE sirhuwelelela i-ayisikhrimu!

source: Ask the children some questions to help their imaginations run wild. Level 1 • What ice creams do you like? • When do you eat them? • How do you feel when you have an ice cream? • What colour are you going to make? • What shape do you like? • Etc. Level 2 • What flavour are your ice creams? • How many do we have now? • Should we set up and ice cream shop? Level 3 • How much do your ice creams cost? • I only have this amount of money. Do I need change?
nbl: Buza abantwana imibuzo ukubarhelebha bona imicabango yabo igijime. Ileveli yoku - 1 • Uthanada maphi ama-ayisikhrimu? • Uwadla nini? • Uzizwa njani nawudla i-ayisikhrimu? • Uzokwenza umbala onjani? • Uthanda ejame njame njani? • Njll. Ileveli Iyei - 2 • Ngimiphi imihlobo yama-ayisikhrimu wakho? • Sinemingaki nje? • Sisenze isitolo sama-ayisikhrimu? Ileveli Iyei - 3 • Ama-ayisikhrimakho abiza malini? • Nginalemali kwaphela. Ngabe ngithloga itjintji?

source: ✔️Talking & Understanding ✔️Arm & hand control
nbl: ✔️Ukukhuluma Awakuzwisisana ✔️Ukulawula umkhoAwa nesandla

source: This is a great game to play during summer, and the good news is that these Playdough Ice Creams won’t melt. 🍦
nbl: Umdlalo lo umnandi khulu ukuwudlala ehlobo, futhi iindaba ezimnandi ngukuthi i - Playdough Ice Creams ngeze yancibilika. 🍦

source: This one is super simple! All that’s needed is: 1. Playdough in a few different colours. 2. Ice cream sticks or something that could be used as an ice cream stick.
nbl: Le ilula khulu. Ozokutlhoga ngilokhu: 1.Ihlala yemibala eyahlukeneko. 2.Isigodo se – ayisikhrimu Awama ngabe yini ogayisebenzisa njengaso.

source: This game develops:
nbl: Umdlalo lo uthuthukisa:
