Repository: Ari-Ramkilowan/po-files
Catalog: translations/SGroup17(Release (open))_Swati.po
Languages: ssw

source: See what you need
ssw: Buka kutsi yini loyidzingako

source: See how it works
ssw: Buka kutsi isebenta njani

source: Read the notes
ssw: Fundza emanotsi

source: Back to menu
ssw: Buyela emuva kumenyu

source: This game develops:
ssw: Lomdlalo utfutfukisa:

source: Here’s what you’ll need to keep the kids busy: 1. A pre-drawn picture of a dinosaur for each child. 2. Squares about the size of a stamp in 2 or 3 different colours. 3. Glue. 4. Scissors.
ssw: Naku lotakudzinga kugcina labantfwana bamatasatasa: 1. Sitfombe lesesivele sidvwetjiwe se-dinosaur unike umntfwana ngamunye 2. Tikwele letingalingana nesayizi Yebo itembu sibe nemibala lehlukene le-2 noma 3 3. Iglue 4. Sikelo

source: We started from the ground up by making dinosaur footprints in the last activity, so how about we move on to Making Dinosaurs? 🦕
ssw: Sicale phansi senta tinyatselo tema- dinosaur kulomsebenti wekugcina, kungaba njani sindlulele eKwenteni ema-Dinosaurs? 🦕

source: ✔️Numbers , Shapes & Sizes ✔️Skills for Learning
ssw: ✔️ Tinombolo, bobunjwa nemasayizi ✔️Emakhono ekufundza

source: Keep the kids wide awake by encouraging them to make dinosaur noises while they work. 🦖🦕 1. Give each child a picture of a dinosaur. 2. Cut out the colourful squares for younger children. 3. Let older children cut their own little squares. 4. Sort the little squares into piles depending on their colour. 5. Show the children how to stick the squares onto their dinosaurs. 6. Help the younger ones while encouraging the older ones. 7. Help them make a pattern using colours (red, blue, red, blue, red, etc).
ssw: Gcina labantfwana bavukile ngekubakhutsata kutsi bente imisindvo yema-dinosaur ngalesikhatsi basebenta. 🦖🦕 1. Niketa umntfwana ngamunye sitfombe se-dinosaur. 2. Juba letikwele letinemibalabala wentele bantfwana labancane. 3. Laba labadzadlana abatijubele tikwele taboletincane. 4. Hlela letikwele letincane utibeke tincumbi ngekwemibala yato. 5. Khombisa labantfwana kutsi batinamatsisela njani letikwele kulama-dinosaurs abo. 6. Sita laba labancane ngalesikhatsi ukhutsata laba labadzala. 7. Basite kutsi bente iphethini basebentisa imibala (lobovu, lolingangane, loluhlata, njll).

source: Not sure what to ask the children next? Here are some ideas: Level 1 • What does this dinosaur need? • Where will these spikes go? • How many do you need? • What colours will you choose? Level 2 • What pattern will you make? • Which one shall we start with? • When did dinosaurs live? (The answer can be something like: a long, long time ago). • Are there still dinosaurs on earth? (Answer: no, they have all died). • What do they eat? (Answer: some eat plants, some eat other animals). Level 3 • What sound does dinosaur start with? (da) • What else starts with ‘da’? • Do you know the names of different types of dinosaurs? (Answer: T. rex, brontosaurus, triceratops).
ssw: Uma ungati kutsi ungababutani labantfwana ngalokulandzelako, nayi imibono: Lizinga1 • Ngabe le-dinosaur idzingani? • Ngabe lamanyeva atawungena kuphi? • Undzinga mangaki? • Utawukhetsa yiphi imibala? Lizinga2 • Utawenta yiphi iphethini? • Singacala ngayiphi? • Ema-dinosaurs aphila ngasiphi sikhatsi? (imphendvulo ingahle ibe kanjena: kadzeni, emandvulo). • Ngabe asekhona ema-dinosaurs emhlabeni? (Imphendvulo: cha, afile onkhe kantsi sekavele anyamalele). • Adlani? (Imphendvulo: lamanye adla tihlahla, lamanye adla letinye tilwane). Lizinga3 • Ngabe leligama lelitsi dinosaur licala ngawuphi umsindvo? (da) • Yini lenye lecala nga ‘da’? • Ngabe uyawati emagama etinhlobo letinye tema-dinosaurs? (Imphendvulo: T. rex, brontosaurus, triceratops).
