Repository: Ari-Ramkilowan/po-files
Catalog: translations/SGroup13(Release (open))_Pedi; Sepedi;  Northern Sotho.po
Languages: nso

source: Read the notes
nso: Bala dinoutse

source: See what you need
nso: Bona se o se hlokago

source: See how it works
nso: Bona ka moo e šomago ka gona

source: Back to menu
nso: Re boela morago go menyu

source: Make sure the children don’t get too excited and take a bite out of their playdough! 🤢 1. Tell the children that they’re going to make an ice cream. 2. Talk about ice creams. 3. Show them how to roll the play dough into long, thin sausages, and then roll them round and round, making a circle. 4. Put a stick in to make an ice cream. 5. Show them the other kinds of ice creams you can make by rolling balls and decorating them. 6. Have fun, ask questions, and talk to help the children learn more as they play. 7. Set up an ice cream shop to sell the ice creams. 8. Put up pictures of the different kinds of flavours there are. 9. Sing a rhyme about ice cream if you want to. RHYME: I scream, you scream, we ALL scream for ice cream!
nso: Kgonthiša gore bana ga ba thakgale kudu gomme ba feleletša ba jele letsopa la go ralokiša! 🤢 1. Ba botše gore ba tlile go dira aesekherimi. 2. Bolela ka diaesekherimi. 3. Ba bontšhe ka moo ba ka rolago letsopa la go ralokišwa go ba le letelele, ba dira disosetše tše tshesane, gomme ba di kgokološe ka go di dikološa, o dira sediko. 4. Hlomela phate ka gare go dira aesekherimi. 5. Ba bontšhe mehuta ye mengwe ya diaesekherimi yeo o ka e dirago ka go rola dikgwele le go di kgabiša. 6.Ipshineng, botšišo dipotšišo, o be o bolele go thuša bana go ithuta go tsenelela ge ba le gare ga raloka. 7. Hloma lebenkele la diaesekherimi go rekiša diaesekherimi. 8. Bea diswantšho tša mehuta ye e fapafapanego ya ditatso tše di lego gona. 9. Opela košana mabapi le aesekherimi ge o nyaka go dira bjalo. KOŠANA: Ke a goeletša, o a goeletša, KA MOKA re goeletša aesekherimi!

source: Ask the children some questions to help their imaginations run wild. Level 1 • What ice creams do you like? • When do you eat them? • How do you feel when you have an ice cream? • What colour are you going to make? • What shape do you like? • Etc. Level 2 • What flavour are your ice creams? • How many do we have now? • Should we set up and ice cream shop? Level 3 • How much do your ice creams cost? • I only have this amount of money. Do I need change?
nso: Botšiša bana dipotšišo tše mmalwa go ba thuša gore megoloko ya bona e nagane ka lebelo. Kgato ya 1 • Ke mohuta ofe wa aesekherimi wo o ratago? • Naa o di ja neng? • Naa o ikwa bjang ge o na le aesekherimi? • Naa o tlile go dira ya mmala ofe? • Naa o rata ya sebopego sefe? • Bjalobjalo. Kgato ya 2 • Naa diaesekherimi tša gago ke tša mohlodi ofe? • Naa re na le tše kae gabjale? • Naa re swanetše go hloma lebenkele la go rekiša diaesekherimi? Kgato ya 3 • Naa diaesekherimi tša gago di rekišwa bokae? • Ke swere fela palomoka ye e latelago ya tšhelete. Naa ke nyaka tšhentšhi?

source: ✔️Talking & Understanding ✔️Arm & hand control
nso: ✔️Go bolela le go kwešiša ✔️Taolo ya letsogo le seatla

source: This is a great game to play during summer, and the good news is that these Playdough Ice Creams won’t melt. 🍦
nso: Ye ke papadi ye bohlokwa go ralokwa nakong ya selemo, le gona ditaba tše di thabišago ke gore Diaesekherimi tše tša Leraga la go ralokiša di ka se tologe. 🍦

source: This one is super simple! All that’s needed is: 1. Playdough in a few different colours. 2. Ice cream sticks or something that could be used as an ice cream stick.
nso: Ye yona e bonolonolo ka nnete! Ka moka tšeo di nyakegago ke: 1. Leraga la go ralokiša ka mebala ye mmalwa ye e fapafapanego. 2. Diphate tša diaesekherimi goba se sengwe seo se ka šomišwago bjalo ka phate ya aesekherimi.

source: This game develops:
nso: Papadi ye e kaonafatša:
