Repository: Ari-Ramkilowan/po-files
Catalog: translations/SGroup9(Release (open))_Afrikaans.po
Languages: afr

source: Use this activity as a bigger learning opportunity by asking the children some fun questions. Level 1 • Who likes blowing bubbles? • What do we normally use dishwashing soap for? • What colours do we have here? Level 2 • What does this pattern look like? • What shapes can you see? • What colours have you made? • How many bubbles can you see here? Level 3 • Let’s mix some colours. • Now what colours do you have? • What does blue and yellow make? (green) • What does red and yellow make? (orange) • What does blue and red make? (purple) • What sound does blue start with? (ba) • What sound does red start with? (rrrrrr) • What sound does yellow start with? (ya) • What sound does green start with? (ga) • What sound does orange start with? (o) • What sound does purple start with? (pa)
afr: Gebruik hierdie aktiwiteit as ’n groter leergeleentheid deur die kinders prettige vrae te vra. Vlak 1 • Wie hou daarvan om borrels te blaas? • Waarvoor gebruik ons gewoonlik opwasmiddel? • Watter kleure het ons hier? Vlak 2 • Hoe lyk hierdie patroon? • Watter vorms kan jy sien? • Watter kleure het jy gemaak? • Hoeveel borrels kan jy hier sien? Vlak 3 • Kom ons meng ’n paar kleure. • Watter kleure het jy nou? • Watter kleur maak blou en geel? (groen) • Watter kleur maak rooi en geel? (oranje) • Watter kleur maak blou en rooi? (pers) • Met watter klank begin blou? (be) • Met watter klank begin rooi? (rrrrrr) • Met watter klank begin geel? (gghh) • Met watter klank begin groen? (gghh) • Met watter klank begin oranje? (o) • Met watter klank begin pers? (pe)

source: Read the notes
afr: Lees die notas

source: See what you need
afr: Kyk wat jy nodig het

source: See how it works
afr: Kyk hoe dit werk

source: Back to menu
afr: Terug na spyskaart

source: Have the children tried Painting with Bubbles yet? 🎨
afr: Het die kinders al Verf met Borrels (Painting with Bubbles) probeer? 🎨

source: This game develops:
afr: Hierdie speletjie ontwikkel:

source: ✔️Exploring & Finding Out ✔️Early Reading & Writing
afr: ✔️Verkenning en uitvindsel ✔️Vroeë lees en skryf

source: It’s really simple. All you need is: 1. Paint 2. Dishwashing liquid 3. Straws 4. Paper
afr: Dis regtig eenvoudig. Al wat jy nodig het, is: 1. Verf 2. Opwasmiddel 3. Strooitjies 4. Papier

source: Read the note
afr: Lees die notas

source: This activity breathes new life into having fun with paint. No paintbrushes required! 🖌 1. Mix some paint with some dishwashing liquid in a cup. 2. Add a little bit of water to the mixture. 3. Give each child a straw and some paper, and ask them to share the paint. 4. Ask them to blow (not suck) through the straw into the cup. This will make bubbles. 5. Then ask the children to hold the paper over the cup and bubbles and press down gently. 6. The bubbles will leave a bubble pattern on the paper. 7. The children can repeat this with other colours and then leave their art to dry.
afr: Hierdie aktiwiteit gee nuwe lewe aan prettige aktiwiteite met verf. Geen verfkwaste is nodig nie! 🖌 1. Meng in ’n koppie ’n bietjie verf met opwasmiddel. 2. Voeg ’n bietjie water by die mengsel. 3. Gee elke kind ’n strooitjie en papier, en vra hulle om die verf te deel. 4. Vra hulle om deur die strooitjie in die koppie te blaas (nie suig nie). Dit sal borrels maak. 5. Vra dan die kinders om die papier oor die koppie en borrels te hou en liggies af te druk. 6. Die borrels sal ’n borrelpatroon op die papier los. 7. Die kinders kan dit met ander kleure herhaal en hul kunswerk laat droog word.
