Repository: Ari-Ramkilowan/po-files
Catalog: translations/SGroup7(Release (open))_Tsonga.po
Languages: tso

source: Read the notes
tso: Hlaya tinotsi

source: See what you need
tso: Vona leswi u swi lavaka

source: See how it works
tso: Vona leswaku swi tirha njhani

source: Back to menu
tso: Ku tlhelela eka menyu

source: The lion is the king of the jungle, let’s see what the kids know about it: Level 1 • What sound does a lion make? • Where do they live? • What do they eat? • What should you do if you see a lion? Level 2 • What kind of animals are they? (Cats and mammals) • What do they look like? • How big are they? • What colour are they? Level 3 • What else can you tell me about lions? • What other animals live near lions? • Let’s talk about those – what do you know about elephants, or rhinos? • What sound does the word ‘lion’ start with? • What sound does the word ‘rhino’ start with? • What sound does the word ‘elephant’ start with?
tso: Nghala i hosi ya le kwhatini, a hi voni leswi vana va swi tivaka hi mhaka leyi: Levhele ya 1 • Xana nghala yi endla mpfumawulo wihi? • Xana tinghala ti tshama kwihi? • Xana ti dya yini? • I yini leswi u faneleke ku swi endla loko u vona nghala? Levhele ya 2 • Xana i swiharhi swa njhani? (Swimanga na leswi mamisaka) • Xana ti languteka njhani? • Xana ti ku le ku fika kwihi? • Xana i ta muhlovo muni? Levhele ya 3 • Xana i yini swin’wana u nga ndzi byelaka hi tinghala? • Xana hi swihi swifuwo swin’wana leswi hanyaka ekusuhi na tinghala? • A hi vulavuleni hi swona – xana u tiva yini hi tindlopfu, kumbe timhelembe? • Xana rito ‘nghala’ ri sungula hi mpfumawulo wihi? • Xana rito ‘mhelembe’ ri sungula hi mpfumawulo wihi • Xana rito ‘ndlopfu’ ri sungula hi mpfumawulo wihi?

source: This game develops:
tso: Ntlangu lowu wu ya emahlweni:

source: Have you made any Little Lions yet? 🦁
tso: Xana u ve se u endlile swinghalana ke? 🦁

source: ✔️Walking & Moving ✔️Arm & Hand control
tso: ✔️Ku famba na ku fambafamba ✔️Ku lawula voko na xandla

source: If you have time, get the children cut these things out themselves: ✂ - 1 paper per child for the lion’s face - 2 black eyes per child cut out of paper - 1 nose per child cut out of paper - 2 ears per child cut out of paper - 1 plastic / onion bag per child
tso: Loko u ri na nkarhi, endla leswaku vana va titsemela swilo leswi landzelaka: ✂ 1. Phepha ri 1 hi n’wana ro endla xikandza xa nghala 2. Matihlo ma 2 lama nga tsemiwa eka phepha hi n’wana 3. Nhompfu yi 1 leyi nga tsemiwa eka phepha hi n’wana 4. Tindleve ti 2 leti nga tsemiwa eka phepha hi n’wana 5. Pulasitiki kumbe xisakana xi 1 xa tinyala hi n’wana

source: You can use this activity as an opportunity to teach children about animals. 1.Talk about lions before you make the lion face. 2.Ask each child to cut out a circle to make the lions face. 3.They can colour in the face of the lion and stick on eyes, nose and ears. 4.Get them to cut strips of plastic or onion bag for the mane of the lion. 5.Stick on the strips. 6.If you have string, you could make holes in the eyes and turn the lion face into a mask. 7.Get children to crawl around and roar like lions.
tso: U nga ha tirhisa nghingiriko lowu tanihi nkarhi wo dyondzisa n’wana hi swihari. 1. Vulavula hi tinghala u nga se endla xikandza xa nghala. 2. Byela n’wana un’wana na un’wana ku tsema sekele a endla xikandza xa nghala. 3. Va nga ha khalara xikandza xa nghala na ku damarheta mahlo, nhompfu na tindleve. 4. Endla leswaku va tsema switiripi swa pulasitiki kumbe xisakana xa tinyala ku endla ntshiva wa nghala. 5. Damarheta switiripi. 6. Loko u ri na ntambu, u nga endla timbhovo emtihlweni u cinca xikandza xa nghala xi va maski. 7. Endla leswaku vana va kasa va rhendzeleka na ku bonga ku fana na tinghala.
