Repository: Ari-Ramkilowan/po-files
Catalog: translations/SGroup5(Release (open))_Southern Sotho.po
Languages: sot

source: Some little ones might get stuck, but that’s fine. Here are some questions to help them talk about what’s happening and learn from it: 💬 Level 1 (simple structure) • Who can remember the pattern? • Which colour was on the bottom? • Which colour was on the top? Level 2 (more complex structure) • Who can remember the pattern? • Which colour was on the bottom? • Which colour was on the top? • Which colours will you use to repeat the pattern? • What does the pattern look like? Level 3 (even more complex structure) • Who can remember the pattern? • Which colours will you use to repeat the pattern? • What does the pattern look like? • How did you remember? • What else can you build with the bricks?
sot: Ba banyane ba ka thatafallwa hanyane, empa ho lokile. Dipotso tse ding ke tsena tse ka ba thusang ho bua ka se etsahalang le ho ithuta ho sona: 💬 Mohato wa 1 • Ke mang ya ka hopolang dipaterone? • Ke mmala ofe o neng o le ka tlasetlase? • Ke mmala ofe o neng o le ka hodimo? Mohato wa 2 • Ke mang ya ka hopolang paterone? • Ke mmala ofe o neng o le ka tlase? • Ke mmala ofe o neng o le ka hodimo? • Ke mebala efe eo o tlang ho e sebedisa ho pheta paterone? • Paterone e shebeha jwaloka eng? Mohato wa 3 • Ke mang ya ka hopolang paterone? • Ke mebala efe eo o tlang ho e sebedisa ho pheta paterone? • Paterone e shebeha jwaloka eng? • O hopotse jwang? • Ke eng hape eo o ka e ahang ka diboloko?

source: See what you need
sot: Sheba seo o se hlokang

source: See how it works
sot: Bona hore e sebetsa jwang

source: Read the notes
sot: Bala dinoutso

source: Back to menu
sot: Kgutlela ho menu

source: It’s time to test that memory with a game called Lego — Can You Remember? 🏅
sot: Ke nako ya ho etsa teko ya kgopolo ka papadi e bitswang LEGO — Na o Hopola? 🏅

source: The aim is to see if the kids can remember what you did and repeat it. It helps them learn to pay attention. 🧐 1. Build a pattern of 2 bricks (e.g. red then yellow). 2. Show children for 5 seconds and then ask them to remember. 3. Hide the bricks and ask them to see if they can remember the pattern. 4. Repeat with another pattern using different colours or a different order. 5. Each time add more bricks. 6. Use fewer bricks (simple structure) with young children (ages 2 — 4). 7. Use more bricks with older children (ages 4 — 8). 8. Get the children to build patterns for everyone to copy. 9. Talk to the children about shapes, colours, or the number of bricks.
sot: Sepheo ke ho bona hore ebe bana ba ka hopola seo o se entseng mme ba se phete. Sena se ba thusa ho ithuta ho mamedisisa. 🧐 1. Aha dipaterone tsa ditene tse 2 (ho etsa mohlala, tse kgubedu, ebe tse tshehla) 2. Bontsha bana ka metsotswana e 5 mme ebe o re ba hopole. 3. Pata ditene mme o ba botse hore o bone haeba ba kgona ho hopola paterone. 4. Pheta hape ka paterone e nngwe o sebedisa mebala e fapaneng kapa tatelano e fapaneng. 5. Nako le nako, o ka eketsa ditene tse ding. 6. Sebedisa ditene tse mmalwa (sebopeho se bobebe) mmoho le bana ba banyenyane (dilemo tse 2-4). 7. Sebedisa ditene tse ngata ho bana ba baholwanyane (dilemo tse 4-8). 8. Ere bana ba ahe dipaterone tseo bohle ba tlang ho di kopitsa. 9. Buisana le bana mabapi le dibopeho, mebala, kapa lenane la ditene.

source: This game develops:
sot: Papadi ena e bopa:

source: ✔️Numbers , Shapes & Sizes ✔️Skills for Learning
sot: ✔️Dinomoro, dibopeho le boholo ✔️Bokgoni bakeng sa ho ithuta

source: Get as many Lego, Duplo or building blocks as you have. Each child is going to need the same amount as you.
sot: Bokella di-LEGO, DUPLO, kapa diboloko tsa ho aha tsohle tseo o nang le tsona. Ngwana ka mong o tla hloka ho ba le lenane le lekanang le la hao
