Repository: Ari-Ramkilowan/po-files
Catalog: translations/SGroup13(Release (open))_Xhosa.po
Languages: xho

source: Read the notes
xho: Funda amanqaku

source: See what you need
xho: Bona okudingayo

source: See how it works
xho: Jonga ukuba isebenza njani

source: Back to menu
xho: Buyela kwimenyu

source: Make sure the children don’t get too excited and take a bite out of their playdough! 🤢 1. Tell the children that they’re going to make an ice cream. 2. Talk about ice creams. 3. Show them how to roll the play dough into long, thin sausages, and then roll them round and round, making a circle. 4. Put a stick in to make an ice cream. 5. Show them the other kinds of ice creams you can make by rolling balls and decorating them. 6. Have fun, ask questions, and talk to help the children learn more as they play. 7. Set up an ice cream shop to sell the ice creams. 8. Put up pictures of the different kinds of flavours there are. 9. Sing a rhyme about ice cream if you want to. RHYME: I scream, you scream, we ALL scream for ice cream!
xho: Qiniseka ukuba abantwana abavuyi kakhulu balume intlam yabo yokudlala! 🤢 1. Xelela abantwana ukuba baza kukwenza i- ice cream. 2. Thetha malunga neekremu zeqhwa. 3. Batshengise indlela yokugcoba intlama yokudlala kumasilase amade, amancinci, uze uwajikeleze kwaye ujikeleze, wenze isangqa. 4. Faka ifonti ekwenzeni ice cream. 5. Bakhombise ezinye iintlobo ze-ice creams ongazenza ngokubhoqa ibhola kunye nokuzihlobisa. 6. Yimnandi, ubuze imibuzo, kwaye uthethe abantwana ukuba bafunde ngakumbi xa bedlala. 7. Misela i-ivenkile yee-ice cream ukuthengisa ii-ice cream. 8. Beka imifanekiso yeentlobo ezahlukeneyo zezigulane zikhona. 9. Hamba ingoma malunga ne-ayisikrimu ukuba ufuna. ISINGQI: Ndiyamemeza, uyakhawula, sonke siyamemeza nge-ayisikrimu!

source: Ask the children some questions to help their imaginations run wild. Level 1 • What ice creams do you like? • When do you eat them? • How do you feel when you have an ice cream? • What colour are you going to make? • What shape do you like? • Etc. Level 2 • What flavour are your ice creams? • How many do we have now? • Should we set up and ice cream shop? Level 3 • How much do your ice creams cost? • I only have this amount of money. Do I need change?
xho: Buza abantwana imibuzo ehile ukunceda imibono yabo yande. Umgangatho 1 • Yiyiphi i-ice cream oyithandayo? • Uyidla nini? • Uziva njani xa unayo ice cream? • Ngowuphi umbala oya kuwenza? • Yimiphi imo oyithandayo? • Njl njl. Umgangatho 2 • Ngeyiphi incasa yakho i-ice cream? • Bangaphi esinabo ngoku? • Ingaba kufuneka simisele ivenkile yethu yeice cream? Umgangatho 3 • Ingaba ibiza malini i-ice cream yakho? • Ndinale mali engaka kuphela. Ingaba ndifuna itshintshi?

source: ✔️Talking & Understanding ✔️Arm & hand control
xho: ✔️Ukuthetha kunye nokuqonda ✔️Ulawulo lwengalo kunye nesandla

source: This is a great game to play during summer, and the good news is that these Playdough Ice Creams won’t melt. 🍦
xho: Lo ngumdlalo omhle okufuneka owudlali ngexesha lasehlotyeni, kwaye iindaba ezimnandi kukuba ezizinto zeIci Cream zokudlala azizukuncibilika. 🍦

source: This one is super simple! All that’s needed is: 1. Playdough in a few different colours. 2. Ice cream sticks or something that could be used as an ice cream stick.
xho: Le ilula kakhulu! Konke okudinekayo kukuba: 1. Dlala ngemibala embalwa eyahlukeneyo. 2. Imingxu ye-ice cream sticks okanye into engasetyenziswa njengomngxu we-ice cream.

source: This game develops:
xho: Lo mdlalo uphuhlisa:
