Repository: Ari-Ramkilowan/po-files
Catalog: translations/SGroup11(Release (open))_Venda.po
Languages: ven

source: The little ones might struggle with the higher levels, but these questions are a great way to ease them into basic maths, and an education on money. 💸 Level 1 • What colours have you used? • What shape are the coins? • Which is the biggest coin? • Which is the smallest? • How many coins do we have? • What do we do with money? • Where should we keep our money? Level 2 • Who can show me a R1 coin? • Who can show me a R2 coin? • Who can show me a R5 coin? • How can you make R6? • How can you make R3 etc? • Etc Level 3 • Who can show me a 5 cent coin? • Who can show me a 10 cent coin? • Who can show me a 20 cent coin? • Who can show me a 50 cent coin? • How can you make 20 cents? • How can you make 10 cents? • Etc
ven: Vhana vhaṱuku vha nga kundelwa u ya nṱha, fhedzi mbudziso idzi ndi nḓila yavhudi ya u vha leludzela kha mutheo wa mbalo, na pfunzo nga ha tshelede. 💸 Ḽiga 1 • Ho shumiswa mivhala ifhio? • Tshelede ya tsimbi ndi tshivhumbeo tshifhio? • Ndi ifhio tshelede ya tsimbi khulwanesa? • Ndi ifhio ṱhukhusa? • Ni na tshelede dza tsimbi nngana? • Ri shumisa mini tshelede? • Tshelede ri tea u i vhea ngafhi? Ḽiga 2 • Ndi nnyi ane a nga ntsumbedza R1? • Ndi nnyi ane a nga ntsumbedza R2? • Ndi nnyi ane a nga ntsumbedza R5? • Ni nga itisa hani uri ni vhe na R6? • Ni nga itisa hani uri ni vhe na R3? Ḽiga 3 • Ndi nnyi ane a nga ntsumbedza 5 senthe? • Ndi nnyi ane a nga ntsumbedza 10 senthe? • Ndi nnyi ane a nga ntsumbedza 20 senthe? • Ndi nnyi ane a nga ntsumbedza 50 senthe? • Ndi itisa hani uri ni vhe na 20 senthe? • Ni nga itisa hani uri ni vhe na 10 senthe?

source: Engage the children in a conversation about money while they go about this game. 1. Make sure each coin has been washed and is clean. 2. While you talk about money and what it’s used for, give each child a coin. 3. Ask them to look at their coin and tell you what they see. 4. Give them each a crayon and a piece of paper. 5. Show them that if you put the coin under the paper and then rub the crayon over it, you’ll see the picture of a coin. 6. Get them to share their items and explore different coins and colours.
ven: Kha vha thome nyambedzano nga ha tshelede musi vha tshi khou thoma u tamba uyu mutambo. 1. Vha vhone uri tshelede ya tsimbi iṅwe na inwe yo ṱanzwiwa yo kuna. 2. Musi vha tshi khou amba nga tshelede na uri i shumiswa mini, kha vha ṋee ṅwana muṅwe na muṅwe tshelede iyo. 3. Kha vha vha vhudze vha sedze kha tshelede vha vha vhudze uri vha khou vhona mini. 4. Muṅwe na muṅwe kha vha vha mu ṋee khirayoni na tshipiḓa tsha bammbiri. 5. Kha vha vha sumbedze uri arali vha nga vhea tshelede nga fhasi ha bammbiri vha hwaya nga khirayoni nga nṱha, vha ḓo vhona tshifanyiso tsha tshelede iyo. 6. Kha vha vha vhudze vha ṋekane zwine vha khou shumisa vha shumise tshelede na mivhala yo fhambananaho.

source: Back to menu
ven: Kha vha humele murahu kha menyu

source: See what you need
ven: Zwine vha ṱoḓa

source: See how it works
ven: Zwi shumisa hani

source: Read the notes
ven: Kha vha vhale notsi

source: Remind the kids they’ll need to be very responsible when they’re each given one of the following: 1. A coin 2. A piece of paper 3. A crayon
ven: Kha vha humbudze vhana uri vha tea u dzhia vhuḓifhinduleli tshoṱhe musi vha tshi ṋetshedzwa zwithu zwi tevhelaho: 1. Tshelede ya tsimbi 2. Tshipiḓa tsha bammbiri 3. Khirayoni

source: This game develops:
ven: Mutambo u bveledza:

source: It’s never too early to start learning about money with Money Rubs! 💰
ven: A hu na tshifhinga tsha uri vho ṱavhanyedza u guda nga ha masheleni na nga u ola Tshelede! 💰

source: ✔️Numbers , shapes & sizes ✔️ Arm & Hand Control
ven: ✔️Nomboro, zwivhumbeo na saizi ✔️ Ndaulo ya tshanḓa tshoṱhe
