Repository: Ari-Ramkilowan/po-files
Catalog: translations/SGroup14(Release (open))_Afrikaans.po
Languages: afr

source: Read the notes
afr: Lees die notas

source: See what you need
afr: Kyk wat jy nodig het

source: See how it works
afr: Kyk hoe dit werk

source: Back to menu
afr: Terug na spyskaart

source: While their creative juices are flowing, get their brains going by asking them some questions. Level 1 • What colour is this? • What shape is this • How many colours can you see? • Where will you stick this? Level 2 • How many pieces do you have? • What pattern is this? Level 3 • How will you use these pieces to make a picture? • What is your picture? • Can you tell me about it? • Can you make your name?
afr: Terwyl hulle kreatief is, stimuleer hul brein deur ’n paar vrae te stel. Vlak 1 • Watter kleur is dit? • Watter vorm is dit? • Hoeveel kleure kan jy sien? • Waar sal jy dit plak? Vlak 2 • Hoeveel stukke het jy? • Watter patroon is dit? Vlak 3 • Hoe gaan jy hierdie stukke gebruik om ’n prentjie te maak? • Wat is jou prent? • Kan jy my daarvan vertel? • Kan jy jou naam maak?

source: ✔️Arm & Hand Control ✔️Numbers , Shapes & Sizes
afr: ✔️Arm- en handbeheer ✔️Getalle, vorms en groottes

source: Now it’s time to turn trash into treasure. 1. Make sure the chip packets are clean. 2. Ask the kids to share the chip packets between themselves. 3. Then ask them to cut or tear up chip packets into small pieces or shapes. 4. Get them to stick these pieces of chip packet onto the paper. 5. Encourage creativity as they make their pictures. 6. Talk about shapes, sizes, colour, texture, patterns, etc. 7. Help them to cut and stick as is needed. 8. Older children can even make spell their names out with the pieces.
afr: Dis nou tyd om weggooigoed in mooigoed te verander. 1. Maak seker die skyfiepakkies is skoon. 2. Vra die kinders om die skyfiepakkies tussen hulle te deel. 3. Vra hulle dan om die skyfiepakkies in klein stukkies of vorms te knip of te skeur. 4. Laat hulle hierdie stukkies van die skyfiepakkies op die papier plak. 5. Moedig kreatiwiteit aan soos hulle hul prente maak. 6. Praat oor vorms, groottes, kleur, tekstuur, patrone, ens. 7. Help hulle om te knip en te plak soos nodig. 8. Ouer kinders kan hul name met die stukkies uitspel.

source: Use Chip Packet Fun to teach the kids about not only making art, but recycling too.🥔
afr: Gebruik Pret met Skyfiepakkies (Chip Packet Fun) om die kinders oor kuns asook herwinning te leer. 🥔

source: If there’s litter in the area, why not get the kids to collect it and throw it away while they look for chip packets? This is what you’ll for this game: • A clean chip packet per child • Piece of paper per child • Glue and scissors
afr: As daar rommel in die omgewing is, hoekom vra jy nie die kinders om dit op te tel en weg te gooi terwyl hulle vir skyfiepakkies soek nie? Wat jy vir hierdie speletjie nodig sal hê: • ’n Skoon skyfiepakkie per kind • Vel papier per kind • Gom • ’n Skêr

source: This game develops:
afr: Hierdie speletjie ontwikkel:
