Repository: Ari-Ramkilowan/po-files
Catalog: translations/SGroup4(Release (open))_Zulu.po
Languages: zul

source: See how it works
zul: Bheka ukuthi kusebenza kanjani

source: See what you need
zul: Bheka ukuthi yini oyidingayo

source: Read the notes
zul: Funda amanothi

source: Back to menu
zul: Buyela kumenyu

source: It’s time to decorate your classroom by Making Flowers. 🌸
zul: Sekuyisikhathi sokuhlobisa igumbi lethu lokufundela Ngokwenza Izimbali. 🌸

source: This game doesn’t just let the the kids be creative byn painting, but also teaches them to be creative in how they make their brushes. 1. A piece of paper per child 2. 1 peg per child 3. 1 small piece of sponge per child 4. Paint 5. Crayons
zul: Lo mdlalo awugcini nje ngokuthuthukisa ubuciko bezingane ngokupenda, kodwa uphinde ufundise izingane ukuba zibe nokuciko endleleni ezenza ngayo amabhulashi. 🔧 Zizodinga: 1. Ucezu lwephepha ingane ngayinye 2. Ipheksi elilodwa ingane ngayinye 3. Ucezu olulodwa lwesipontshi ingane ngayinye 4. Upende 5. Amakhrayoni

source: This is the fun part. 😃 1. Tell the children they are going to make flowers. 2. Tell them to draw a few circles on their page. Circles are the centre of the flower. They can also draw stems. 3. Help children to peg the small piece of sponge (making a paintbrush). 4. Ask them to dip the sponges in paint and make petals around the circles. 5. Encourage the older children to add other things to their paintings like the sun, grass or butterflies. 6. Allow pictures to dry then hang them around your room. 7. Extend learning while you work by asking questions.
zul: Nayi-ke ingxenye emnandi. 😃 1. Tshela izingane ukuthi zizokwenza izimbali. 2. Zitshele ukuba zidwebe izindilinga ezimbalwa ekhasini lazo. Izindilinga ziyimaphakathi lembali. Zingaphinde zidwebe isizqu. 3. Siza izingane zifake ipheksi ocezwini oluncane lwesipontshi (ukwenza ibhulashi lokupenda). 4. Zitshele zicwilise izipontshi zazo kupende zakhe amaqabunga ezimbali azungeze izindilinga. 5. Khuthaza izingane ezindadlana ukuba zifake ezinye izinto emidwebweni yazo njengelanga, utshani noma amabhebheshane. 6. Izithombe mazilindwe zome bese zilengiswa egumbini lenu. 7. Thuthukisa isikhathi sokufunda ngokubuza imibuzo ngenkathi nisebenza.

source: Make sure you talk to the kids about what they’re drawing and painting and help them if they get stuck. You can ask them some of these questions: • How many flowers will you make? • What colours will your petals be? • Is your flower tall or short? • Where does it grow? • What do flowers need to grow? • What else can you tell me about your flowers?
zul: Qinisekisa ukuthi uyakhuluma nezingane mayelana nalokho ezikudwebayo nezikupendayo, futhi uzisize lapho zixakeka. Ungazibuza eminye yale mibuzo: • Uzokwenza izimbali ezingaki? • Ingabe amacembe ezimbali zakho azoba mibala mini? • Ingabe imbali yakho yinde noma yimfishane? • Imila kuphi? • Izimbali zidingani ukuze zikhule? • Yini enye ongangitshela yona mayelana nezimbali zakho?

source: This game develops:
zul: Lo mdlalo uthuthukisa:

source: ✔️Arm & Hand Control ✔️Talking & Understanding
zul: ✔️Ukulawula ingalo nesandla ✔️Ukukhuluma nokuqonda
