Repository: Ari-Ramkilowan/po-files
Catalog: translations/SGroup5(Release (open))_Tswana.po
Languages: tsn

source: Some little ones might get stuck, but that’s fine. Here are some questions to help them talk about what’s happening and learn from it: 💬 Level 1 (simple structure) • Who can remember the pattern? • Which colour was on the bottom? • Which colour was on the top? Level 2 (more complex structure) • Who can remember the pattern? • Which colour was on the bottom? • Which colour was on the top? • Which colours will you use to repeat the pattern? • What does the pattern look like? Level 3 (even more complex structure) • Who can remember the pattern? • Which colours will you use to repeat the pattern? • What does the pattern look like? • How did you remember? • What else can you build with the bricks?
tsn: Bana ba bannye ba ka nna ba palelwa, mme go tla bo go siame. Dipotso dingwe ke tse tsa go ba thusa go bua ka se se diragalang le go ithuta mo go tsone: 💬 Maemo 1 • Ke mang yo o gopolang mokgwa o ditena di neng di beilwe ka one? • Ke mmala ofe o o neng o le kwa tlase? • Ke mmala ofe o o neng o le kwa godimo? Maemo 2 • Ke mang yo o gopolang mokgwa o ditena di neng di beilwe ka one? • Ke mmala ofe o o neng o le kwa godimo? • Ke mmala ofe o o neng o le kwa godimo? • O tla dirisa mebala efe go boeletsa mokgwa o ditena di neng di beilwe ka one? • Mokgwa o ditena di beilweng ka one o lebega jang? Maemo 3 • Ke mang yo o gopolang mokgwa o ditena di neng di beilwe ka one? • O tla dirisa mebala efe go boeletsa mokgwa o ditena di neng di beilwe ka one? • Mokgwa o ditena di beilweng ka one o lebega jang? • O dirile jang gore o gopole? • Ke eng gape se o ka se dirang ka ditenanyana?

source: See what you need
tsn: Bona se o se tlhokang

source: See how it works
tsn: Bona kafa o tshamekiwang ka teng

source: Read the notes
tsn: Bala dintlha

source: Back to menu
tsn: Boela kwa mmenyung

source: It’s time to test that memory with a game called Lego — Can You Remember? 🏅
tsn: Ke nako ya go leka gore ba gopola go le kana kang ka motshameko o o bidiwang LEGO — A o aGopola? 🏅

source: The aim is to see if the kids can remember what you did and repeat it. It helps them learn to pay attention. 🧐 1. Build a pattern of 2 bricks (e.g. red then yellow). 2. Show children for 5 seconds and then ask them to remember. 3. Hide the bricks and ask them to see if they can remember the pattern. 4. Repeat with another pattern using different colours or a different order. 5. Each time add more bricks. 6. Use fewer bricks (simple structure) with young children (ages 2 — 4). 7. Use more bricks with older children (ages 4 — 8). 8. Get the children to build patterns for everyone to copy. 9. Talk to the children about shapes, colours, or the number of bricks.
tsn: Boikaelelo ke go bona gore a bana ba kgona go gopola se o neng wa se dira le go se boeletsa. Go ba thusa go ithuta go elatlhoko. 🧐 1. Baya ditenanyana ka mokgwa o o tshwanang (Ka sekai, se sehibidu, se latelwa ke se serolwana). 2. Bontsha bana ka metsotswana e le 5 o bo o ba kopa gore ba gopole. 3. Fitlha ditenanyana o bo o ba kopa gore ba bone gore a ba ka gopola mokgwa o di beilweng ka one. 4. Boeletsa ka go di baya ka mokgwa o sele o dirisa mebala e e sa tshwaneng kgotsa ka tatelano e sele. 5. Gangwe le gape, o ka oketsa ka ditenanyana tse dingwe. 6. Dirisa ditenanyana di se kalo (kagonyana e e sa raraanang) le bana ba bannye (ba dingwaga tsa 2-4). 7. Dirisa ditenanyana di le dintsi ka bana ba bagolo (ba dingwaga tsa 2-4). 8. Dira gore bana ba di beye ka mokgwa o o rileng gore mongwe le mongwe a kgone go kopisa. 9. Bua le bana ka dipopego, mebala, kgotsa palo ya ditenanyana.

source: This game develops:
tsn: Motshameko o o a tswelela:

source: ✔️Numbers , Shapes & Sizes ✔️Skills for Learning
tsn: ✔️Dipalo, dipopego le disaese ✔️Bokgoni jwa go ithuta

source: Get as many Lego, Duplo or building blocks as you have. Each child is going to need the same amount as you.
tsn: Kgobokanya LEGO, DUPLO tsotlhe, kgotsa ditenanyana tse o nang le tsone. Ngwana mongwe le mongwe o tlile go tlhoka tse di lekanang le tsa gago ka palo.
