Repository: Ari-Ramkilowan/po-files
Catalog: translations/SGroup18(Release (open))_Zulu.po
Languages: zul

source: Need some inspiration? Keep the game going with questions like these: Level 1 • Look around and choose an item that everyone can see. • Don’t tell the others what it is. • Then say “I spy with my little eye, something that is green.” • Let the children guess what it is by calling out all the green things they see. • Try not to make it too difficult. Level 2 • Then say “I spy with my little eye, something beginning with ‘w’.” • Use the sound “w”, not the letter. • Let the kids guess the item. • Give each child a turn to take a guess. Level 3 • Then say “I spy with my little eye, something beginning with ‘ch’.” • Use the sound “ch”, not the letter. • Let the kids guess the item. • Give each child a turn to take a guess.
zul: Udinga ukuthola intshisekelo? Gcina umdlalo uhamba ngemibuzo efana nale: Izinga 1 • Bheka nxazonke bese ukhetha into wonke umuntu angayibona. • Ungabatsheli abanye ukuthi iyini. • Bese uthi "Ngihlola ngeso lami elincane, into eluhlaza okotshani.” • Dedela izingane ziqagele ukuthi yini ngokubiza zonke izinto eziluhlaza okotshani ezizibonayo. • Zama ukungakwenza kube nzima kakhulu. Izinga 2 • Bese uthi "Ngihlola ngeso lami elincane, into eqala ngo- 'w'.” • Sebenzisa umsindo "w", hhayi uhlamvu. • Dedela izingane ziqagele into leyo. • Nika ingane ngayinye ithuba lokuqagela. Izinga 3 • Bese uthi "Ngihlola ngeso lami elincane, into eqala ngo- 'ch'.” • Sebenzisa umsindo "ch", hhayi uhlamvu. • Dedela izingane ziqagele into leyo. • Nika ingane ngayinye ithuba lokuqagela.

source: We’re taking I Spy to the next level with some eye glasses. Here’s what you’ll need 👓: • 2 used toilet rolls per child. • String. • Scissors. • 2 sticks per child. • Cellotape.
zul: Sibeka umdlalo othi I Spy kwelinye izinga ngezibuko zamehlo. Nakhu ozokudinga 👓: • ama-toilet roll amabili asesebenzile ingane ngayinye • Intambo • Isikele • Izinduku ezi-2 ingane ngayinye • I-sticky ttape

source: Read the notes
zul: Funda amanothi

source: Back to menu
zul: Buyela kumenyu

source: You’ll be showing these cool kids how to make a pair of glasses.😎 1. Cut the toilet roll into 2 rings and tie them together to make glasses 2. Attach the sticks to the sides of the glasses to make the ‘arms’ of the glasses. 3. Support the younger kids. 4. Encourage the older ones to this on their own. 5. Ask the children to put their glasses on and talk about what glasses do. 6. Play I Spy: Find something in the room that everyone can see, for example, a table. 7. Say: “I Spy with my little eye, something beginning with ‘t’ (sound)” 8. Let each child have a turn guessing. 9. Walk around the room and tell them what you see through your glasses. 10. Get them to walk with you, glasses on!
zul: Uzokhombisa lezi zingane ezihlakaniphile ukuthi zenziwa kanjani izibuko. 😎 1. Sika i-toilet roll ibe ngamasongo amabili bese uwabopha ndawonye ukuze wenze izibuko. 2. Namathisela izinti ezinhlangothini zezibuko ukwenza 'izingalo' zezibuko. 3. Siza izingane ezisencane. 4. Khuthaza abadadlana ukuthi benze lokhu ngokwabo. 5. Cela izingane ukuthi zigqoke izibuko zazo bese zikhuluma ngokuthi izibuko zenzani. 6. Dlala umdlalo othi I Spy: Thola okuthile egumbini wonke umuntu angakubona, isibonelo, itafula. 7. Yithi: "Ngihlola ngeso lami elincane, into eqala ngokuthi 't' (umsindo” 8. Nikeza ingane ngayinye ithuba lokuqagela. 9. Hamba uzungeze egumbini bese ubatshela lokho okubonayo ngokusebenzisa izibuko zakho. 10. Mabahambe kanye nawe, befake izibuko!

source: See what you need
zul: Bheka ukuthi yini oyidingayo

source: See how it works
zul: Bheka ukuthi kusebenza kanjani

source: We put a spin on the classic game, I Spy. 🔍
zul: Sijik’izinto emdlaweni omdala owaziwayo ngokuthi, I Spy. 🔍

source: This game develops:
zul: Lo mdlalo uthuthukisa:

source: ✔️Social ✔️Early Reading & Writing
zul: ✔️Ukuphilisana nomphakathi ✔️Ukufunda nokubhala ngaphambi kwesikhathi esijwayelekile
