Repository: Ari-Ramkilowan/po-files
Catalog: translations/SGroup2(Release (open))_Afrikaans.po
Languages: afr

source: See what you need
afr: Kyk wat jy nodig het

source: Read the notes
afr: Lees die notas

source: Back to menu
afr: Terug na spyskaart

source: It’s time to play Knock Down Skittles. 🎳
afr: Dis tyd om ‘Gooi die Kegels om’ (Knock Down Skittles) te speel. 🎳

source: This game develops:
afr: Hierdie speletjie ontwikkel:

source: ✔️Arm & Hand Control ✔️Numbers , Shapes and Sizes
afr: ✔️Arm- en handbeheer ✔️Getalle, vorms en groottes

source: This is a great to get the children playing in groups together so that they can make new friends. 1. A set of skittles (3 to 5). You can make these out of empty drinking bottles, but not glass. 2. A ball (you can make this out of plastic bags and onion bags). 3. Space to play skittles.
afr: Dis ’n goeie speletjie om kinders in groepe te laat saamspeel sodat hulle nuwe maats kan maak. 1. ’n Stel kegels (3 tot 5). Jy kan leë bottels hiervoor gebruik, maar nie glasbottels nie. 2. ’n Bal (jy kan een van plastieksakke of uiesakke maak). 3. Ruimte om kegelspel te speel.

source: See how it works
afr: Kyk hoe dit werk

source: It’s also really straightforward, and you can play it over and over. All you have to do is: 1. Line the skittles up in a row. 2. Line the children up in front of the skittles. 3. Together take 5 steps back and count out loud as they step backwards. 4. Give each child a turn to roll the ball towards the skittles. 5. The ball should not leave the ground. 6. Reset the skittles when they have been knocked over. 7. This time take six steps back. 8. Have the children throw under arm first. 9. Then throw overarm. 10. Throw ball with two hands. 11. Throw ball with one hand.
afr: Dis regtig eenvoudig en jy kan dit oor en oor speel. Al wat jy moet doen: 1. Stel die kegels in ’n ry op. 2. Laat die kinders in ’n ry voor die kegels staan. 3. Almal neem 5 treë agteruit en tel hardop soos hul terugtree. 4. Gee elke kind ’n beurt om die bal na die kegels te rol. 5. Die bal moet heeltyd op die grond bly. 6. Stel weer die kegels op nadat dit omgegooi is. 7. Neem nou ses treë agteruit. 8. Laat die kinders eers onderarm gooi. 9. En dan oorarm. 10. Gooi die bal met twee hande. 11. Gooi die bal met een hand.

source: But it’s not just physical, you can also use these questions to help the kids learn more: Before you start: • How many skittles can you see? • What colours are they? While you’re taking turns: • How many did you knock over? • How many are left? • Can you catch the ball with 2 hands? Before you start the next round: • How many steps should we take now? • Is that more or less than last time? • Can you catch the ball 1-handed?
afr: Dit gaan nie net oor die fisiese nie. Jy kan ook hierdie vrae stel om die kinders ander dinge te leer: Voordat julle begin: • Hoeveel kegels sien jy? • Watter kleur is hulle? Terwyl hulle beurte neem: • Hoeveel het jy omgegooi? • Hoeveel bly oor? • Kan jy die bal met 2 hande vang? Voor die volgende rondte begin: • Hoeveel treë moet ons nou neem? • Is dit meer of minder as die vorige keer? • Kan jy die bal met 1 hand vang?
