Repository: Ari-Ramkilowan/po-files
Catalog: translations/SGroup2(Release (open))_Swati.po
Languages: ssw

source: See what you need
ssw: Buka kutsi yini loyidzingako

source: Read the notes
ssw: Fundza emanotsi

source: Back to menu
ssw: Buyela emuva kumenyu

source: It’s time to play Knock Down Skittles. 🎳
ssw: Sesikhatsi sekudlala umdlalo wekushaya tikotela. 🎳

source: This game develops:
ssw: Lomdlalo utfutfukisa:

source: ✔️Arm & Hand Control ✔️Numbers , Shapes and Sizes
ssw: ✔️Kulawulwa kwesandla nemkhono ✔️Tinombolo, bobunjwa nemasayizi

source: This is a great to get the children playing in groups together so that they can make new friends. 1. A set of skittles (3 to 5). You can make these out of empty drinking bottles, but not glass. 2. A ball (you can make this out of plastic bags and onion bags). 3. Space to play skittles.
ssw: Loku kulicebo lelihle lekwente kutsi bantfwana badlale ngemacembu ndzawonye kute kutsi bente bangani labasha. 1. Isethi yetikotela (3 kuya 5). Loku ungakwenta nangemabhodlela lekangenalutfo, awangabi engilazi. 2. Ibhola (loku ungakwenta ngetikhwanyana temapulasitiki netikwama tema-anyanisi). 3. Indzawo yekudlalela tikotela.

source: See how it works
ssw: Buka kutsi isebenta njani

source: It’s also really straightforward, and you can play it over and over. All you have to do is: 1. Line the skittles up in a row. 2. Line the children up in front of the skittles. 3. Together take 5 steps back and count out loud as they step backwards. 4. Give each child a turn to roll the ball towards the skittles. 5. The ball should not leave the ground. 6. Reset the skittles when they have been knocked over. 7. This time take six steps back. 8. Have the children throw under arm first. 9. Then throw overarm. 10. Throw ball with two hands. 11. Throw ball with one hand.
ssw: Awusilukhuni, kantsi ungawudlala uwuphindza phindze. Lodzinga nje kukwenta kutsi: 1. Folisa letikotela tibe ngumugca. 2. Folisa labantfwana ngembi kwaletikotela. 3. Abahlehle emuva bonkhe tinyatselo tibe sihlanu bese nibala niyamemeta ngalesikhatsi bahlehlela emuva. 4. Niketa umntfwana ngamunye litfula lekugicita ibhola icondziswe kuletikotela. 5. Lebhola akufanele isuke phansi. 6. Phindza uhlele kabusha letikotela uma ngabe tishayiwe. 7. Nyalo tsatsa tinyatselo letisitfupha. 8. Tjela labantfwana kutsi bacale ngekuphona ngaphansi kwemkhono kucala. 9. Bese baphosa ngetulu kwemkhono. 10. Jikijela lebhola ngetandla letimbili. 11. Jikijela lebhola ngesandla sinye.

source: But it’s not just physical, you can also use these questions to help the kids learn more: Before you start: • How many skittles can you see? • What colours are they? While you’re taking turns: • How many did you knock over? • How many are left? • Can you catch the ball with 2 hands? Before you start the next round: • How many steps should we take now? • Is that more or less than last time? • Can you catch the ball 1-handed?
ssw: Loku akusebentisi umtimba kuphela. Ungabuye usebentise lemibuto kusita labantfwana kutsi bafundze kabanti: Ngembi kwekutsi ucale: • Tingaki tikotela lotibonako? • Tinemibala lenjani? Ngalesikhatsi nintjintjana: • Tingaki lotishaye watiwisa? • Kusele tingaki? • Ungakhona kubamba lebhola ngetandla letimbili? Ngembi kwekutsi ucale lomjikeleto lolandzelako: • Tingaki tinyatselo lekufanele sititsatse nyalo? • Ngabe leto tingetulu noma ngaphansi kunasekucaleni? • Ungakhona kubamba ibhola ngesandla sinye?
