Repository: Ari-Ramkilowan/po-files
Catalog: translations/SGroup1(Release (open))_Pedi; Sepedi;  Northern Sotho.po
Languages: nso

source: This is the story, as well as Mandla’s actions and emotions: 1. Mandla wants to go and play with his friend Lebo (he’s excited) 😃 2. Mandla’s mama says he can go (he’s happy) 🙂 3. Mandla walks to Lebo’s house (he’s walking)🚶 4. When he gets to Lebo’s house she’s not there (he’s sad) 😞 5. So Mandla sits on the step and waits for her (he sits and feels tired) 😓 6. Lebo’s mama arrives (he’s pleased) 😁and Mandla asks where Lebo is (he’s polite) 🗣 7. She says that Lebo has gone to Mandla’s house (he’s surprised) 😱 8. Mandla runs home to find Lebo (he’s running). 🏃 9. She is there and he is happy. 😆 10. He hugs her. 🤗 You can add to the story to make it more exciting and give the children more chances to mime actions or express feelings.
nso: Ye ke kanegelo, e akaretša le mediro le maikutlo a Mandla: 1. Mandla o nyaka go ya go raloka le mogwera wa gagwe Lebo (o thakgetše). 😃 2. Mmago Mandla o mo dumeletše gore a ye (o thabile). 🙂 3. Mandla o etela gagabo Lebo (o a sepela).🚶 4. Ge a fihla gagabo Lebo, o hwetša Lebo a se gona (o swabile). 😞 5. Ka gona Mandla o dula mathuding go letela Lebo (o dula fase, o kwa go lapa). 😓 6. Mmago Lebo o a fihla (Mandla o thabile) 😁gomme Mandla o mmotšiša gore Lebo o kae (o a ikokobetša). 🗣 7. O fetola ka gore Lebo o ile gagabo Mandla (o maketše). 😱 8. Mandla o kitimela gae go hwetša Lebo (o a kitima). 🏃 9. O hwetša Lebo a le moo gomme o thabile. 😆 10. O gokara Lebo. 🤗 O ka tlaleletša kanegelo go e dira gore e thabiše kudu le go fa bana dibaka tše ntši go ekiša mediro goba go tšweletša maikutlo.

source: Why not do The Feelings Story activity? 🎭
nso: O reng o sa dire mošomo wa Kanegelo ya Maikutlo? 🎭

source: See what you need
nso: Bona se o se hlokago

source: See how it works
nso: Bona ka moo e šomago ka gona

source: Read the notes
nso: Bala dinoutse

source: Back to menu
nso: Re boela morago go menyu

source: Get ready for some acting. Lights, camera, action! 🎬 1. Tell the children the story, using puppets if you have them. 2. If not, use lots of actions, facial expressions and different voices to make it exciting. 3. Then ask the children to stand up. 4. Tell them the story again, one line at a time and ask the children to do the actions of the character Mandla. 5. Also encourage them to do facial expressions by saying, “What does a sad face look like?” or “Show me a happy face.” 6. Encourage them to take part and do any action they want to, so that they’re a part of the story.
nso: Itokišetše go tla go dira se sengwe. Mabone, setšeadiswantšho, tiro! 🎬 1. Anegela bana kanegelo, o šomiša dipopi ge e ba o na le tšona. 2. Go sego moo, šomiša ditiro tše ntši, go bolela o šomiša dika tša mmeleng le mantšu a go fapafapana go dira gore e thabiše. 3. Morago ga moo kgopela bana gore ba emelele. 4. Ba anegele kanegelo gape, mothaladi ka mothaladi gomme o ba kgopele go dira mediro ya Mandla, yo mongwe wa baanegwa. 5. Gape ba hlohleletše go bolela ba šomiša dika tša mmeleng ka gore, “Naa sefahlogo se se nyamilego se swana le eng?” goba, “Mpontšhe sefahlogo se se thabilego.” 6. Ba hlohleletše gape go kgatha tema le go dira modiro ofe goba ofe wo ba nyakago go o dira, gore e be karolo ya kanegelo.

source: This game develops:
nso: Papadi ye e kaonafatša:

source: ✔️Social skills ✔️Emotional skills
nso: ✔️Bokgoni bja leago ✔️Bokgoni bja go laola maikutlo

source: This game is all about imagination, so all you need is the children, and the story in the notes. But you can use puppets
nso: Papadi ye e mabapi le go akanya, ka gona tšeo o di hlokago ke bana, le kanegelo ka dinoutseng. Eupša o ka šomiša dipopi.
