Repository: Ari-Ramkilowan/po-files
Catalog: translations/SGroup16(Release (open))_Venda.po
Languages: ven

source: See how it works
ven: Zwi shumisa hani

source: Read the notes
ven: Kha vha vhale notsi

source: Back to menu
ven: Kha vha humele murahu kha zwirengomu

source: See what you need
ven: Zwine vha ṱoda

source: Right now could be the perfect time to teach the children about the past with Dinosaur Footprints. 🦖
ven: Zwa zwino tshingavha tshi tshifhinga tshavhuḓi tsha u gudisa vhana nga ha Ṋayo dza Dinosaur. 🦖

source: While the children work with their hands, keep their minds busy with some questions like these: Level 1 • What do you know about dinosaurs? • What sounds do dinosaurs make? • How many footprints will you make? • How many toes does this dinosaur have? • Should we walk around the room pretending we are dinosaurs? Level 2 • How big were dinosaurs? • When did dinosaurs live? (The answer can be something like: a long, long time ago)
ven: Musi vhana vha tshi khou shuma nga zwanḓa, kha vha ite uri mihumbulo yavho i dzule i tshi khou shuma nga dziṅwe dza mbudziso dzi fanaho na hedzi: Ḽiga 1 • Ni ḓivha mini nga ha dzidinosaur? • Dinosaur dzi lilisa hani? • Ni ḓo ita ṋayo nngana? • Dinosaur iyi i na zwikunwe zwingana? • Ri tea u tshimbila na kiḽasi ri tshi khou ḓiita u nga ri dzidinosaur? Ḽiga 2 • Dzinosaur dzo vha dzi ngafhani? • Dzinosaur dzo vha hone lini? (Phindulo i nga vha kalekale).

source: Before you get going on the activity, talk to the kids about dinosaurs. 🦕 1. Give each child a cut out dinosaur footprint. 2. Dip the foot in paint. 3. Press the foot onto clean paper and make a print. 4. Get children to do their own, and make a few prints on the paper. 5. They can stick leaves or grass onto the picture too. 6. Put glue around the prints and sprinkle sand on it. 7. Allow it to dry.
ven: Vha sa athu u thoma mushumo, kha vha ambe na vhana nga ha dzidinosaur. 🦕 1. Kha vha ṋee ṅwana muṅwe na muṅwe ṋayo ya dinosaur yo geriwaho. 2. Kha vha dzhenise mulenzhe kha pennde. 3. Kha vha ndondomedze mulenzhe kha bammbiri ḽo kunaho vha ite ṋayo. 4. Kha vha sumbedze vhana uri vha ite yavho, vha ite ṋayo dzo vhalaho kha bammbiri. 5. Vha nga dovha vha nambatedza maṱari kana mahatsi kha tshifanyiso. 6. Kha vha nambatedze guḽuu u mona na ṋayo vha fafadzele muṱavha khawo. 7. Kha vha zwi litshe zwi ome.

source: ✔️Talking & Understanding ✔️Arm & hand control
ven: ✔️U amba na u pfesesa ✔️Ndaulo ya tshanḓa tshoṱhe

source: All you need is: 1. A cut out dinosaur footprint per child. (The older kids can cut out their own. Ideally, these should be made from, thick, hard card.) 2. Paint. 3. A piece of paper for each child. 4. Glue 5. Sand
ven: Zwine vha ṱoḓa ndi: 1. Kha vha gere mulenzhe wa dinosaur nga ṅwana. (Vhana vhahulwane vha nga ḓigerela vhone vhaṋe. zwavhuḓisa ndi uri hu shumiswe khadibogisi ḽo kwaṱhaho ḽidenya) 2. Pennde 3. Tshipiḓa tsha bammbiri kha ṅwana muṅwe na muṅwe 4. Guḽuu 5. Muṱavha

source: This game develops:
ven: Mutambo u bveledza:
