Repository: Ari-Ramkilowan/po-files
Catalog: translations/SGroup12(Release (open))_Pedi; Sepedi;  Northern Sotho.po
Languages: nso

source: It’s time for these budding entrepreneurs to learn about the value of money. 1. Give each child their coin rubbings from the previous activity. 2. Ask them to cut out the coins. 3. Help those that need it. 4. Help them to fold over their piece of paper to make a purse. 5. Ask the children to put their coins into their new purse for safekeeping. 6. Set up a shop. 7. Talk about the items in your shop as you set up. 8. Have words under your items. Eg, milk, bread, cereal, etc. 9. Ask each child to come to your shop and buy something. 10. When they give you their money, tell them what they can buy with it. 11. Talk as you play and ask questions to help the children learn. 12. For the older children, ask them for money and give them change.
nso: Ke nako ya gore bengkgwebopotlana ba ka moso ba ithute mabapi le boleng bja tšhelete. 1. Efa ngwana yo mongwe le yo mongwe ditšheletetshipi tša bona tše di gatišitšwego go tšwa mošomong wo o fetilego. 2. Ba kgopele gore ba ripe ditšheletetshipi. 3. Thuša bao ba hlokago thušo. 4. Ba thuše go phutha pampiri ya bona go dira sekhwana. 5. Kgopela bana go bea ditšheletshipi tša bona ka sekhwameng sa bona go di boloka. 6. Beakanya lebenkele. 7. Bolela ka dithekišo ka lebenkeleng la gago ge o le gare o beakanya. 8. Ngwala mantšu ka fase ga dithekišo tša gago. Mohlala, maswi, borotho, serele, bjalobjalo. 9. Kgopela ngwana yo mongwe le yo mongwe go tla lebenkeleng la gago go reka se sengwe. 10. Ge ba le gare ba go fa tšhelete, ba botše seo ba ka se rekago ka yona. 11. Bolelang ge le le gare le raloka gomme o botšiše dipotšišo go thuša bana go ithuta. 12. Go bana ba bagolo, ba kgopele go lefela se sengwe gomme o ba fe tšhentšhi.

source: See what you need
nso: Bona se o se hlokago

source: See how it works
nso: Bona ka moo e šomago ka gona

source: Read the notes
nso: Bala dinoutse

source: Back to menu
nso: Re boela morago go menyu

source: Spending money is easy, it’s saving money that’s hard. Try remind the children how important saving is while you talk to them. 🏦 Level 1 • Where do you keep your money? • What do you want to buy at my shop? • What are you going to cook with these things…? • What else would you like to buy? Level 2 • How much money have you got? • That will cost… Level 3 • Have you got any money left? • Would you like to use that money to buy something else? • Do you have enough? • Or would you rather save it for next time? • What sounds does milk start with? (mmmm) • What sound does fish start with? (ffff)
nso: Go šomiša tšhelete go bonolo, eupša go boloka tšhelete go boima. Leka go gopotša bana ka moo go boloka go lego bohlokwa ge o le gare o bolela le bona. 🏦 Kgato ya 1 • O boloka kae tšhelete ya gago? • O rata go reka eng ka lebenkeleng la ka? • O tlile go apea eng ka dilo tše? • Ke eng gape seo o ka ratago go se reka? Kgato ya 2 • Naa ke bokae tšhelete ye o e swerego? • Yona e tla bitša… Kgato ya 3 • Naa o na le tšhelete yeo e go šaletšego? • O ka rata go šomiša tšhelete yeo go reka selo se sengwe? • Naa o na le tšhelete ye e lekanetšego? • Goba o ka rata go e bolokela nako ye e tlago? • Naa lentšu le maswi le thoma ka modumo ofe? (mmmm) • Naa lentšu le hlapi le thoma ka modumo ofe? (hlhlhlhl)

source: Let’s put the Money Rubs the children did to good use with Spending Coins!💰
nso: A re bee Ditšhelete tše di Gatišitšwego tšeo bana ba di dirilego go di šomiša ka tshwanelo le Ditšheletetshipi tša go Reka! 💰

source: This game develops:
nso: Papadi ye e kaonafatša:

source: ✔️Talking & Understanding ✔️Social
nso: ✔️Go bolela le go kwešiša ✔️Bokgoni bja leago

source: Now that the children have created their own money during the previous activity, it’s time to give them something to spend it on. You’ll need: 1. Coin drawings from the previous Small Group Activity. 2. Scissors. 3. A piece of paper for each child to make a purse. 4. Empty food containers such as cereal boxes, milk bottles, egg boxes, etc. Have enough for each child to “buy” a few items. 🍞🥔🥚
nso: Bjale ka ge bana ba hlamile tšhelete ya bona nakong ya mošomo wo o fetilego, ke nako ya gore o ba fe se sengwe seo ba ka se rekago ka yona: O tla hloka: 1. Ditšheletetshipi tše di thadilwego go tšwa Mošomong wo o fetilego wa Dihlopha tše Nnyane. 2. Sekero. 3. Efa ngwana yo mongwe le yo mongwe karolwana ya pampiri go dira sekhwama. 4. Dibjana tše di se nago selo tša go swara dijo tše bjalo ka mapokisi a diserele, mabotlelo a maswi, mapokisi a mae, bjalobjalo. Dira tšhelete ye e lekanetšego gore ngwana yo mongwe le yo mongwe a “reke” dilo tše mmalwa. 🍞🥔🥚
