Repository: Ari-Ramkilowan/po-files
Catalog: translations/SGroup7(Release (open))_Southern Sotho.po
Languages: sot

source: Read the notes
sot: Bala dinoutso

source: See what you need
sot: Sheba seo o se hlokang

source: See how it works
sot: Bona hore e sebetsa jwang

source: Back to menu
sot: Kgutlela ho menu

source: The lion is the king of the jungle, let’s see what the kids know about it: Level 1 • What sound does a lion make? • Where do they live? • What do they eat? • What should you do if you see a lion? Level 2 • What kind of animals are they? (Cats and mammals) • What do they look like? • How big are they? • What colour are they? Level 3 • What else can you tell me about lions? • What other animals live near lions? • Let’s talk about those – what do you know about elephants, or rhinos? • What sound does the word ‘lion’ start with? • What sound does the word ‘rhino’ start with? • What sound does the word ‘elephant’ start with?
sot: Tau ke morena wa naheng, ha re boneng hore bana ba tseba hakae mabapi le tau: Mohato wa 1 • Tau e etsa modumo ofe? • Di dula hokae? • Di ja eng? • O lokela ho etsang ha o bona tau? Mohato wa 2 • Ditau ke mefuta efe ya diphoofolo? (Dikatse le diantshi) • Di shebahala jwalo ka eng? • Di kgolo hakae? • Mmala wa tsona ke ofe? Mohato wa 3 • Ke eng hape eo le ka mpolellang yona ka ditau? • Ke diphoofolo dife tse ding tse phelang haufi le ditau? • Ha re bueng ka tsona – le tseba eng ka ditlou, kapa ditshukudu? • Lentswe lee ‘tau’ le qala ka modumo ofe? • Lentswe lee ‘tshukudu’ le qala ka modumo ofe? • Lentswe lee ‘tlou’ le qala ka modumo ofe?

source: This game develops:
sot: Papadi ena e ntshetsa pele:

source: Have you made any Little Lions yet? 🦁
sot: Na le se le entse Ditau tse Nyane? 🦁

source: ✔️Walking & Moving ✔️Arm & Hand control
sot: ✔️Ho tsamaya le ho sutha ✔️Taolo ya sephaka le letsoho

source: If you have time, get the children cut these things out themselves: ✂ - 1 paper per child for the lion’s face - 2 black eyes per child cut out of paper - 1 nose per child cut out of paper - 2 ears per child cut out of paper - 1 plastic / onion bag per child
sot: Haeba o na le nako, ere bana ba sehe le ho ntsha ntho tsena ka bobona: ✂ 1. Pampiri e 1 ngwana ka mong bakeng sa sefahleho sa tau 2. Mahlo a 2 a matsho ngwana ka mong a sehilweng pampiring 3. Nko e 1 ngwana ka mong e sehilweng pampiring 4. Ditsebe tse 2 ngwana ka mong tse sehilweng pampiring 5. Mokotlana o 1 wa polasetiki/eie ngwana ka mong

source: You can use this activity as an opportunity to teach children about animals. 1.Talk about lions before you make the lion face. 2.Ask each child to cut out a circle to make the lions face. 3.They can colour in the face of the lion and stick on eyes, nose and ears. 4.Get them to cut strips of plastic or onion bag for the mane of the lion. 5.Stick on the strips. 6.If you have string, you could make holes in the eyes and turn the lion face into a mask. 7.Get children to crawl around and roar like lions.
sot: O ka sebedisa ketsahalo ena ele monyetla wa ho ruta bana ka diphoofolo. 1. Bua ka ditau pele o ka etsa sefahleho sa tau. 2. Kopa ngwana ka mong ho seha le ho ntsha sedikadikwe bakeng sa ho etsa sefahleho sa tau. 3. Ba ka kenya mebala sefahlehong sa tau mme ba kgomaretsa mahlo, nko le ditsebe. 4. Ere ba sehe dikgetjhana tsa polasetiki kapa mokotlana wa eie bakeng sa ho etsa moetse wa tau. 5. Kgomaretsa dikgetjhana tseo. 6. Haeba o na le kgwele, o ka nna wa etsa masoba mahlong mme wa fetola sefahleho sa tau maske. 7. Ere bana ba kgase ka mangwele ban ne ba purume jwalo ka tau.
