Repository: Ari-Ramkilowan/po-files
Catalog: translations/SGroup11(Release (open))_Zulu.po
Languages: zul

source: The little ones might struggle with the higher levels, but these questions are a great way to ease them into basic maths, and an education on money. 💸 Level 1 • What colours have you used? • What shape are the coins? • Which is the biggest coin? • Which is the smallest? • How many coins do we have? • What do we do with money? • Where should we keep our money? Level 2 • Who can show me a R1 coin? • Who can show me a R2 coin? • Who can show me a R5 coin? • How can you make R6? • How can you make R3 etc? • Etc Level 3 • Who can show me a 5 cent coin? • Who can show me a 10 cent coin? • Who can show me a 20 cent coin? • Who can show me a 50 cent coin? • How can you make 20 cents? • How can you make 10 cents? • Etc
zul: Izingane zingase ziwathole elukhuni amazinga aphezulu, kodwa le mibuzo iyindlela enhle yokuzifundisa izibalo eziyisisekelo, nemfundo ngemali. 💸 Izinga 1 • Yimiphi imibala oyisebenzisile? • Izinhlamvu zemali ziyimiphi imimo? • Yiluphi uhlamvu lwemali olukhulu kakhulu? • Yiluphi uhlamvu lwemali oluncane kakhulu? • Zingaki izinhlamvu zemali esinazo? • Siyenzani imali? • Kufanele siyigcine kuphi imali yethu? Izinga 2 • Ubani ongangikhombisa uhlamvu lwemali engu-R1? • Ubani ongangibonisa uhlamvu lwemali engu-R2? • Ubani ongangibonisa uhlamvu lwemali engu-R5? • Ungamenza kanjani u-R6? • Ungamenza kanjani u-R3 njll? Izinga 3 • Ubani ongangibonisa uhlamvu lwemali engamasenti ayisi-5? • Ubani ongangibonisa uhlamvu lwemali engamasenti ayi-10? • Ubani ongangibonisa uhlamvu lwemali engamasenti angama-20? • Ubani ongangibonisa uhlamvu lwemali engamasenti angamashumi amahlanu? • Ungawenza kanjani amasenti angama-20? • Ungawenza kanjani amasenti ayi-10?

source: Engage the children in a conversation about money while they go about this game. 1. Make sure each coin has been washed and is clean. 2. While you talk about money and what it’s used for, give each child a coin. 3. Ask them to look at their coin and tell you what they see. 4. Give them each a crayon and a piece of paper. 5. Show them that if you put the coin under the paper and then rub the crayon over it, you’ll see the picture of a coin. 6. Get them to share their items and explore different coins and colours.
zul: Qala ingxoxo mayelana nemali ngenkathi izingane zidlala lo mdlalo. 1. Qinisekisa ukuthi imali ngayinye igeziwe futhi ihlanzekile. 2. Ngenkathi ukhuluma ngemali nokuthi isetshenziselwani, nikeza ingane ngayinye uhlamvu lwemali. 3. Batshele babuke uhlamvu lwemali yabo bese bekutshela lokho abakubonayo. 4. Banike ngamunye ikhrayoni kanye nocezu lwephepha. 5. Babonise ukuthi uma ubeka uhlamvu lwemali ngaphansi kwephepha bese ukhuhla ikhrayoni phezu kwalo, uzosibona isithombe sohlamvu lwemali. 6.Batshele bashintshelane ngezinto zabo futhi bakwazi ukubuka izinhlamvu zemali ezahlukene nemibala.

source: Back to menu
zul: Buyela kumenyu

source: See what you need
zul: Bheka ukuthi yini oyidingayo

source: See how it works
zul: Bheka ukuthi kusebenza kanjani

source: Read the notes
zul: Funda amanothi

source: Remind the kids they’ll need to be very responsible when they’re each given one of the following: 1. A coin 2. A piece of paper 3. A crayon
zul: Khumbuza izingane ukuthi kuzodingeka ziqikelele kakhulu lapho zinikezwa ngakunye kokulandelayo: 1. Uhlamvu lwemali 2. Ucezu lwephepha 3. Ikhrayoni

source: This game develops:
zul: Lo mdlalo uthuthukisa:

source: It’s never too early to start learning about money with Money Rubs! 💰
zul: Asikadluli isikhathi sokuqala ukufunda ngemali ngmdlalo othi Money Rubs! 💰

source: ✔️Numbers , shapes & sizes ✔️ Arm & Hand Control
zul: ✔️Izinombolo, imimo nosayizi ✔️ Amakhono okulawula izingalo nezandla
