Repository: Ari-Ramkilowan/po-files
Catalog: translations/SGroup19(Release (open))_Venda.po
Languages: ven

source: Back to menu
ven: Kha vha humele murahu

source: See what you need
ven: Zwine vha ṱoḓa

source: Read the notes
ven: Kha vha vhale notsi

source: See how it works
ven: Zwi shumisa hani

source: This game develops:
ven: Mutambo uyu u bveledza:

source: It’s time to decorate your classroom by Making Chains. Don’t worry, the children’s chains will be way nice than these: ⛓
ven: Ndi tshifhinga tsha u khavhisa kiḽasi nga u ita Ngeḓane. Vha songo vhilaela, ngeḓane dza vhana dzi ḓo vha dzi dzavhuḓi u fhira hezwi: ⛓

source: ✔️Skills for Learning ✔️Arm & hand control
ven: ✔️Vhukoni ha u guda ✔️Ndaulo ya tshanḓa tshoṱhe

source: Good news! You probably have everything you need under your nose right now. 1. Coloured paper 2. Scissors 3. Glue
ven: Mafhungo avhuḓi! Zwoṱhe zwine vha zwiṱoḓa vha nga vha vha nazwo hanefho. 1. Mabambiri a mivhala 2. Zwigero 3. Guḽuu

source: Not exactly sure what to ask? Try out some of these questions: Level 1 • What colour do you like? • How many links will you make? • What could you use your chain for? Level 2 • What is your pattern? • How many colours do you have? Level 3 • How many links do you have? • How many links does your friend have? • How many links do you have together? • What if I take 5 links away? • How many will you have left?
ven: A vha na vhuṱanzi uri vha nga vhudzisa uri mini? Kha vha lingedze dziṅwe dza mbudziso idzi: Ḽiga 1 • Ni funa muvhala ufhio? • No ḓo ṱumekanya zwibammbiri zwingana? • Ni nga shumisa ngeḓane yaṋu u ita mini? Ḽiga 2 • Phetheni yaṋu ndi ifhio? • Ni na mivhala mingana? Ḽiga 3 • No ṱumekanya zwingana? • Khonani yaṋu o ṱumekanya zwingana? • Zwo ṱangana no ṱumekanya zwingana? • Arali nda nga ṱusa zwiṱanu (5), ni ḓo vha no sala na zwingana?

source: This activity is great for the children’s hand-eye coordination! 🖐🏿 👁 • Help the children cut the coloured paper into short strips. • They should each have about 10 strips . • Stick the 2 short edges of one strip together, making a ring. • Thread a new strip through the ring and stick its ends together, linking the 2 rings. • Continue with at least 10 strips, and make rings that link to each other. • Make scarves, necklaces, or belts with them before hanging them up in the classroom. • Ask questions as you work to help the kids learn.
ven: Mushumo ndi wavhuḓisa kha khoneyo ya tshanḓa na iṱo kha vhana! 🖐🏿 👁 • Kha vha thuse vhana u gera mabammriri a re na mivhala avhe zwibammbiri zwisekene zwipfufhi. • Vhoṱhe vha tea u vha na zwibammiri zwa 10. • Kha vha ṱumekanye magumo a zwibammbiri zwivhili, zwi ite riingi. • Kha vha dzhenise tshiṅwe tshibammbiri kha riingi vha kone u tshi nambatedza magumoni atsho, vha tshi khou ṱanganyisa riingi idzo mbili. • Kha vha bvele phanḓa u swika kha zwibammiri zwa 10, vha ite riingi dzo ṱumekanyiwaho. • Kha vha ite zwikhafu, ngeḓane ya mukuloni, kana mabannda vha sa athu u zwi nambatedza kiḽasini. • Kha vha vhudzise mbudziso musi vha tshi khou shuma u thusa vhana u guda.
