Repository: Ari-Ramkilowan/po-files
Catalog: translations/SGroup18(Release (open))_Swati.po
Languages: ssw

source: Need some inspiration? Keep the game going with questions like these: Level 1 • Look around and choose an item that everyone can see. • Don’t tell the others what it is. • Then say “I spy with my little eye, something that is green.” • Let the children guess what it is by calling out all the green things they see. • Try not to make it too difficult. Level 2 • Then say “I spy with my little eye, something beginning with ‘w’.” • Use the sound “w”, not the letter. • Let the kids guess the item. • Give each child a turn to take a guess. Level 3 • Then say “I spy with my little eye, something beginning with ‘ch’.” • Use the sound “ch”, not the letter. • Let the kids guess the item. • Give each child a turn to take a guess.
ssw: Udzinga kukhutsatwa? Yenta lomdlalo uchubeke ngekubuta imibuto lenjengalena: Lizinga1 • Buka lapho ukhona bese ukhetsa intfo lebonwa ngibo bonkhe. • Ungabatjeli labanye kutsi yini. • Bese utsi “Ngiyinhloli ngemehlo ami lamancane, intfo lengatsi iluhlata.” • Labantfwana abacombele kutsi yini lekayibonako ngekutsi babite tonkhe tintfo letiluhlata labatibonako. • Zama kutsi ungakwenti kube lukhuni. Lizinga2 • Bese utsi “Ngiyinhloli ngemehlo ami lamancane, intfo lecala nga ‘w’.” • Sebentisa lomsindvo “w”, hhayi loluhlavu. • Bantfwana abacombele kutsi yini. • Niketa umntfwana ngamunye litfuba lekucombela. Lizinga3 • Bese utsi “Ngiyinhloli ngemehlo ami lamancane, intfo lecala nga ‘ch’.” • Sebentisa lomsindvo “ch”, hhayi loluhlavu. • Bantfwana abacombele kutsi yini. • Niketa umntfwana ngamunye litfuba lekucombela.

source: We’re taking I Spy to the next level with some eye glasses. Here’s what you’ll need 👓: • 2 used toilet rolls per child. • String. • Scissors. • 2 sticks per child. • Cellotape.
ssw: Sitsatsa lomdlalo lotsi ngiyinhloli siwuyisa kulelinye lizinga ngekusebentisa emagogozi, Naku lotakudzinga 👓: • 2 wetikopokopo temathishu kumntfwana ngamunye • Intsambo • Tikelo • 2 tintsi temntfwana ngamunye • iselothephu lenamatselako

source: Read the notes
ssw: Fundza emanotsi

source: Back to menu
ssw: Buyela emuva kumenyu

source: You’ll be showing these cool kids how to make a pair of glasses.😎 1. Cut the toilet roll into 2 rings and tie them together to make glasses 2. Attach the sticks to the sides of the glasses to make the ‘arms’ of the glasses. 3. Support the younger kids. 4. Encourage the older ones to this on their own. 5. Ask the children to put their glasses on and talk about what glasses do. 6. Play I Spy: Find something in the room that everyone can see, for example, a table. 7. Say: “I Spy with my little eye, something beginning with ‘t’ (sound)” 8. Let each child have a turn guessing. 9. Walk around the room and tell them what you see through your glasses. 10. Get them to walk with you, glasses on!
ssw: Utawube ukhombisa labantfwana labahle kutsi entiwa njani emagogozi. 😎 1. Juba lesikopokopo sethishu sibe tindingilizi letimbili bese utibopha ndzawonye kwenta emagogozi. 2. Namatsisela letintsi emaceleni kwalamagogozi kute wente imikhono yalamagogozi. 3. Khutsata laba labadzadlana kutsi batentele loku ngekwabo. 4. Cela bantfwana kutsi bafake emagogozi abo bese bakhuluma ngekutsi emagogozi entani. 5. Dlala ngiyinhloli: Tfola intfo lengekhatsi endlini lewonkhe umuntfu akhona kuyibona, sibonelo, litafula. 6. Tsani: “Ngiyahlola ngeliso lami lelincane, intfo lecala ngemsindvo ‘t’ (umsindvo)” 7. Umntfwana ngamunye akabe nelitfuba lekucombela. 8. Hambahamba lapha endlini ubatjele kutsi ubonani ngemagogozi akho. 9. Abahambahambe nawe, bafake emagogozi abo!

source: See what you need
ssw: Buka kutsi yini loyidzingako

source: See how it works
ssw: Buka kutsi isebenta njani

source: We put a spin on the classic game, I Spy. 🔍
ssw: Siyawugucula nyalo lomdlalo wetfu lomnandzi lotsi, Ngiyinhloli. 🔍

source: This game develops:
ssw: Lomdlalo utfutfukisa:

source: ✔️Social ✔️Early Reading & Writing
ssw: ✔️Kuphilisana ✔️Kukwati kufundza nekubhala kusenesikhatsi
