Repository: Ari-Ramkilowan/po-files
Catalog: translations/SGroup3(Release (open))_Tsonga.po
Languages: tso

source: On a rainy day, or if you’ve got a very physical Large group activity planned, why not have some Puzzle Fun? 🌧= 🖼
tso: Hi siku ra mpfula, kumbe loko u ri na kungu ra nghingiriko wo endla wa ntlawa lowukulu, hikwalahokayini vi na ku Tiphina hi Phazili? 🌧= 🖼

source: You don’t even need to go buy puzzles, all you need is: 1. 3 homemade puzzles made from pictures in magazines (choose pictures that children enjoy). 2. Ensure that there are some easier puzzles for younger children, but not too easy.
tso: A wu kali u lava ku ya xava tiphazili, wo lava ntsena: 1. Tiphazili ti 3 to endliwa ekaya leti nga endliwa hi swifaniso swa le ka timagazini (hlawula swifaniso leswi vana va swi tsakelaka). 2. Vona leswaku ku na tiphazili to olova ta vana lavantsongo, kambe ti nga olovi ku hundza mpimo.

source: Once you have your amazing, custom puzzles you can begin. 1. Choose easier puzzles for young children and give more difficult puzzles to older children. 2. Give each child a piece of a puzzle. 3. Ask them to put their pieces down so that everyone can see. 4. Then give them additional pieces, one by one. 5. Slowly help them arrange the pieces so that they can make the puzzle. 6. Talk about the picture. 7. Repeat with the other puzzles. 8. If you think they are able, mix up the 3 puzzles and see if they can sort them out, and build the 3 separate puzzles.
tso: Loko se u ri na tiphazili ta wena leto hlamarisa leti u nga tiendlela tona u nga sungula. 1. Hlawula tiphazili to olova u nyika vana lavantsongo na ku nyika vana lavakulu tiphazili leto tika. 2. Nyika n’wana un’wana na un’wana xiphemu xa phazili. 3. Va byeli ku veka swiphemu swa vona ehansi leswaku un’wana na un’wana a swi vona. 4. Kutani u va nyika swiphemu swo engetela, ha xin’we xin’we. 5. Va pfune ku veketela swiphemu swa vona hi ku nonoka leswaku va endla phazili. 6. Vulavula hi xifaniso. 7. Vuyelela hi tiphazili letin’wana. 8. Loko u ehleketa leswaku va swi kota, katsakatsa tiphazili leti 3 u vona loko va kota ku tipaketela kahle, na ku aka tiphazili ti 3 to hambana.

source: See what you need
tso: Vona leswi u swi lavaka

source: See how it works
tso: Vona leswaku swi tirha njhani

source: Read the notes
tso: Hlaya tinotsi

source: Back to menu
tso: Ku tlhelela eka menyu

source: This game develops:
tso: Ntlangu lowu wu ya emahlweni:

source: ✔️Exploring & Finding out ✔️Skills for Learning
tso: ✔️Ku valanga na ku kuma ✔️Swikili swo dyondza

source: And because this game is to help develop the children’s thinking skills, ask some questions along the way. For the easier puzzles: • What do you think this picture is? • Where do you think this piece goes? While putting the puzzle together: • Tell me about this picture? • What can you see? • Is this an edge or a middle piece? If you mix all three puzzles: • What happens if we mix up the puzzles? • Who has this piece?
tso: Hikwalahokaleswi ntlangu lowu wu faneleke ku pfuna hi ku hluvukisa swikili swa vana swo ehleketa, vutisa swivutiso loko va ri karhi va wu endla. Swivutiso swa tiphazili leto olova: • Xana u ehleketa leswaku xifaniso lexi i yini? • Xana u ehleketa leswaku xiphemu lexi xi ya kwihi? Loko va ri karhi va khomanisa phazili: • Xana u nga ndzi byela yini hi xifaniso lexi? • Xana u vona yini? • Xana lexi i xiphemu xa le makumu kumbe xa le xikarhi? Loko u hlanganisa tiphazili hinkwato ti ri tinharhu: • Xana ku humelela yini loko hihlanganisela tiphazili? • I mani a nga na xiphemu?
