Repository: Ari-Ramkilowan/po-files
Catalog: translations/SGroup12(Release (open))_Tswana.po
Languages: tsn

source: It’s time for these budding entrepreneurs to learn about the value of money. 1. Give each child their coin rubbings from the previous activity. 2. Ask them to cut out the coins. 3. Help those that need it. 4. Help them to fold over their piece of paper to make a purse. 5. Ask the children to put their coins into their new purse for safekeeping. 6. Set up a shop. 7. Talk about the items in your shop as you set up. 8. Have words under your items. Eg, milk, bread, cereal, etc. 9. Ask each child to come to your shop and buy something. 10. When they give you their money, tell them what they can buy with it. 11. Talk as you play and ask questions to help the children learn. 12. For the older children, ask them for money and give them change.
tsn: Ke nako ya gore borakgwebonyana ba ba simololang bano ba ithute kaga mosla wa madi. 1. Naya ngwana mongwe le mongwe ditshwantsho tsa madi a tshipi a ba a dirileng mo tirwaneng e e fetileng. 2. Ba kope gore ba segolole madi a tshipi. 3. Thusa ba ba sa kgoneng. 4. Ba thuse gomena dipampiri tsa bone go dira sepatšhe. 5. Kopa bana go tsenya madi a bone a tshipi mo sepatšheng sa bone se sesha gore ba a boloke sentle. 6. Dira lebentlele. 7. Bua ka dilo tse di mo lebentleleng la gago jaaka o le rulaganya. 8. Kwala mafoko kafa tlase ga dilwana tsa gago. Ka sekai, mashi, borotho, seriele, jalo jalo. 9. Kopa ngwana mongwe le mongwe gore a tle kwa lebentleleng la gago go tla go reka sengwe. 10. Fa ba go neela madi a bone, ba bolelele gore ba ka rekang ka one. 11. Nna o bue fa o ntse o tshameka mme o botse dipotso go thusa bana go ithuta. 12. Ka bana ba bagolowane, ba kope go duela sengwe le go ba naya madi a a setseng.

source: See what you need
tsn: Bona se o se tlhokang

source: See how it works
tsn: Bona kafa o tshamekiwang ka teng

source: Read the notes
tsn: Bala dintlha

source: Back to menu
tsn: Boela kwa mmenyung

source: Spending money is easy, it’s saving money that’s hard. Try remind the children how important saving is while you talk to them. 🏦 Level 1 • Where do you keep your money? • What do you want to buy at my shop? • What are you going to cook with these things…? • What else would you like to buy? Level 2 • How much money have you got? • That will cost… Level 3 • Have you got any money left? • Would you like to use that money to buy something else? • Do you have enough? • Or would you rather save it for next time? • What sounds does milk start with? (mmmm) • What sound does fish start with? (ffff)
tsn: Go reka ka madi go bonolo, go a boloka ke gone go leng thata. Leka go gopotsa bana botlhokwa jwa go boloka madi fa o ntse o bua le bone. 🏦 Maemo 1 • O boloka madi a gago kwa kae? • Ke eng se o batlang go se reka kwa lebentleleng? • O tlile go apaya eng ka dilo tse? • Ke eng gape se o ka batlang go se reka? Maemo 2 • O na le madi a a kana kang? • Fa o reka seo o tlile go duela… Maemo 3 • A o na le madi a a go saletseng? • A o batla go dirisa madi ao go reka sengwe se sele? • A o na le madi a a lekaneng? • Kgotsa a o batla go a boloka go a dirisa mo nakong e e tlang? • Lefoko mashi le simolola ka moduo wa tlhaka efe? (mmmm) • Lefoko tlhapi le simolola ka modumo wa tlhaka efe? (tlh)

source: Let’s put the Money Rubs the children did to good use with Spending Coins!💰
tsn: A re diriseng go Gotlhagotlha Madi mo bana go dirileng sentle ka motshameko wa Go Reka ka Madi a Tshipi! 💰

source: This game develops:
tsn: Motshameko o o a tswelela:

source: ✔️Talking & Understanding ✔️Social
tsn: ✔️Go bua le go tlhaloganya ✔️Bokgoni jwa batho

source: Now that the children have created their own money during the previous activity, it’s time to give them something to spend it on. You’ll need: 1. Coin drawings from the previous Small Group Activity. 2. Scissors. 3. A piece of paper for each child to make a purse. 4. Empty food containers such as cereal boxes, milk bottles, egg boxes, etc. Have enough for each child to “buy” a few items. 🍞🥔🥚
tsn: Jaanong e re ka bana ba itiretse madi a bone mo tirwaneng e e fetileng, ke nako ya go ba naya sengwe se ba ka rekang ka tsone. O tla tlhoka: 1. Ditshwantshiwa tsa Tirwana e e fetileng ya Setlhopa se Sennye. 2. Dikere. 3. Ngwana mongwe le mongwe a na le pampiri ya gagwe go dira sepatšhe. 4. Ntsha se se mo dikhontheinareng tsa dijo tse di tshwanang le mabokoso a disiriele, mabotlolo a mashi, mabokoso a mae, jalo jalo. Dira gore ngwana mongwe le mongwe a nne le madi a a lekaneng go “reka” dilo di le mmalwa. 🍞🥔🥚
