Repository: Ari-Ramkilowan/po-files
Catalog: translations/SGroup20(Release (open))_Tswana.po
Languages: tsn

source: See how it works
tsn: Bona kafa o tshamekiwang ka teng

source: Animal Pond
tsn: Fa e le gore ga o ise o bolelele bana setori sepe gompieno, Lekadiba la Diphologolo e ka nna tirwana e e siameng thata.🐘🐂🐪

source: Read the notes
tsn: Bala dintlha

source: Back to menu
tsn: Boela kwa mmenyung

source: See what you need
tsn: Bona se o se tlhokang

source: Let the children build on their brilliant stories by asking them these questions: Level 1 • What animal do you have? • Where does he want to go? • How will you help him? • What will you build? • How will you build it? • How will the animal cross? • Where is he going now? Level 2 • How does your goat feel? • What does he feel that way? • What will make him feel scared? • What will make him feel safe and happy? Level 3 • Tell me the story of your little goat.
tsn: Dira gore bana ba tsweledise setori sa bone se se botlhale ka go ba botsa dipotso tse: Maemo 1 • Ke phologolo efe e le nang le yone? • E batla go ya kae? • Le tlile go e thusa jang? • Le tlile go aga eng? • Le tlile go bo aga jang? • Phologolo e tlile go kgabaganya jang? • Jaanong e ya ko kae? Maemo 2 • Podi ya gago e ikutlwa jang? • Goreng e ikutlwa jalo? • Ke eng se se ka dirang gore e ikutlwe e tshogile? • Ke eng se se ka e dirang gore e ikutlwe e bolokesegile ebile a itumetse? Maemo 3 • Mpoleleleng setori ka potsanyane.

source: This game develops:
tsn: Motshameko o a tswelela:

source: ✔️Skills for Learning ✔️Exploring & Finding Out
tsn: ✔️Bokgoni jwa go ithuta ✔️Go batla le go bona

source: So many benefits, so few items needed: 1. Duplo LEGO blocks 2. Plastic animals 3. Blue paper 4. Scissors
tsn: Mesola e mentsi, go tlhokega dilo di sekae fela: 1. Diboloko tsa DUPLO LEGO 2. Diphologolo tsa polasetiki 3. Pampiri e e boluo 4. Sekere

source: How does it work? 1. Cut a circle out of the blue paper and use it as the pond. 2. Tell the story about a little animal who is trying to get across the pond to see its mommy. 3. It can’t swim and it’s too far to walk around the pond. 4. Divide the children into pairs and give them some duplo blocks. 5. Ask them to build a bridge for the little animal. 6. Once they have finished, ask them to show you how their animal crosses the bridge 7. Get them to tell you the story in their own way
tsn: O dirwa jang? 1. Segolola sekele mo pampiring e e boluo o bo o e dirisa jaaka lekadiba. 2. Bolela setori ka phologotswana e e lekang go kgabaganya lekadiba go bona mmaayone. 3. Ga e kgone go thuma mme go kgakala otsamaya ka dinao go dikologa lekadiba. 4. Kgaoganya bana ka sebedi mme o ba neye diboloko dingwe tsa DUPLO. 5. Ba kope gore ba agele phologotswana borogo. 6. Fa ba sena go fetsa, ba kope gore ba go bontshe gore phologolo ya bone e tlile go tlola borogo jang. 7. Dira gore ba go bolelele setori kafa ba bonang ka teng.
