Repository: Ari-Ramkilowan/po-files
Catalog: translations/SGroup8(Release (open))_South Ndebele.po
Languages: nbl

source: Another great arts and crafts activity is Making Faces 😃🙃🤪😜🤩😎😠🤗🤐😴🤕🤒🤠🤯😍
nbl: Esinye isifundo sobukghwari esihle sibizwa ngokuthi yi - Making Faces ( Ukwenza uBuso) 😃🙃🤪😜🤩😎😠🤗🤐😴🤕🤒🤠🤯😍

source: But I don’t mean pulling faces, I mean making them with: 1. 1 piece of paper per child 2. Wool 3. Scissors and glue For younger children: 1. Cut out 1 pair of eyes per child. 2. Cut out 1 pair of ears per child. 3. Cut out nose per child. 4. Cut out mouth per child. For older children: 1. Pictures where they can cut out the eyes, nose, mouth etc.
nbl: Kodwana angitjho ukudosa ubuso, ngitjho ukubenza nge: 1.Isiquntu si - 1 sephepha umntwana ngamunye 2.Iwulu 3.Iskere 4.Isinamathelisi Abantwana abancane: 1.Sika ipara yi – 1 yamehlo umntwana ngamunye. 2.Sika ipara yi – 1 yeendlebe umntwana ngamunye. 3.Sika ipumulo yi – 1 umntwana ngamunye. 4.Sika umlomo umntwana ngamunye. Abantwana abadala: 1.Iinthombe lapho bazakusika khona amehlo, ipumulo, umlomo njalonjalo.

source: Read the notes
nbl: Funda amaAwathi

source: See what you need
nbl: Bona ukuthi utlhoga ini

source: See how it works
nbl: Bona ukuthi isebenza bunjani

source: Back to menu
nbl: Buyela erhelweni

source: This game develops:
nbl: Umdlalo lo uthuthukisa:

source: ✔️Arm & Hand Control ✔️Talking & Understanding
nbl: ✔️Ukulawula umkhoAwa nesandla ✔️Ukukhuluma Awakuzwisisa

source: Once you have everything you need: 1. Give each child a piece of paper and cut-out pictures of noses, eyes, ears and mouths to give to younger children. 2. Give pictures of faces to older children. 3. Ask them to use the pictures to make a face. 4. Talk about the senses as you do it (smell, taste, seeing, hearing etc.). 5. Get them to stick their pictures down when they have made their faces. 6. Give them each some wool and ask them to turn it into hair. 7. They can cut and stick the materials in any way they want to. 8. Look at the faces together and talk about them to help the kids learn. There are examples of what to ask in the notes. 9. Cut the faces out and attach them to a stick. 10. You can use these to tell stories.
nbl: Nasele unakho koke utlhoga lokhu: 1.Nikeza umntwana ngamunye isiquntu sephepha bese usika iimpumulo, amehlo, iindlebe, nemilomo bese banikela abantwana abancane. 2.Nikeza abantwana abakhulu iinthombe zobuso. 3.Babawe bona basebenzise iinthombe ukwenza ubuso. 4.Coca ngemizwa njengoba wenza (ukunukelela, ukunambitha, ukubona, ukuzwa, ukuthinta njll.). 5.Mabanamathisele iinthombe zabo nasele baqedile ukwenza ubuso. 6.Nikela omunye Awamunye iwulu bese ubabawa ukuthi benze iinhluthu. 7.Bangasisa bebanamathisele izinto zabo ngendlela abayithandako. 8.Qalani ubuso niAwake bese nicoca ngabo ukurhelebha abantwana ukuthi bafunde. Kuneembonelo eningaziqala emaAwathini. 9.Sika ubuso bese uyabunamathisela. 10.Ungasebenzisa lokhu ukucoca iAwalwana.

source: As promised, here are some questions: ❓ Level 1 • What do we use our noses for? • What do we use our eyes for? • And our ears? • Is your face happy or sad? • What kind of hair will you make? • What is the name of this face? Level 2 • What is your favourite taste? • What do you like to smell? • What can you hear right now? • What can you see with your eyes if you look left? • What can you see with your eyes if you look to the right? Level 3 Allow older children to make up a story - for example: • Who does your face belong to? • Mine is a gogo • What do you want to say to gogo? • Gogo asks: “What you would like for supper?” • Gogo asks if you will help her make supper. • What shall we do first? You can even act the story out if you like.
nbl: Njengombana sithembisile, nasi eminye imibuzo: Ileveli yoku - 1 • Iimpumulo zethu sizisebenzisela ini? • Amehlo wethu siwasebenzisela inir? • Iindlebe zethu zona? • Ubuso bakho bona buthabile namkha budanile? • Zinjani iinhluthu ozakuzenza? • Lithini igama lobusobu? Ileveli Iyei - 2 • Ngikuphi ukunambitha okuthandako? • Uthanda ukunuka ini? • Uzwa ini njenganje? • Ubona ini ngamehlwakho nawuqala ngesinceleni? • Ubona ini ngamehlwakho nawuqala ngesidleni? Ileveli Iyei - 3 Vumela abantwana abakhulu ukuthi bazithomele iAwalwana – isibonelo: • Ubuso bakho bungekabani? • Bami ngugogo. • Ufuna ukuthini kugogo? • Ugogo uyabuza: “Uthanda ukudla ini ntambama?” • Ugogo uyabuza ukuthi uzakumrhelebha na ukwenza isidlo santambama. • Senzeni maqangi? Ningasilingisa istoresi nanithandako.
