Repository: Ari-Ramkilowan/po-files
Catalog: translations/SGroup13(Release (open))_Zulu.po
Languages: zul

source: Read the notes
zul: Funda amanothi

source: See what you need
zul: Bheka ukuthi yini oyidingayo

source: See how it works
zul: Bheka ukuthi kusebenza kanjani

source: Back to menu
zul: Buyela kumenyu

source: Make sure the children don’t get too excited and take a bite out of their playdough! 🤢 1. Tell the children that they’re going to make an ice cream. 2. Talk about ice creams. 3. Show them how to roll the play dough into long, thin sausages, and then roll them round and round, making a circle. 4. Put a stick in to make an ice cream. 5. Show them the other kinds of ice creams you can make by rolling balls and decorating them. 6. Have fun, ask questions, and talk to help the children learn more as they play. 7. Set up an ice cream shop to sell the ice creams. 8. Put up pictures of the different kinds of flavours there are. 9. Sing a rhyme about ice cream if you want to. RHYME: I scream, you scream, we ALL scream for ice cream!
zul: Qinisekisa ukuthi izingane azijabuli kuze kweqe zize zilume inhlama yazo yokudlala! 🤢 1. Tshela izingane ukuthi zizokwenza i-ice cream. 2. Khuluma nge-ice cream. 3. Zikhombise ukuthi indlela yokuxova inhlama yendlaleke ibe ngamasosishi amade, azacile, bese ziwendlale futhi ziwendlale, zenze isiyingi. 4. Faka uthi phakathi ukwenza i-ice cream. 5. Zibonise ezinye izinhlobo ze-ice cream ongazenza ngokwenza amabhola bese uwahlobisa. 6. Zibonise ezinye izinhlobo ze-ice cream ongazenza ngokwenza amabhola bese uwahlobisa. 7. Hlela isitolo se-ice cream ukuze uthengise i-ice cream. 8. Beka izithombe zezinhlobonhlobo ze-ice cream ezikhona. 9. Cula umlolozelo mayelana ne-ice cream uma ufuna. UMLOLOZELO: Ngiyamemeza, uyamemeza, siyamemeza SONKE sifuna u-ice cream!

source: Ask the children some questions to help their imaginations run wild. Level 1 • What ice creams do you like? • When do you eat them? • How do you feel when you have an ice cream? • What colour are you going to make? • What shape do you like? • Etc. Level 2 • What flavour are your ice creams? • How many do we have now? • Should we set up and ice cream shop? Level 3 • How much do your ice creams cost? • I only have this amount of money. Do I need change?
zul: Buza izingane imibuzo embalwa ukusiza ukujubalalisa imicabango yazo. Izinga 1 • Iyiphi i-ice cream oyithandayo? • Uyidla nini? • Uzizwa kanjani uma une-ice cream? • Uzokwenza umbala onjani? • Yimuphi umumo owuthandayo? • Njll. Izinga 2 • Yimaphi ama-flavour e-ice cream yakho? • Mangaki esinawo manje? • Ingabe kufanele senze isitolo se-ice cream? Izinga 3 • Ibiza malini i-ice cream yakho? • Ngina le mali kuphela. Ngidinga ushintshi?

source: ✔️Talking & Understanding ✔️Arm & hand control
zul: ✔️Ukukhuluma nokuqonda ✔️Amakhono okulawula izingalo nezandla

source: This is a great game to play during summer, and the good news is that these Playdough Ice Creams won’t melt. 🍦
zul: Lona umdlalo omnandi kakhulu ukuba ungadlalwa ehlobo, futhi izindaba ezinhle ukuthi lo –Ice Cream Wenhlama ngeke uncibilike. 🍦

source: This one is super simple! All that’s needed is: 1. Playdough in a few different colours. 2. Ice cream sticks or something that could be used as an ice cream stick.
zul: Lo ulula kakhulu! Konke okudingayo yilokhu: 1. Inhlama yokudlala eyimibala embalwa eyahlukene. 2. Izinti zika-ice cream noma okuthile okungasetshenziswa njengezinti zika-ice cream.

source: This game develops:
zul: Lo mdlalo uthuthukisa:
