Repository: Ari-Ramkilowan/po-files
Catalog: translations/SGroup13(Release (open))_Southern Sotho.po
Languages: sot

source: Read the notes
sot: Bala dinoutso

source: See what you need
sot: Sheba seo o se hlokang

source: See how it works
sot: Bona hore e sebetsa jwang

source: Back to menu
sot: Kgutlela ho menu

source: Make sure the children don’t get too excited and take a bite out of their playdough! 🤢 1. Tell the children that they’re going to make an ice cream. 2. Talk about ice creams. 3. Show them how to roll the play dough into long, thin sausages, and then roll them round and round, making a circle. 4. Put a stick in to make an ice cream. 5. Show them the other kinds of ice creams you can make by rolling balls and decorating them. 6. Have fun, ask questions, and talk to help the children learn more as they play. 7. Set up an ice cream shop to sell the ice creams. 8. Put up pictures of the different kinds of flavours there are. 9. Sing a rhyme about ice cream if you want to. RHYME: I scream, you scream, we ALL scream for ice cream!
sot: Etsa bonnete ba hore bana ha ba thabe haholo hoo ba qetellang ba loma letsopa la ho bapala! 🤢 1. Bolella bana hore ba tlilo etsa aesekerime. 2. Buang ka diaesekerime. 3. Ba bontshe kamoo ba ka pitikisang hlama ya ho bapala ba e etsa diboroso tse telele, tse tshesane, mme ba di sothe ba di potolosa, ba etsa sedikadikwe. 4. Kenya thupa ka hare ho etsa aesekerime. 5. Ba bontshe mefuta e meng ya aesekerime eo le ka e etsang ka ho harela dibolo le ho di kgabisa. 6. Natefelwang, botsa dipotso, mme o bue ho thusa bana hore ba ithute ho feta ha ba ntse ba bapala. 7. Theha lebenkele la aesekerime bakeng sa ho rekisa aesekerime. 8. Bea ditshwantsho tsa mefuta e fapaneng ya ditatso tse teng. 9. Binang raeme e mabapi le aesekerime haeba le batla jwalo. RAEME: Ke a sekirima, o a sekirima, BOHLE re a sekirima re batla aesekerime!

source: Ask the children some questions to help their imaginations run wild. Level 1 • What ice creams do you like? • When do you eat them? • How do you feel when you have an ice cream? • What colour are you going to make? • What shape do you like? • Etc. Level 2 • What flavour are your ice creams? • How many do we have now? • Should we set up and ice cream shop? Level 3 • How much do your ice creams cost? • I only have this amount of money. Do I need change?
sot: Botsa bana dipotso tse itseng ho ba thusa hore menahano ya bona e sole hohle. Mohato wa 1 • O rata diaesekerime dife? • O di ja neng? • O ikutlwa jwang ha o ja aesekerime? • O tlo etsa mmala o jwang? • O rata sebopeho sefe? • Jj. Mohato wa 2 • Diaesekerime tsa hao ke ditatso dife? • Re na le tse kae jwale? • Na re ka qala lebenkele la aesekerime? Mohato wa 3 • Aesekerime ya hao ke bokae? • Ke na le tjhelete e kana feela. Na ke hloka tjhentjhe?

source: ✔️Talking & Understanding ✔️Arm & hand control
sot: ✔️Ho bua le ho utlwisisa ✔️Taolo ya sephaka le letsoho

source: This is a great game to play during summer, and the good news is that these Playdough Ice Creams won’t melt. 🍦
sot: Ena ke papadi e monate e ka bapalwang lehlabula, mme ditaba tse monate ke hore Diaesekerime tsena tsa Letsopa la ho bapala di keke tsa qhibidiha.🍦

source: This one is super simple! All that’s needed is: 1. Playdough in a few different colours. 2. Ice cream sticks or something that could be used as an ice cream stick.
sot: Ena e bonolo le ho feta! Se hlokehang feela ke: 1. Letsopa la ho bapala ka mebala e mmalwa e fapaneng. 2. Dithupa tsa aesekerime kapa ntho e ka sebediswang jwaloka thupa ya aesekerime.

source: This game develops:
sot: Papadi ena e ntshetsa pele:
