Repository: Ari-Ramkilowan/po-files
Catalog: translations/SGroup9(Release (open))_Venda.po
Languages: ven

source: Use this activity as a bigger learning opportunity by asking the children some fun questions. Level 1 • Who likes blowing bubbles? • What do we normally use dishwashing soap for? • What colours do we have here? Level 2 • What does this pattern look like? • What shapes can you see? • What colours have you made? • How many bubbles can you see here? Level 3 • Let’s mix some colours. • Now what colours do you have? • What does blue and yellow make? (green) • What does red and yellow make? (orange) • What does blue and red make? (purple) • What sound does blue start with? (ba) • What sound does red start with? (rrrrrr) • What sound does yellow start with? (ya) • What sound does green start with? (ga) • What sound does orange start with? (o) • What sound does purple start with? (pa)
ven: Kha vha shumise mushumo uyu sa tshikhala tshihulwane tsha u guda nga u vhudzisa vhana mbudziso dzi takadzaho. Ḽiga 1 • Ndi nnyi ane a takalela u vhudzedza mapulo? • Tshisibe tsha u ṱanzwa phuleithi tshi shumiswa u ita mini? • Ri na mivhala ifhio afha? Ḽiga 2 • Phetheni iyi i fana na mini? • Ni khou vhona zwivhumbeo zwifhio? • No ita mivhala ifhio? • Ni khou vhona mapulo mangana? Ḽiga 3 • Kha ri tanganyise miṅwe mivhala. • Vha tea u ḓivha mivhala ine vha vha nayo? • Muvhala wa lutombo na tshitopana/yeḽo u ita muvhala ufhio? (mudala) • Muvhala mutswuku na tshitopana/yeḽo zwi ita mini? (taḓa) • Muvhala wa lutombo/buḽuu na mutsuku zwi ita muvhala ufhio? (phephuḽu) • Lutombo lu thoma nga mubvumo ufhio? (lu) • Mutswuku u thoma nga mubvumo ufhio? (mmmm) • Tshitopana u thoma nga mubvumo ufhio? (tsh) • Mudala u thoma nga mubvumo ufhio? (mm) • Ṱaḓa i thoma nga mubvumo ufhio? (ṱ) • Phephuḽu i thoma nga mubvumo ufhio? (ph)

source: Read the notes
ven: Kha vha vhale notsi

source: See what you need
ven: Zwine vha ṱoḓa

source: See how it works
ven: Zwi shumisa hani

source: Back to menu
ven: Kha vha humele murahu kha menyu

source: Have the children tried Painting with Bubbles yet? 🎨
ven: Vhana vho no vhuya vha lingedza u pennda nga Mapulo? 🎨

source: This game develops:
ven: Mutambo u bveledza:

source: ✔️Exploring & Finding Out ✔️Early Reading & Writing
ven: ✔️U ṱoḓisisa na u wanulusa ✔️U vhala na u ṅwala vha tshe vhaṱuku

source: It’s really simple. All you need is: 1. Paint 2. Dishwashing liquid 3. Straws 4. Paper
ven: Zwo leluwa. Zwine vha ṱoḓa ndi: 1. Pennde 2. Tshisibe tsha u ṱanzwa phuleithi 3. Zwipaipi 4. Bammbiri

source: Read the note
ven: Kha vha vhale notsi

source: This activity breathes new life into having fun with paint. No paintbrushes required! 🖌 1. Mix some paint with some dishwashing liquid in a cup. 2. Add a little bit of water to the mixture. 3. Give each child a straw and some paper, and ask them to share the paint. 4. Ask them to blow (not suck) through the straw into the cup. This will make bubbles. 5. Then ask the children to hold the paper over the cup and bubbles and press down gently. 6. The bubbles will leave a bubble pattern on the paper. 7. The children can repeat this with other colours and then leave their art to dry.
ven: Mushumo uyu u ita uri mutambo u takadzese nga u tambisa pennde. A hu ṱoḓei bulatsho dza u pennda! 🖌 1. Kha vha ṱanganyise pennde na tshisibe tsha u ṱanzwa phuleithi kha bigiri/tshinwelo. 2. Kha vha shele maḓi nyana. 3. Kha vha ṋee ṅwana muṅwe na muṅwe lupaipi na bammbiri, vha vha vhudze uri vha shumise pennde vhoṱhe. 4. Kha vha vha vhudze vha tou vhudzedza (vha songo tou kokodza) lupaipi kha bigiri/tshinwelo. Izwi zwi ḓo ita uri hu vhe na mapulo. 5. Vha kone u humbela vhana u fara bammbiri vho ḽi vhea nga nṱha ha bigiri/tshinwelo vha ḽi ndondomedze zwavhuḓi. 6. Mapulo a ḓo ola phetheni kha bammbiri. 7. Vhana vha nga dovholola izwi vha tshi khou shumisa miṅwe mivhala vha kona u zwi vhea zwa oma.
