Repository: Ari-Ramkilowan/po-files
Catalog: translations/SGroup7(Release (open))_Zulu.po
Languages: zul

source: Read the notes
zul: Funda amanothi

source: See what you need
zul: Bheka ukuthi yini oyidingayo

source: See how it works
zul: Bheka ukuthi kusebenza kanjani

source: Back to menu
zul: Buyela kumenyu

source: The lion is the king of the jungle, let’s see what the kids know about it: Level 1 • What sound does a lion make? • Where do they live? • What do they eat? • What should you do if you see a lion? Level 2 • What kind of animals are they? (Cats and mammals) • What do they look like? • How big are they? • What colour are they? Level 3 • What else can you tell me about lions? • What other animals live near lions? • Let’s talk about those – what do you know about elephants, or rhinos? • What sound does the word ‘lion’ start with? • What sound does the word ‘rhino’ start with? • What sound does the word ‘elephant’ start with?
zul: Ibhubesi yinkosi yezilwane, ake sibone ukuthi izingane zazini ngalo: Izinga 1 • Lenza msindo muni ibhubesi? • Ahlala kuphi? • Adlani? • Yini okufanele uyenze uma ubona ibhubesi? Izinga 2 • Ingabe awuhlobo luni lwezilwane? (Amakati nezilwane ezincelisayo) • Abukeka kanjani? • Makhulu kangakanani? • Awumbala muni? Izinga 3 • Yini enye ongangitshela yona ngamabhubesi? • Yiziphi ezinye izilwane ezihlala eduze namabhubesi? • Ake sikhulume ngalezo – yini oyaziyo ngezindlovu, noma obhejane? • Ingabe igama elithi ‘bhubesi’ liqala ngamuphi umsindo? • Ingabe igama elithi ‘bhejane’ liqala ngamuphi umsindo? • Ingabe igama elithi ‘ndlovu’ liqala ngamuphi umsindo?

source: This game develops:
zul: Lo mdlalo uthuthukisa:

source: Have you made any Little Lions yet? 🦁
zul: Akhona Amabhubesi osuwenzile manje? 🦁

source: ✔️Walking & Moving ✔️Arm & Hand control
zul: ✔️Ukuhamba nokunyakaza ✔️Ukulawula kwengalo nesandla

source: If you have time, get the children cut these things out themselves: ✂ - 1 paper per child for the lion’s face - 2 black eyes per child cut out of paper - 1 nose per child cut out of paper - 2 ears per child cut out of paper - 1 plastic / onion bag per child
zul: Uma unaso isikhathi, tshela izingane zisike kahle lezi zinto ngokwazo: ✂ 1. iphepha eli-1 lobuso bebhubesi ingane ngayinye 2. amehlo amnyama ama-2 asikwe ephepheni ingane ngayinye 3. ikhala eli-1 elisikwe ephepheni ingane ngayinye 4. izindlebe ezi-2 ezisikwe ephepheni ingane ngayinye 5. ipulastiki/isikhwama sika-anyanisi esi-1 ingane ngayinye

source: You can use this activity as an opportunity to teach children about animals. 1.Talk about lions before you make the lion face. 2.Ask each child to cut out a circle to make the lions face. 3.They can colour in the face of the lion and stick on eyes, nose and ears. 4.Get them to cut strips of plastic or onion bag for the mane of the lion. 5.Stick on the strips. 6.If you have string, you could make holes in the eyes and turn the lion face into a mask. 7.Get children to crawl around and roar like lions.
zul: Ungasebenzisa leli thuba ufundise izingane ngezilwane. 1. Khuluma ngamabhubesi ngaphambi kokuba nenze ubuso bebhubesi. 2. Cela ingane ngayinye isike indilinga yokwenza ubuso bebhubesi. 3. Bangafaka umbala ebusweni bebhubesi futhi banamathelise amehlo, ikhala nezindlebe. 4. Batshele basike imicu yepulastiki noma isikhwama sika-anyanisi ukwenza umhlwenga webhubesi. 5. Namathelisa imicu. 6. Uma unentambo, ungenza izimbobo emehlweni bese wenza ubuso bebhubesi i-mask. 7. Tshela izingane zihambe zigaqa zizungeza futhi zibhongise okwamabhubesi.
