Repository: Ari-Ramkilowan/po-files
Catalog: translations/SGroup13(Release (open))_Swati.po
Languages: ssw

source: Read the notes
ssw: Fundza emanotsi

source: See what you need
ssw: Buka kutsi yini loyidzingako

source: See how it works
ssw: Buka kutsi isebenta njani

source: Back to menu
ssw: Buyela emuva kumenyu

source: Make sure the children don’t get too excited and take a bite out of their playdough! 🤢 1. Tell the children that they’re going to make an ice cream. 2. Talk about ice creams. 3. Show them how to roll the play dough into long, thin sausages, and then roll them round and round, making a circle. 4. Put a stick in to make an ice cream. 5. Show them the other kinds of ice creams you can make by rolling balls and decorating them. 6. Have fun, ask questions, and talk to help the children learn more as they play. 7. Set up an ice cream shop to sell the ice creams. 8. Put up pictures of the different kinds of flavours there are. 9. Sing a rhyme about ice cream if you want to. RHYME: I scream, you scream, we ALL scream for ice cream!
ssw: Cinisekisa kwekutsi labantfwana abajabuli ngalokundlulele bese baluma loludzaka lwabo lwekudlala! 🤢 1. Tjela labantfwana kwekutsi batawakha i-ayisikhrimu. 2. Khuluma ngema ayisikhrimu. 3. Bakhombise kwekutsi loludzaka lwekudlala balugicita njani lube ludze, lufane nemasoseji lancama, bese uyalugocotela, wente indlingilizi. 4. Faka lutsi kute kutsi wente i-ayiskhrimu. 5. Bakhombise letinye tinhlobo te-ayisikhrimu longatenta ngekutsi ugoce emabhole bese uyawahlobisa. 6. Tijabulise, buta imibuto, bese uyakhuluma kusita labantfwana bafundze kabanti ngalesikhatsi badlala. 7. Lungiselela sitolo lesitawutsengisa i-ayisikhrimu. 8. Beka titfombe letinetinhlobo letihlukene. 9. Cula silandzelo lesiphatselene ne ayisikhrimu uma utsandza. SILANDZELO: Ngiyamemeta, uyamemeta, SONKHE siyamemeta sifuna i-ayisikhrimu!

source: Ask the children some questions to help their imaginations run wild. Level 1 • What ice creams do you like? • When do you eat them? • How do you feel when you have an ice cream? • What colour are you going to make? • What shape do you like? • Etc. Level 2 • What flavour are your ice creams? • How many do we have now? • Should we set up and ice cream shop? Level 3 • How much do your ice creams cost? • I only have this amount of money. Do I need change?
ssw: Buta bantfwana imibuto kubasita bacabange ngalokujulile. Lizinga1 • Utsandza waphi ema-ayisikhrimu? • Uyidla nini? • Utiva njani uma udla i-ayisikhrimu? • Utawenta lenembala lonjani? • Utsandza lebumbeke njani? • Njll. Lizinga2 • Ema-ayisikhrimu akho anguyiphi imihlobo? • Sinamangaki nyalo? • Singalungisa sitolo sema-ayiskhrimu? Lizinga3 • I-ayiskhrimu yakho ibita malini? • Nyalo nginalemali lena kuphela. Ngabe ngidzinga intjintji?

source: ✔️Talking & Understanding ✔️Arm & hand control
ssw: ✔️Kukhuluma nekuvisisa ✔️Kulawula sandla nemkhono

source: This is a great game to play during summer, and the good news is that these Playdough Ice Creams won’t melt. 🍦
ssw: Lona ngumdlalo lomnandzi wekuwudlala ehlobo, lokuhle ngawo kwekutsi loludzaka lwekudlala lolusama ayisikhrimu angeke luncitsike. 🍦

source: This one is super simple! All that’s needed is: 1. Playdough in a few different colours. 2. Ice cream sticks or something that could be used as an ice cream stick.
ssw: Lona ulula ngalokundlulele! Konkhe lokudzingekako: 1. Ludzaka lwekudlala lolunemibala lehlukene. 2. Tintsi te-ayisikhrimu noma lokunye lokungasetjentiswa njengetintsi te-ayisikhrimu.

source: This game develops:
ssw: Lomdlalo utfutfukisa:
