Repository: Ari-Ramkilowan/po-files
Catalog: translations/SGroup17(Release (open))_South Ndebele.po
Languages: nbl

source: See what you need
nbl: Bona ukuthi utlhoga ini

source: See how it works
nbl: Bona ukuthi isebenza bunjani

source: Read the notes
nbl: Funda amaAwathi

source: Back to menu
nbl: Buyela erhelweni

source: This game develops:
nbl: Umdlalo lo uthuthukisa:

source: Here’s what you’ll need to keep the kids busy: 1. A pre-drawn picture of a dinosaur for each child. 2. Squares about the size of a stamp in 2 or 3 different colours. 3. Glue. 4. Scissors.
nbl: Nakhu okuthlogako:: 1.Isithombe esele sidwebiwe se – diAwasaur umntwana ngamunyer 2.Iinkwere ezingaba isayizi Iyeitempu ngemibala emi – 2 Awama emi – 3 3.ehlukile. 4.Iinkere

source: We started from the ground up by making dinosaur footprints in the last activity, so how about we move on to Making Dinosaurs? 🦕
nbl: Sithome phasi ngokwenza imithlala -diAwasaur yeesifundweni esidlulile. Kunganjani bona siqhubeke ngokwenza ama – DiAwasaur? Making DiAwasaurs 🦕

source: ✔️Numbers , Shapes & Sizes ✔️Skills for Learning
nbl: ✔️ IiAwambolo, ubujamo namasayizi ✔️AmakghoAwa wokufunda

source: Keep the kids wide awake by encouraging them to make dinosaur noises while they work. 🦖🦕 1. Give each child a picture of a dinosaur. 2. Cut out the colourful squares for younger children. 3. Let older children cut their own little squares. 4. Sort the little squares into piles depending on their colour. 5. Show the children how to stick the squares onto their dinosaurs. 6. Help the younger ones while encouraging the older ones. 7. Help them make a pattern using colours (red, blue, red, blue, red, etc).
nbl: Bagcine bavukile ngokubakhuthaza bona benze itjhada lama – diAwasaur nabasebenzako. 🦖🦕 1.Nikeza umntwana ngamunye isithombe se - diAwasaur. 2.Sikela abantwana abancane iinkwere ezinemibala. 3.Abantwana abakhulu mabazisikele bona iinkwere. 4.Zihlele kuhle iinkwere ngemibalazo. 5.Tjengisa abantwana ukuthi banamathisele bunjani iinkwere kuma – diAwasaur wabo. 6.Rhelebha abantwana abancane nawukhuthaza abakhulu. 7.Basize ukwenza amaphethini basebenzisa imibala (obomvu, ohlaza, obomvu, ohlaza, obomvu, njll).

source: Not sure what to ask the children next? Here are some ideas: Level 1 • What does this dinosaur need? • Where will these spikes go? • How many do you need? • What colours will you choose? Level 2 • What pattern will you make? • Which one shall we start with? • When did dinosaurs live? (The answer can be something like: a long, long time ago). • Are there still dinosaurs on earth? (Answer: no, they have all died). • What do they eat? (Answer: some eat plants, some eat other animals). Level 3 • What sound does dinosaur start with? (da) • What else starts with ‘da’? • Do you know the names of different types of dinosaurs? (Answer: T. rex, brontosaurus, triceratops).
nbl: Awazi ukuthi ungababuzani elandelako? Nasi imiboAwa: Ileveli yoku - 1 • I - diAwasaur le itlhoga ini? • Iimpikirezi zizaya kuphi? • Utlhoga mangaki? • Uzokukhetha miphi imibala? Ileveli Iyei - 2 • Uzokwenza yiphi iphethini? • Sithome ngayiphi? • Aphila nini ama - diAwasaurs? (Ipendulo ingaba: lokha, kade khulu). • Asekhona ama – diAwasaur ephasini? (Ipendulo: awa, wafa woke begodu aphela). • Adla ini? (Ipendulo: amanye iintjalo, amanye adla ezinye iinlwana). Ileveli Iyei - 3 • Ithoma ngamuphi umsindo i-diAwasaur? (da) • Yini okhunye okuthoma ngo ‘da’? • Uyawazi amabizo angafaniko wama - diAwasaur? (Ipendulor: T. rex, brontosaurus, triceratops).
