Repository: Ari-Ramkilowan/po-files
Catalog: translations/SGroup7(Release (open))_Tswana.po
Languages: tsn

source: Read the notes
tsn: Bala dintlha

source: See what you need
tsn: Bona se o se tlhokang

source: See how it works
tsn: Bona kafa o tshamekiwang ka teng

source: Back to menu
tsn: Boela kwa mmenyung

source: The lion is the king of the jungle, let’s see what the kids know about it: Level 1 • What sound does a lion make? • Where do they live? • What do they eat? • What should you do if you see a lion? Level 2 • What kind of animals are they? (Cats and mammals) • What do they look like? • How big are they? • What colour are they? Level 3 • What else can you tell me about lions? • What other animals live near lions? • Let’s talk about those – what do you know about elephants, or rhinos? • What sound does the word ‘lion’ start with? • What sound does the word ‘rhino’ start with? • What sound does the word ‘elephant’ start with?
tsn: Tau ke yone kgosi mo sekgweng, a re boneng se bana ba se itseng ka seo. Maemo 1 • Tau e dira modumo o o ntseng jang? • Di nna kae? • Di ja eng? • Ke eng se o tshwanetseng go se dira fa o bona tau? Maemo 2 • Ke diphologolo tsa mofuta ofe? (A ke dikatse kgotsa ke diamusi) • Di lebega jang? • Di bogolo bo kana kang? • Di mmala ofe? Maemo 3 • Ke eng gape se le ka mpolelelang sone ka ditau? • Ke diphologolo dife tse dingwe tse di nnang gaufi le ditau? • A re bueng ka tsone – le itse eng ka ditlou, kgotsa ditshukudu? • Lefoko ‘tau’ le simolola ka modumo wa tlhaka efe? • Lefoko ‘tshukudu’ le simolola ka modumo wa tlhaka efe? • Lefoko ‘tlou’ le simolola ka modumo wa tlhaka efe?

source: This game develops:
tsn: Motshameko o o a tswelela:

source: Have you made any Little Lions yet? 🦁
tsn: A o setse o dirile motshameko wa Ditawana? 🦁

source: ✔️Walking & Moving ✔️Arm & Hand control
tsn: ✔️Go tsamaya le go suta ✔️Taoloya lebogo le seatla

source: If you have time, get the children cut these things out themselves: ✂ - 1 paper per child for the lion’s face - 2 black eyes per child cut out of paper - 1 nose per child cut out of paper - 2 ears per child cut out of paper - 1 plastic / onion bag per child
tsn: Fa e le gore o na le nako, dira gore bana ba itshegele dilo tse ka bobone: ✂ 1. Pampiri e le 1 ngwana mongwe le mongwe go dira sefatlhego sa tau 2. Matlho a mantsho a le 2 a segolotswe mo pampiring 3. Nko e le 1 ngwana mongwe le mongwe e segolotswe mo pampiring 4. Ditsebe tse 2 ngwana mongwe le mongwe di segolotswe mo pampiring 5. Kgetsana e le 1 ya polasetiki/aeye ngwana mongwe le mongwe

source: You can use this activity as an opportunity to teach children about animals. 1.Talk about lions before you make the lion face. 2.Ask each child to cut out a circle to make the lions face. 3.They can colour in the face of the lion and stick on eyes, nose and ears. 4.Get them to cut strips of plastic or onion bag for the mane of the lion. 5.Stick on the strips. 6.If you have string, you could make holes in the eyes and turn the lion face into a mask. 7.Get children to crawl around and roar like lions.
tsn: Gape o ka dirisa tirwana eno jaaka tshono ya go ruta bana kaga diphologolo. 1. Bua ka ditau pele ga o dira sefatlhego sa tau. 2. Kopa bana gore ba segolole sekele go dira sefatlhego sa tau. 3. Ba ka tshasa mebala mo sefatlhegong sa tau ba bo ba kgomaretsa matlho, nko le ditsebe. 4. Dira gore ba sege diseteripi tsa kgetsana ya polasetiki kgotsa ya diaeye gore ba dire seetse sa molala wa tau. 5. Kgomaretsa diseteripi tseo. 6. Fa e le gore o na le mogala, o ka dira diphatlha mo matlhong o bo o dira gore sefatlhego sa tau e nne mmaseke. 7. Dira gore bana ba gagabe le go kgorotlha jaaka ditau.
