Repository: Ari-Ramkilowan/po-files
Catalog: translations/SGroup9(Release (open))_Zulu.po
Languages: zul

source: Use this activity as a bigger learning opportunity by asking the children some fun questions. Level 1 • Who likes blowing bubbles? • What do we normally use dishwashing soap for? • What colours do we have here? Level 2 • What does this pattern look like? • What shapes can you see? • What colours have you made? • How many bubbles can you see here? Level 3 • Let’s mix some colours. • Now what colours do you have? • What does blue and yellow make? (green) • What does red and yellow make? (orange) • What does blue and red make? (purple) • What sound does blue start with? (ba) • What sound does red start with? (rrrrrr) • What sound does yellow start with? (ya) • What sound does green start with? (ga) • What sound does orange start with? (o) • What sound does purple start with? (pa)
zul: Sebenzisa lo msebenzi njengethuba elikhulu lokufunda ngokubuza izingane imibuzo ethile yokudlala. Izinga 1 • Ubani othanda ukufutha amabhamuza? • Ngokuvamile siyisebenzisela ukwenzani insipho yokugeza izitsha? • Yimiphi imibala esinayo lapha? Izinga 2 • Ibukeka njengani le phethini? • Yimiphi imimo oyibonayo? • Yimiphi imibala oyenzile? • Mangaki amabhamuza owabonayo lapha? Izinga 3 • Ake sixube imibala. • Manje-ke yimiphi imibala onayo? • Yimuphi umbala owakhiwa ngoluhlaza okwesibhakabhaka nophuzi? (oluhlaza okotshani) • Yimuphi umbala owakhiwa ngobomvu nophuzi? (osawolintshi) • Yimuphi umbala owakhiwa ngoluhlaza okwesibhakabhaka nobomvu? (osabunsomi) • Ingabe igama elithi luhlaza okwesibhakabhaka liqala ngomuphi umsindo? (lu) • Ingabe igama elithi bomvu liqala ngomuphi umsindo? (bo) • Ingabe igama elithi phuzi liqala ngomuphi umsindo? (phu) • Ingabe igama elithi luhlaza okotshani liqala ngomuphi umsindo? (lu) • Ingabe igama elithi wolintshi liqala ngomuphi umsindo (wo) • Ingabe igama elithi nsomi liqala ngomuphi umsindo? (ns)

source: Read the notes
zul: Funda amanothi

source: See what you need
zul: Bheka ukuthi yini oyidingayo

source: See how it works
zul: Bheka ukuthi kusebenza kanjani

source: Back to menu
zul: Buyela kumenyu

source: Have the children tried Painting with Bubbles yet? 🎨
zul: Ingabe izingane zizamile Ukupenda Ngamabhamuza kuze kube manje? 🎨

source: This game develops:
zul: Lo mdlalo uthuthukisa:

source: ✔️Exploring & Finding Out ✔️Early Reading & Writing
zul: ✔️Amakhono okufunafuna ✔️Ukufunda nokubhala ngaphambi kwesikhathi esijwayelekile

source: It’s really simple. All you need is: 1. Paint 2. Dishwashing liquid 3. Straws 4. Paper
zul: Kulula kakhulu. Konke okudingayo nje yilokhu: 1. Upende 2. Uketshezi lwensipho yokugeza izitsha 3. Ama-straws 4. phepha

source: Read the note
zul: Funda amanothi

source: This activity breathes new life into having fun with paint. No paintbrushes required! 🖌 1. Mix some paint with some dishwashing liquid in a cup. 2. Add a little bit of water to the mixture. 3. Give each child a straw and some paper, and ask them to share the paint. 4. Ask them to blow (not suck) through the straw into the cup. This will make bubbles. 5. Then ask the children to hold the paper over the cup and bubbles and press down gently. 6. The bubbles will leave a bubble pattern on the paper. 7. The children can repeat this with other colours and then leave their art to dry.
zul: Lo msebenzi uletha ubumnandi obusha ekusebenziseni upende. Akudingeki mabhulashi okupenda! 🖌 1. Xuba enkomishini upende ongengakanani noketshezi lwensipho yokugeza izitsha. 2. Faka amanzi amancane kule ngxube. 3. Nikeza ingane ngayinye i-straw nephepha elincane, bese ubacela babelane ngopende. 4. Batshele bafuthe (bangamunci) nge-straw enkomishini. Lokhu kuzokwenza amabhamuza. 5. Bese ucela izingane zibambe iphepha phezu kwenkomishi namabhamuza bese zicindezela ngesineke. 6. Amabhamuza azoshiya iphethini yamabhamuza ephepheni. 7. Izingane zingakuphinda lokhu nangeminye imibala bese ziyeka umsebenzi wazo wobuciko wome.
