Repository: Ari-Ramkilowan/po-files
Catalog: translations/SGroup14(Release (open))_Southern Sotho.po
Languages: sot

source: Read the notes
sot: Bala dinoutso

source: See what you need
sot: Sheba seo o se hlokang

source: See how it works
sot: Bona hore e sebetsa jwang

source: Back to menu
sot: Kgutlela ho menu

source: While their creative juices are flowing, get their brains going by asking them some questions. Level 1 • What colour is this? • What shape is this • How many colours can you see? • Where will you stick this? Level 2 • How many pieces do you have? • What pattern is this? Level 3 • How will you use these pieces to make a picture? • What is your picture? • Can you tell me about it? • Can you make your name?
sot: Ha ba ntse ba bontsha boqapi, etsa hore dikelello tsa bona di sebetse ka ho ba botsa dipotso. Mohato wa 1 • Ke mmala ofe oo? • Ke sebopeho sefe see? • O bona mebala e mekae? • O tlo manamisa see hokae? Mohato wa 2 • O na le dikgetjhana tse kae? • Ke paterone efe ee? Mohato wa 3 • O tlo sebedisa dikgetjhana tsee jwang ho etsa setshwantsho? • Setshwantsho sa hao ke sa eng? • Na o ka nqoqela ka sona? • Na o ka etsa lebitso la hao?

source: ✔️Arm & Hand Control ✔️Numbers , Shapes & Sizes
sot: ✔️Taolo ya sephaka le letsoho ✔️Dinomoro, dibopeho le boholo

source: Now it’s time to turn trash into treasure. 1. Make sure the chip packets are clean. 2. Ask the kids to share the chip packets between themselves. 3. Then ask them to cut or tear up chip packets into small pieces or shapes. 4. Get them to stick these pieces of chip packet onto the paper. 5. Encourage creativity as they make their pictures. 6. Talk about shapes, sizes, colour, texture, patterns, etc. 7. Help them to cut and stick as is needed. 8. Older children can even make spell their names out with the pieces.
sot: Jwale ke nako ya ho fetola matlakala ho a etsa letlotlo. 1. Netefatsa hore dipakana tsa ditjhipse di hlwekile. 2. Kopa bana ho abelana ka dipakana tsa ditjhipse. 3. Jwale ba kope ho seha kapa ho tabola dipakana tsa ditjhipse ba dietse dikgetjhana kapa dibopeho tse nyane. 4. Ere ba kgomaretse dikgetjhana tsena tsa pakana ya ditjhipse hodima pampiri. 5. Kgothaletse boqapi ha ba ntse ba etsa ditshwantsho tsa bona. 6. Buang ka dibopeho, boholo, mmala, boamo, dipaterone, jj. 7. Ba thuse ho seha le ho manamisa kamoo ho hlokehang. 8. Bana ba baholwanyane ba ka ba ba peleta mabitso a bona ka dikgetjhana tseo.

source: Use Chip Packet Fun to teach the kids about not only making art, but recycling too.🥔
sot: Sebedisa Monate wa Pakana ya Ditjhipsi ho ruta bana eseng ka ho etsa bonono feela, empa le ka ho resaekela. 🥔

source: If there’s litter in the area, why not get the kids to collect it and throw it away while they look for chip packets? This is what you’ll for this game: • A clean chip packet per child • Piece of paper per child • Glue and scissors
sot: Haeba ho ena le matlakala sebakeng seo, hobaneng o sa re bana ba a bokelle mme ba a lahle ha ba ntse ba batlana le dipakana tsa ditjhipse? Sena ke seo o tlang ho se hloka bakeng sa papadi ena: • Pakana ya ditjhipse e hlwekileng bakeng sa ngwana ka mong • Sekgetjhana sa pampiri ngwana ka mong • Sekgomaretsi • Dikere

source: This game develops:
sot: Papadi ena e ntshetsa pele:
