Repository: Ari-Ramkilowan/po-files
Catalog: translations/SGroup5(Release (open))_South Ndebele.po
Languages: nbl

source: Some little ones might get stuck, but that’s fine. Here are some questions to help them talk about what’s happening and learn from it: 💬 Level 1 (simple structure) • Who can remember the pattern? • Which colour was on the bottom? • Which colour was on the top? Level 2 (more complex structure) • Who can remember the pattern? • Which colour was on the bottom? • Which colour was on the top? • Which colours will you use to repeat the pattern? • What does the pattern look like? Level 3 (even more complex structure) • Who can remember the pattern? • Which colours will you use to repeat the pattern? • What does the pattern look like? • How did you remember? • What else can you build with the bricks?
nbl: Abanye abantwana abancane bangabhalelwa kodwana kulungile. Nasi eminye imibuzo engabarhelebha ukucoca ngokwenzalako Awakufunda kiyo: 💬 Ileveli yoku - 1 • Ngubani oyaikhumbulako iphethini? • Ngimuphi umbala ogade ungaphasi? • Ngimuphi umbala ogade ungaphezulu? Ileveli Iyei - 2 • Ngubani oyikhumbulako iphethini? • Ngimuphi umbala ogade ungaphasi? • Ngimuphi umbala ogade ungaphezulu? • Ngimiphi imibala ongayisebenzisa ukuphinda amaphethini? • Iphethini iqaleka njani? Ileveli Iyei - 3 • Ngubani oyikhumbulako iphethini? • Ngimiphi imibala ongayisebenzisa ukuphinda amphethini? • Ipethini iqaleka njani? • Ukhumbule njani? • Khuyini okhunye ongakwakha ngamabhlogo?

source: See what you need
nbl: Bona ukuthi utlhoga ini

source: See how it works
nbl: Bona ukuthi lisebenza bunjani

source: Read the notes
nbl: Funda amaAwathi

source: Back to menu
nbl: Buyela erhelweni

source: It’s time to test that memory with a game called Lego — Can You Remember? 🏅
nbl: Sikhathi sokobana sihlole umkhumbulo ngomdlalo obizwa ngokuthi yi - LEGO — Usakhumbula? 🏅

source: The aim is to see if the kids can remember what you did and repeat it. It helps them learn to pay attention. 🧐 1. Build a pattern of 2 bricks (e.g. red then yellow). 2. Show children for 5 seconds and then ask them to remember. 3. Hide the bricks and ask them to see if they can remember the pattern. 4. Repeat with another pattern using different colours or a different order. 5. Each time add more bricks. 6. Use fewer bricks (simple structure) with young children (ages 2 — 4). 7. Use more bricks with older children (ages 4 — 8). 8. Get the children to build patterns for everyone to copy. 9. Talk to the children about shapes, colours, or the number of bricks.
nbl: Umnqopho kubona ukuthi abantwana bayakhumbula lokho okwenzile bese bayakwenzela. Kubasiza bona bakwazi ukulalelisisa. 🧐 1. Yakha iphethini ngeentina ezimbili. (Isibonelo, ebomvu bese etjheli). 2. Tjengisa abantwana imizuzu emi – 5 bese ubabawa ukuthi bakhumbule. 3. Fihla iintina bese ubabuza bona basakhumbula na. 4. Phinda ngenye iphetheni usebenzise imibala ehlukile Awama indlela engafani. 5. Ngaso soke isikhathi ungangeza iintina. 6. Sebenzisa iintina ezincane (umakhiwo olula) nabantwana abancane (iminyaka engu 2-4). 7. Sebenzisa iintina ezinengi nabantwana abakhulu (iminyaka engu 4-8). 8. Tjela abantwana ukuthi bakhe amaphetheni ukuze babone. 9. Tjela abantwana ngamajamo, imibala Awabungako bamatje.

source: This game develops:
nbl: Umdlalo lo uthuthukisa:

source: ✔️Numbers , Shapes & Sizes ✔️Skills for Learning
nbl: ✔️IiAwambolo, ubujamo nesayizi ✔️AmakghoAwa wokufunda

source: Get as many Lego, Duplo or building blocks as you have. Each child is going to need the same amount as you.
nbl: Buthelela zoke iin - LEGO, DUPLO, Awama amabhlogo wokwakha onawo. Umntwana ngamunye uzakutlhoga alingana newakho.
