Repository: Ari-Ramkilowan/po-files
Catalog: translations/SGroup2(Release (open))_Venda.po
Languages: ven

source: See what you need
ven: Zwine vha ṱoḓa

source: Read the notes
ven: Kha vha vhale notsi

source: Back to menu
ven: Kha vha humele murahu kha zwirengomu (Menu)

source: It’s time to play Knock Down Skittles. 🎳
ven: Ndi tshifhinga tsha u tamba Wisani Maboḓelo. 🎳

source: This game develops:
ven: Mutambo uyu u bveledza:

source: ✔️Arm & Hand Control ✔️Numbers , Shapes and Sizes
ven: ✔️Ndaulo ya tshanḓa tshoṱhe ✔️Nomboro, zwivhumbeo na saizi

source: This is a great to get the children playing in groups together so that they can make new friends. 1. A set of skittles (3 to 5). You can make these out of empty drinking bottles, but not glass. 2. A ball (you can make this out of plastic bags and onion bags). 3. Space to play skittles.
ven: Izwi ndi zwavhuḓisa kha u ita uri vhana vha tambe vhoṱhe nga zwigwada uri vha kone u vha na vhangana vhaswa. 1. Tshigwada tsha maboḓelo (mararu (3) u ya kha maṱanu (5). Vha nga shumisa maboḓelo a si na tshithu, fhedzi hu si a kwasheaho. 2. Bola (vha nga shumisa mapulasiṱiki kana khedzana dza nyala). 3. Vhupo ha u tambela.

source: See how it works
ven: Zwi shumisa hani

source: It’s also really straightforward, and you can play it over and over. All you have to do is: 1. Line the skittles up in a row. 2. Line the children up in front of the skittles. 3. Together take 5 steps back and count out loud as they step backwards. 4. Give each child a turn to roll the ball towards the skittles. 5. The ball should not leave the ground. 6. Reset the skittles when they have been knocked over. 7. This time take six steps back. 8. Have the children throw under arm first. 9. Then throw overarm. 10. Throw ball with two hands. 11. Throw ball with one hand.
ven: A zwi vhuyi zwa dina, nahone vha nga tamba lu sa gumi, zwine vha tea u ita ndi zwitevhelaho: 1. Kha vha vhee maboḓelo nga muduba. 2. Kha vha imise vhana phanḓa ha maboḓelo nga muduba. 3. Vhoṱhe khathihi kha vha dzhie maga maṱanu (5) vha vhalele nṱha musi vha tshi khou humela murahu. 4. Kha vha nee ṅwana muṅwe na muṅwe tshikhala tsha u kungulusa bola u ya kha maboḓelo. 5. Bola a i ngo tea u kwama fhasi. 6. Kha vha vhuedzedze maboḓelo arali o rwiwa a wela fhasi. 7. Zwino kha vha humele murahu nga maga a rathi. 8. Kha vha ri vhana vha thome u posa nga fhasi ha tshanḓa. 9. Vha kone u posa nga nṱha ha tshanḓa. 10. Kha vha pose bola nga zwanḓa zwivhili. 11. Kha vha pose bola nga tshanḓa tshithihi.

source: But it’s not just physical, you can also use these questions to help the kids learn more: Before you start: • How many skittles can you see? • What colours are they? While you’re taking turns: • How many did you knock over? • How many are left? • Can you catch the ball with 2 hands? Before you start the next round: • How many steps should we take now? • Is that more or less than last time? • Can you catch the ball 1-handed?
ven: zwi a zwi shumisi muvhili fhedzi. Vha nga dovha vha shumisa mbudziso idzi u thusa vhana u guda zwiṅwe zwinzhi: Vha saathu u thoma: • Ni khou vhona maboḓelo mangana? • A na mavhala ifhio? Musi ni tshi khou sielisana: • No wisa mangana? • Ho sala mangana? • Ni a kona u gavha bola nga zwanḓa zwivhili (2)? Ni saathu u thoma raundu i tevhelaho: • Ri tea u dzhia maga mangana? • Aya ndi manzhi kana maṱuku kha a tshifhinga tsho fhelaho? • Ni a kona u gavha bola nga tshanḓa tshithihi (1)?
