Repository: Ari-Ramkilowan/po-files
Catalog: translations/SGroup11(Release (open))_Tsonga.po
Languages: tso

source: The little ones might struggle with the higher levels, but these questions are a great way to ease them into basic maths, and an education on money. 💸 Level 1 • What colours have you used? • What shape are the coins? • Which is the biggest coin? • Which is the smallest? • How many coins do we have? • What do we do with money? • Where should we keep our money? Level 2 • Who can show me a R1 coin? • Who can show me a R2 coin? • Who can show me a R5 coin? • How can you make R6? • How can you make R3 etc? • Etc Level 3 • Who can show me a 5 cent coin? • Who can show me a 10 cent coin? • Who can show me a 20 cent coin? • Who can show me a 50 cent coin? • How can you make 20 cents? • How can you make 10 cents? • Etc
tso: Vana lavantsongo va nga ha tikeriwa hi tilevhele ta le henhla, kambe swivutiso leswi i ndlela ya kahle yo va tivisa hi metse wa masungulo, na dyondzo hi mali. 💸 Levhele ya 1 • Xana u tirhise mihlovo yihi? • Xana tikhoyini i ta xivumbeko xihi? • Xana hi yihi khoyini leyikulu eka hinkwato? • Xana hi yihi leyintsongo eka hinkwato? • Xana hi na tikhoyini tingani? • Xana hi endla yini hi mali? • Xana hi fanele ku veka mali ya hina kwihi? Levhele ya 2 • Xana i mani a nga ndzi kombaka khoyini ya R1? • Xana i mani a nga ndzi kombaka khoyini ya R2? • Xana i mani a nga ndzi kombaka khoyini ya R5? • Xana u nga endla njhani R6? • Xana u nga endla njhani R3 na swin’wana? Levhele ya 3 • Xana i mani a nga ndzi kombaka khoyini ya tisente ta 5? • Xana i mani a nga ndzi kombaka khoyini ya 10 ra tisente? • Xana i mani a nga ndzi kombaka khoyini ya 20 wa tisente? • Xana i mani a nga ndzi kombaka khoyini ya 50 wa tisente? • Xana u nga endla njhani 20 wa tisente? • Xana u nga endla njhani 10 ra tisente?

source: Engage the children in a conversation about money while they go about this game. 1. Make sure each coin has been washed and is clean. 2. While you talk about money and what it’s used for, give each child a coin. 3. Ask them to look at their coin and tell you what they see. 4. Give them each a crayon and a piece of paper. 5. Show them that if you put the coin under the paper and then rub the crayon over it, you’ll see the picture of a coin. 6. Get them to share their items and explore different coins and colours.
tso: Sungula mbulavurisano hi mali loko vana va endla ntlangu lowu. 1. Vona leswaku khoyini yin’wana na yin’wana yi hlantswiwile naswona yi basile. 2. Loko u ri karhi u vulavula hi mali na leswi yi tirhaka swona, nyika n’wana un’wana na un’wana khoyini. 3. Va byele leswaku va languta khoyini ya vona no ku byela leswaku va vona yini. 4. Nyika n’wana un’wana na un’wana khirayoni na xiphephana. 5. Va kombe leswaku loko u veka khoyini ehansi ka phepha kutani u rhaba khirayoni ehenhla ka yona u ta vona xifaniso xa khoyini. 6. Endla leswaku va avelana tiayitheme ta vona na ku kambisisa hi tikhoyini to hambana na mihlovo.

source: Back to menu
tso: Ku tlhelela eka menyu

source: See what you need
tso: Vona leswi u swi lavaka

source: See how it works
tso: Vona leswaku swi tirha njhani

source: Read the notes
tso: Hlaya tinotsi

source: Remind the kids they’ll need to be very responsible when they’re each given one of the following: 1. A coin 2. A piece of paper 3. A crayon
tso: Tsundzuxa vana leswaku va ta fanele ku va na vutihlamuleri loko un’wana na un’wana wa vona a nyikiwa leswi landzelaka: 1. Khoyini 2. Xiphephana 3. Khirayoni

source: This game develops:
tso: Ntlangu lowu wu ya emahlweni:

source: It’s never too early to start learning about money with Money Rubs! 💰
tso: Ku hava ku ri wa ha ri ntsongo ku va u sungula ku dyondza hi mali eka Mali ya Rhaba! 💰

source: ✔️Numbers , shapes & sizes ✔️ Arm & Hand Control
tso: ✔️Tinomboro, swivumbeko na tisayizi ✔️ Ku lawula voko na xandla
