Repository: Ari-Ramkilowan/po-files
Catalog: translations/SGroup13(Release (open))_Tsonga.po
Languages: tso

source: Read the notes
tso: Hlaya tinotsi

source: See what you need
tso: Vona leswi u swi lavaka

source: See how it works
tso: Vona leswaku swi tirha njhani

source: Back to menu
tso: Ku tlhelela eka menyu

source: Make sure the children don’t get too excited and take a bite out of their playdough! 🤢 1. Tell the children that they’re going to make an ice cream. 2. Talk about ice creams. 3. Show them how to roll the play dough into long, thin sausages, and then roll them round and round, making a circle. 4. Put a stick in to make an ice cream. 5. Show them the other kinds of ice creams you can make by rolling balls and decorating them. 6. Have fun, ask questions, and talk to help the children learn more as they play. 7. Set up an ice cream shop to sell the ice creams. 8. Put up pictures of the different kinds of flavours there are. 9. Sing a rhyme about ice cream if you want to. RHYME: I scream, you scream, we ALL scream for ice cream!
tso: Vona leswaku vana va nga nyanyuki ku hundza mpimo va dya dowu ya vona yo tlangisa! 🤢 1. Byela vana leswaku va ta endla ayisikhirimi. 2. Vulavula hi tiayisikhirimi. 3. Va kombi leswi dowu yo tlangisa yi rholisiwaka xiswona yi va tisoseji to lala to leha, kutani va ti rhola ti va swirhendzevutana ti endla sekele. 4. Hoxa ximahandzana endzeni ku endla ayisikhirimi. 5. Va kombi tinxaka letin’wana ta tiayisikhirimi leti u nga ti endlaka hi ku rhola tibolo na ku tikhavisa. 6. Tiphini, vutisa swivutiso, na ku vulavula ku pfuna vana ku dyondza swo tala loko va ri karhi va tlanga. 7. Endla vhengele ra ayisikhirimi ro xavisela kona tisyiskhirimi. 8. Veketela swifaniso swa tiayisikhirimi ta minantswo ya tinxaka leti nga kona. 9. Yimbelela rhayimi hi ayisikhirimi loko u swi lava. RHAYIMI: Ndza cema, wa cema, hinkwerhu hi cemela ayisikhirimi!

source: Ask the children some questions to help their imaginations run wild. Level 1 • What ice creams do you like? • When do you eat them? • How do you feel when you have an ice cream? • What colour are you going to make? • What shape do you like? • Etc. Level 2 • What flavour are your ice creams? • How many do we have now? • Should we set up and ice cream shop? Level 3 • How much do your ice creams cost? • I only have this amount of money. Do I need change?
tso: Vutisa vana swivutiso swo karhi ku endlela leswaku miehleketo ya vona yi hangalaka. Levhele ya 1 • Xana u tsakela tiayisikhirimi tihi? • Xana u ti dya rini? • Xana u ti twa njhani loko u ri na ayisikhirimi? • Xana u ta endla muhlovo wa njhani? • Xana u rhandza xivumbeko xihi? • Na swin’wana. Levhele ya 2 • Xana tiayisikhjirimi ta wena i ta nantswo wihi? • Xana hi na tingani sweswi? • Xana hi nga sungula vhengele ra ayisikhirimi? Levhele ya 3 • Xana tiayiskhirimi ta wena ti durha mali muni? • Ndzi na mali leyi ntsena. Xana ndzi lava cinci?

source: ✔️Talking & Understanding ✔️Arm & hand control
tso: ✔️Ku vulavula na ku twisisa ✔️Ku lawula voko na xandla

source: This is a great game to play during summer, and the good news is that these Playdough Ice Creams won’t melt. 🍦
tso: Lowu I ntlangu wa kahle ku wu endla hi ximumu, naswona mahungu lamanene hi leswaku Tiayisikhirimi leti ta Dowu yo Tlangisa a ti nge n’oki. 🍦

source: This one is super simple! All that’s needed is: 1. Playdough in a few different colours. 2. Ice cream sticks or something that could be used as an ice cream stick.
tso: Lowu wu olovile swinene! U lava ntsena: 1.Dowu yo tlangisahi mihlovo yo hambanahambana. 2. Swimhandzana swa ayisikhirimi kumbe nchumu wo karhi lowu nga tirhisiwaka tanihi ximhandzana xa ayiskhirimi.

source: This game develops:
tso: Ntlangu lowu wu ya emahlweni:
