Repository: Ari-Ramkilowan/po-files
Catalog: translations/SGroup14(Release (open))_Xhosa.po
Languages: xho

source: Read the notes
xho: Funda amanqaku

source: See what you need
xho: Bona okudingayo

source: See how it works
xho: Jonga ukuba isebenza njani

source: Back to menu
xho: Buyela kwimenyu

source: While their creative juices are flowing, get their brains going by asking them some questions. Level 1 • What colour is this? • What shape is this • How many colours can you see? • Where will you stick this? Level 2 • How many pieces do you have? • What pattern is this? Level 3 • How will you use these pieces to make a picture? • What is your picture? • Can you tell me about it? • Can you make your name?
xho: Xa ijusi yabo yobugcisa isampompmoza, fumana ingqondo zbo ngokuba ubabuze eminye imibuzo. Umgangatho 1 • Ingaba ngowuphi lo mbala? • Ingaba kokuphi ukumila • Ingaba mingaphi imibala onokuyibona? • Ingaba uza kuyincamathiselaphi lento? Umgangatho 2 • Zingaphi iziqwenga ozibonayo? • Ingaba yeyiphi le phatheni? Umgangatho 3 • Uza kuzisebenzisa njani ezi ziqwenga ukwenza umfanekiso? • Yintoni umfanekiso wakho? • Unokundixelela ngawo? • Unako ukwenza igama lakho?

source: ✔️Arm & Hand Control ✔️Numbers , Shapes & Sizes
xho: ✔️Ulawulo lwengalo kunye nesandla ✔️Amanani, ukumila kunye nesayizi

source: Now it’s time to turn trash into treasure. 1. Make sure the chip packets are clean. 2. Ask the kids to share the chip packets between themselves. 3. Then ask them to cut or tear up chip packets into small pieces or shapes. 4. Get them to stick these pieces of chip packet onto the paper. 5. Encourage creativity as they make their pictures. 6. Talk about shapes, sizes, colour, texture, patterns, etc. 7. Help them to cut and stick as is needed. 8. Older children can even make spell their names out with the pieces.
xho: Ngoku lixesha lokujika udoti abeliixabiso. 1. Qinisekisa ukuba iipakethi ze-chip zicocekile. 2. Buza abantwana ukuba babelane ngamapakethi e-chip phakathi kwabo. 3. Emva koko bacele ukuba banqande okanye baqhekeze iipakethi ze-chip zibe ziincinci ezincinane okanye imilo. 4. Zenze ukuba zizinamathele ezi ziqwenga zepakethi kwiphepha. 5. Khuthaza ubugcisa njengoko benza imifanekiso yabo. 6. Thetha ngokubunjwa, ubukhulu, umbala, ukubunjwa, iipateni, njl njl. 7. Bancede ukuba banqande kwaye banamathele njengoko kuyadingeka. 8. Abantwana abakhulileyo banokwenza nokuba amagama abo aphethwe ngamagama.

source: Use Chip Packet Fun to teach the kids about not only making art, but recycling too.🥔
xho: Sebenzis iipakethi leeTships ukufundisa abantwana malunga jayi kuphela ukwenza ubugcisa bomzobo kodwa nokuphinde usebenzise into kwakhona.🥔

source: If there’s litter in the area, why not get the kids to collect it and throw it away while they look for chip packets? This is what you’ll for this game: • A clean chip packet per child • Piece of paper per child • Glue and scissors
xho: Ukkuba kukhona indawo yokulahla apho, kutheni ungenzi abantwana bayiqokelele kwaye bayilahle ngoku bekhangela ipakethi letshipsi? Kuko oza kwenza kulo mdlalo: • Ipakethi yetshipsu umntwana ngamnye • Ipisi yephepha umntwana ngamnye • Iglu • Izikere

source: This game develops:
xho: Lo mdlalo uphuhlisa:
