Repository: Ari-Ramkilowan/po-files
Catalog: translations/SGroup11(Release (open))_Tswana.po
Languages: tsn

source: The little ones might struggle with the higher levels, but these questions are a great way to ease them into basic maths, and an education on money. 💸 Level 1 • What colours have you used? • What shape are the coins? • Which is the biggest coin? • Which is the smallest? • How many coins do we have? • What do we do with money? • Where should we keep our money? Level 2 • Who can show me a R1 coin? • Who can show me a R2 coin? • Who can show me a R5 coin? • How can you make R6? • How can you make R3 etc? • Etc Level 3 • Who can show me a 5 cent coin? • Who can show me a 10 cent coin? • Who can show me a 20 cent coin? • Who can show me a 50 cent coin? • How can you make 20 cents? • How can you make 10 cents? • Etc
tsn: Bana ba bannye ba ka nna ba palelwa ke maemo a a kwa godimo, mme dipotso tse ke tsela e e siameng thata ya go ba thusa gore go nne bonolo gore ba itse dipalo tsa motheo, le thuto ka madi. 💸 Maemo 1 • O dirisitse mebala efe? • Madi a bopegile jang? • Ledi le legolo thata ke lefe? • Ledi le lennye thata ke lefe? • Re na le madi a tshipi a le kae? • Ke eng se re se dirang ka madi? • Re tshwanetse go boloka madi a rona kae? Maemo 2 • Ke mang yo o ka mpontshang ledi la tshipi la tshipi la R1? • Ke mang yo o ka mpontshang ledi la tshipi la tshipi la R2? • Ke mang yo o ka mpontshang ledi la tshipi la tshipi la R5? • O ka dira R6 jang? • O ka dira R3 jang jalo jalo? Maemo 3 • Ke mang yo o ka mpontshang ledi la tshipi la disente tse 5? • Ke mang yo o ka mpontshang ledi la tshipi la disente tse 10? • Ke mang yo o ka mpontshang ledi la tshipi la disente tse 20? • Ke mang yo o ka mpontshang ledi la tshipi la disente tse 50? • O ka dira disente tse 20 jang? • O ka dira disente tse 10 jang?

source: Engage the children in a conversation about money while they go about this game. 1. Make sure each coin has been washed and is clean. 2. While you talk about money and what it’s used for, give each child a coin. 3. Ask them to look at their coin and tell you what they see. 4. Give them each a crayon and a piece of paper. 5. Show them that if you put the coin under the paper and then rub the crayon over it, you’ll see the picture of a coin. 6. Get them to share their items and explore different coins and colours.
tsn: Simolola motlotlo kaga madi fa bana ba ntse ba dira motshameko o. 1. Tlhomamisa gore ledi la tshipi lengwe le lengwe le tlhatswitswe ebile le phepa. 2. Fa o ntse o bua ka madi le gore a dirisediwa eng, naya ngwana mongwe le mongwe ledi la tshipi. 3. Ba kope gore ba lebe ledi la tshipi la bone le gore ba go bolelele gore ba bona eng. 4. Naya mongwe le mongwe wa bone kerayone le pampiri. 5. Ba bontshe gore fa o baya ledi la tshipi kafa tlase ga pampiri o bo o tshasa kerayone mo godimo ga yone, o tla bona setshwantsho sa ledi la tshipi. 6. Dira gore ba abelane dilo tse ba di dirisang le gore ba tlhotlhomise madi a tshipi le mebala.

source: Back to menu
tsn: Boela kwa mmenyung

source: See what you need
tsn: Bona se o se tlhokang

source: See how it works
tsn: Bona kafa o tshamekiwang ka teng

source: Read the notes
tsn: Bala dintlha

source: Remind the kids they’ll need to be very responsible when they’re each given one of the following: 1. A coin 2. A piece of paper 3. A crayon
tsn: Gakolola bana gore ba tlhoka go bontsha maikarabelo thata fa mongwe le mongwe wa bone a newa tse di latelang: 1. Ledi 2. Pampiri 3. Kerayone

source: This game develops:
tsn: Motshameko o o a tswelela:

source: It’s never too early to start learning about money with Money Rubs! 💰
tsn: Ga go nke go nna pele ga nako thata go simolola go ithuta madi ka go Gotlhagotlha Madi! 💰

source: ✔️Numbers , shapes & sizes ✔️ Arm & Hand Control
tsn: ✔️Dipalo, dipopego le disaese ✔️ Taolo ya lebogo le seatla
