Repository: Ari-Ramkilowan/po-files
Catalog: translations/SGroup14(Release (open))_South Ndebele.po
Languages: nbl

source: Read the notes
nbl: Funda amaAwathi

source: See what you need
nbl: Bona ukuthi utlhoga ini

source: See how it works
nbl: Bona ukuthi isebenza bunjani

source: Back to menu
nbl: Buyela erhelweni

source: While their creative juices are flowing, get their brains going by asking them some questions. Level 1 • What colour is this? • What shape is this • How many colours can you see? • Where will you stick this? Level 2 • How many pieces do you have? • What pattern is this? Level 3 • How will you use these pieces to make a picture? • What is your picture? • Can you tell me about it? • Can you make your name?
nbl: Ubukghwari babo nabehlako, khambisa imicabangoo yabo ngokubabuza imibuzo. Ileveli yoku - 1 • Mbala onjani lo? • Ngiliphi ijamo leli? • Uzokunamathisela Kuphi lokhu? Ileveli Iyei - 2 • Uneenquntu ezingaki? • Ngiyiphi iphethini le? Ileveli Iyei - 3 • Uzozisebenzisa kanjani iinquntwezi ukwenza isithombe? • Yini isithombe sakho? • Ungangitjela ngaso? • Ungalenza igama lakho?

source: ✔️Arm & Hand Control ✔️Numbers , Shapes & Sizes
nbl: ✔️Ukulawula umkhoAwa nesandla ✔️IiAwambolo, ubujamo namasayizi

source: Now it’s time to turn trash into treasure. 1. Make sure the chip packets are clean. 2. Ask the kids to share the chip packets between themselves. 3. Then ask them to cut or tear up chip packets into small pieces or shapes. 4. Get them to stick these pieces of chip packet onto the paper. 5. Encourage creativity as they make their pictures. 6. Talk about shapes, sizes, colour, texture, patterns, etc. 7. Help them to cut and stick as is needed. 8. Older children can even make spell their names out with the pieces.
nbl: Nje sikhathi sokuphendula isila ibe ligugu. 1.Qinisekisa ukuthi amaphakethana wamatjhipsi ahlanzekile. 2.Bawa abafundi bona babelana amaphakethana hlangana nabo. 3.Bese ubabawa ukuthi bawadabule abe ziinquntu ezincane. 4.Thana banamathisele iinquntwana zamaphakethe ephepheni. 5.Khuthaza ubukghwari nabenza iinthombe zabo. 6.Cocani ngobujamo, amasayizi, imibala, amaphethini, njll. 7.Barhelebhe ukusika Awakunamathisela. 8.Abantwana abakhulu bangapela namagama wabo ngeenquntu.

source: Use Chip Packet Fun to teach the kids about not only making art, but recycling too.🥔
nbl: Sebenzisa i-Chip Packet Fun ukufundisa abantwana kungasikwaphela ukwenza ubukghwari kodwana ukusebenzisa izinto ebezisetjenzisiwe ukwenza umkhiqizo omutjha.🥔

source: If there’s litter in the area, why not get the kids to collect it and throw it away while they look for chip packets? This is what you’ll for this game: • A clean chip packet per child • Piece of paper per child • Glue and scissors
nbl: Nakukhona ukusiphalaza endaweni, kuba yini ungathi abantwana bayobutha bese balahla kude bafuna amaphakethe wamatjhipsi? Nakhu ozakuthloga: • Iphakethana lamatjhipsi elihlanzekile umntwana ngamunye • Isiquntu sephepha umntwana ngamunye • Irhomu • Isikere

source: This game develops:
nbl: Umdlalo lo uthuthukisa:
