Repository: Ari-Ramkilowan/po-files
Catalog: translations/SGroup8(Release (open))_Southern Sotho.po
Languages: sot

source: Another great arts and crafts activity is Making Faces 😃🙃🤪😜🤩😎😠🤗🤐😴🤕🤒🤠🤯😍
sot: Ketsahalo e nngwe e kgolo ya bonono le bobetli ke ho Etsa Difahleho 😃🙃🤪😜🤩😎😠🤗🤐😴🤕🤒🤠🤯😍

source: But I don’t mean pulling faces, I mean making them with: 1. 1 piece of paper per child 2. Wool 3. Scissors and glue For younger children: 1. Cut out 1 pair of eyes per child. 2. Cut out 1 pair of ears per child. 3. Cut out nose per child. 4. Cut out mouth per child. For older children: 1. Pictures where they can cut out the eyes, nose, mouth etc.
sot: Ha ke bolele ho swenya difahleho, ke bolela ho di etsa ka: 1. Sekgetjhana se 1 sa pampiri ngwana ka mong 2. Ulu 3. Dikere 4. Sekgomaretsi Bakeng sa bana ba banyenyane: 1. Seha o ntshe mahlo a mabedi bakeng sa ngwana ka mong. 2. Seha o ntshe ditshebe tse pedi bakeng sa ngwana ka mong. 3. Seha o ntshe nko bakeng sa ngwana ka mong. 4. Seha o ntshe molomo bakeng sa ngwana ka mong. Bakeng sa bana ba baholwanyane: 1. Ditshwantsho tseo ba sehang le ho ntsha mahlo, nko molomo, jj. ho tsona.

source: Read the notes
sot: Bala dinoutso

source: See what you need
sot: Sheba seo o se hlokang

source: See how it works
sot: Bona hore e sebetsa jwang

source: Back to menu
sot: Kgutlela ho menu

source: This game develops:
sot: Papadi ena e ntshetsa pele:

source: ✔️Arm & Hand Control ✔️Talking & Understanding
sot: ✔️Taolo ya sephaka le letsoho ✔️Ho bua le ho utlwisisa

source: Once you have everything you need: 1. Give each child a piece of paper and cut-out pictures of noses, eyes, ears and mouths to give to younger children. 2. Give pictures of faces to older children. 3. Ask them to use the pictures to make a face. 4. Talk about the senses as you do it (smell, taste, seeing, hearing etc.). 5. Get them to stick their pictures down when they have made their faces. 6. Give them each some wool and ask them to turn it into hair. 7. They can cut and stick the materials in any way they want to. 8. Look at the faces together and talk about them to help the kids learn. There are examples of what to ask in the notes. 9. Cut the faces out and attach them to a stick. 10. You can use these to tell stories.
sot: Hang ha o se o ena le tsohle tseo o di hlokang: 1. Efa ngwana ka mong sekgetjhana sa pampiri le ditshwantsho tse sehilweng sa dinko, mahlo, ditsebe le melomo hore ba di fe bana ba banyenyane. 2. Efa bana ba baholwanyane ditshwantsho tsa difahleho. 3. Ba kope hore ba sebedise ditshwantsho tseo ho etsa difahleho. 4. Bua ka dikutlo ha o ntse o etsa sena (ho fofonela, ho latswa, ho bona, ho utlwa, ho thetas jj.). 5. Ere ba kgomaretse ditshwantsho tsa bona ha ba se ba entse difahleho tsa bona. 6. Ba fe boya bo itseng mme ore ba bo fetole moriri. 7. Ba ka seha le ho manamisa dintho ka tsela efe kapa efe eo ba e batlang. 8. Shebang difahleho tseo mmoho mme le bue ka tsona ho thusa bana ho ithuta. Ho na le mehlala ya se ka botswang dinoutsong. 9. Seha le ho ntsha difahleho mme o di kgomaretse thupeng. 10, O ka di sebedisa bakeng sa ho pheta dipale.

source: As promised, here are some questions: ❓ Level 1 • What do we use our noses for? • What do we use our eyes for? • And our ears? • Is your face happy or sad? • What kind of hair will you make? • What is the name of this face? Level 2 • What is your favourite taste? • What do you like to smell? • What can you hear right now? • What can you see with your eyes if you look left? • What can you see with your eyes if you look to the right? Level 3 Allow older children to make up a story - for example: • Who does your face belong to? • Mine is a gogo • What do you want to say to gogo? • Gogo asks: “What you would like for supper?” • Gogo asks if you will help her make supper. • What shall we do first? You can even act the story out if you like.
sot: Jwaloka kaha re tshepisitse, dipotso tse itseng ke tsena: Mohato wa 1 • Re sebedisa dinko tsa rong bakeng sa eng? • Re sebedisa mahlo a rona bakeng sa eng? • Ditsebe tsa rona tsona? • Na sefahleho sa hao se thabile kapa se hloname? • O tla etsa mofuta ofe wa moriri? • Lebitso la sefahleho see ke eng? Mohato wa 2 • Tatso eo o e ratisisang ke efe? • O rata ho fofonela eng? • Ke eng eo o e utlwang hona jwale? • Ke eng eo o ka e bonang ka mahlo a hao ha o ka sheba ka ho le letshehadi? • Ke eng eo o ka e bonang ka mahlo a hao ha o ka sheba ka ho le letona? Mohato wa 3 Dumella bana ba baholwanyane ho iqapela pale – ho etsa mohlala: • Sefahleho sa hao ke sa mang? • Sa ka ke nkgono. • O batla ho reng ho nkgono? • Nkgono o a botsa: “O ka thabela eng bakeng sa dijo tsa mantsiboya?” • Nkgono o a botsa hore na o ka kgona ho mo thusa ho pheha dijo tsa mantsiboya. • Re ka etsang eng pele? Le ka nna la tshwantshisa pale eo ha le batla.
