Repository: Ari-Ramkilowan/po-files
Catalog: translations/SGroup2(Release (open))_Xhosa.po
Languages: xho

source: See what you need
xho: Bona okudingayo

source: Read the notes
xho: Funda amanqaku

source: Back to menu
xho: Buyela kwimenyu

source: It’s time to play Knock Down Skittles. 🎳
xho: Lithuba lokudlala uBethwa Phantsi Skittles. 🎳

source: This game develops:
xho: Lo mdlalo uphuhlisa:

source: ✔️Arm & Hand Control ✔️Numbers , Shapes and Sizes
xho: ✔️Ulawulo lwengalo kunye nesandla ✔️Amanani, ukumila kunye nesayizi

source: This is a great to get the children playing in groups together so that they can make new friends. 1. A set of skittles (3 to 5). You can make these out of empty drinking bottles, but not glass. 2. A ball (you can make this out of plastic bags and onion bags). 3. Space to play skittles.
xho: Oku kuhle kufamana abantwana bedlala ngamaqela kunye ukuze benze abahlobo abatsha. 1. Isethi yeskittles (3 ukuya ku-5). Unokwenza oku ngaphandle kweebhotile ezingenanto, kodwa kungekhona iglasi. 2. Ibhola (unokwenza oku ngaphandle kweebhokisi zeplastiki kunye nezikhwama ze-anyanisi). 3. Isikhundla sokudlala iiskittles.

source: See how it works
xho: Jonga ukuba isebenza njani

source: It’s also really straightforward, and you can play it over and over. All you have to do is: 1. Line the skittles up in a row. 2. Line the children up in front of the skittles. 3. Together take 5 steps back and count out loud as they step backwards. 4. Give each child a turn to roll the ball towards the skittles. 5. The ball should not leave the ground. 6. Reset the skittles when they have been knocked over. 7. This time take six steps back. 8. Have the children throw under arm first. 9. Then throw overarm. 10. Throw ball with two hands. 11. Throw ball with one hand.
xho: Ithe ngqo kwaye ungayidlala kaninzi kaninzi. Konke okufuneka ukwenze ku: 1. Kwenza umgca we-skittles phezulu. 2. Wenze abantwana bame phambi kweempahla. 3. Hlanganisa kunye namanqanaba ama-5 emva kwaye ubale ngokuvakalayo njengoko bebuyela emva. 4. Nika umntwana ngamnye umjikelo ukuze aqhube ibhola kwi-skittles. 5. Ibhola akufanele ihambe emhlabeni. 6. Hlaziya kwakhona i-skittles xa bebanjwe. 7. Eli thuba thabatha amanyathelo ayisithandathu. 8. Ingaba abantwana baphosa phantsi kwekhwapha kuqala. 9. Emva koko baphose ngaphaya kwengalo. 10. Phosa ibhola ngezandla zombini. 11. Jula ibhola ngesandla esinye

source: But it’s not just physical, you can also use these questions to help the kids learn more: Before you start: • How many skittles can you see? • What colours are they? While you’re taking turns: • How many did you knock over? • How many are left? • Can you catch the ball with 2 hands? Before you start the next round: • How many steps should we take now? • Is that more or less than last time? • Can you catch the ball 1-handed?
xho: Ayipheleli emzimbeni ongahandle kuphela. Unako ukusebenzisa le mibuzo ukunceda abantwana bafunde lukhulu: Ngaphambi kokuba uqale: • Zingaphi iziskittle ongazibona? • Ziyeyphi imibala? Ngoku nisatshintshisana: •Zingaphi oziwisile? • Zingaphi ezishiyekile? •Ungayibamba ibhola ngezandla ezibini? Ngaphambi kokuba uqale umjikelo wesibini: • Mangaphi amanyathelo esingawathatha ngoku? • Ingaba oko kuninzi okanye kuncinane kunexesha eligqithileyo? • Ungayibamba ibhola ngesandla esinye?
