Repository: Ari-Ramkilowan/po-files
Catalog: translations/SGroup18(Release (open))_Tswana.po
Languages: tsn

source: Need some inspiration? Keep the game going with questions like these: Level 1 • Look around and choose an item that everyone can see. • Don’t tell the others what it is. • Then say “I spy with my little eye, something that is green.” • Let the children guess what it is by calling out all the green things they see. • Try not to make it too difficult. Level 2 • Then say “I spy with my little eye, something beginning with ‘w’.” • Use the sound “w”, not the letter. • Let the kids guess the item. • Give each child a turn to take a guess. Level 3 • Then say “I spy with my little eye, something beginning with ‘ch’.” • Use the sound “ch”, not the letter. • Let the kids guess the item. • Give each child a turn to take a guess.
tsn: A o tlhoka tlhotlheletso? Tsweledisa motshameko ka go botsa dipotso tse di tshwanang le: Maemo 1 • Leba mo tikologong mme o tlhophe selo se mongwe le mongwe a kgonang go se bona. • O seka wa bolelela ba bangwe gore ke eng. • O bo o re “Ke setlhola ka matlhonyana a me, sengwe se setala.” • Dira gore bana ba fopholetse gore ke eng ka go bua dilo tsotlhe tse ditala. • Leka go dira gore e seka ya nna selo se se thata. Maemo 2 • O bo o re “Ke setlhola ka matlhonyana a me, sengwe se se simololang ka ‘f’.” (Setswana doesnt have things whose names start with ‘w’. I've used ‘f’ instead). • Dirisa modumo “f”, e seng tlhaka. • Dira gore bana ba fopheletse gore selo seo ke eng. • Naya ngwana mongwe le mongwe tshono ya go fopholetsa. Maemo 3 • O bo o re “Ke setlhola ka matlhonyana a me, sengwe se se simololang ka ‘s’.” (Setswana doesnt have things whose names start with ‘ch’. I've used ‘s’ instead). • Dirisa modumo “s”, e seng tlhaka. • Dira gore bana ba fopheletse gore selo seo ke eng. • Naya ngwana mongwe le mongwe tshono ya go fopholetsa.

source: We’re taking I Spy to the next level with some eye glasses. Here’s what you’ll need 👓: • 2 used toilet rolls per child. • String. • Scissors. • 2 sticks per child. • Cellotape.
tsn: Re isa motshameko wa Ke Setlhola kwa maemong a a kwa godinwana ka digalase tsa matlho. Tse o tla di tlhokang ke tse 👓: • dirolo tse 2 tsa thoelete ngwana mongwe le mongwe • Mogala • Sekere • Dithobanyane di le 2 ngwana mongwe le mongwe • Theipe e e ngaparelang

source: Read the notes
tsn: Bala dintlha

source: Back to menu
tsn: Boela kwa mmenyung

source: You’ll be showing these cool kids how to make a pair of glasses.😎 1. Cut the toilet roll into 2 rings and tie them together to make glasses 2. Attach the sticks to the sides of the glasses to make the ‘arms’ of the glasses. 3. Support the younger kids. 4. Encourage the older ones to this on their own. 5. Ask the children to put their glasses on and talk about what glasses do. 6. Play I Spy: Find something in the room that everyone can see, for example, a table. 7. Say: “I Spy with my little eye, something beginning with ‘t’ (sound)” 8. Let each child have a turn guessing. 9. Walk around the room and tell them what you see through your glasses. 10. Get them to walk with you, glasses on!
tsn: O tla bo o bontsha bana ba ba botlhale ba go dira digalase tsa matlho.😎 1. Sega rolo ya pampiri ya thoelete direng tse 2 o bo o di bofaganya go dira digalase. 2. Tomela dithobanyane mo matlhakoreng a digalae go dira ‘matshwaro’ a digalase. 3. Thusa bana ba bannye. 4. Kgothaletsa bana ba bagolwane go dira se ka bobone. 5. Kopa bana go rwala digalase mme o bue gore digalase di dirang. 6. Tshameka Ke Setlhola: Batla sengwe mo phaposing ya borutelo se mongwe le mongwe a kgonang go se bona, ka sekai, tafole. 7. E re: “Ke Setlhola ka matlhonyana a me, sengwe se se simololang ka ‘t’ (modumo)” 8. Naya ngwana mongwe le mongwe tshono ya go fopholetsa. 9. Nna o tsamaye o dikologa phaposi ya borutelo mme o ba bolelele se o se bonang ka digalase tsa gago. 10. Dira gore ba tsamaye le wena, ba rwele digalase!

source: See what you need
tsn: Bona se o se tlhokang

source: See how it works
tsn: Bona kafa o tshamekiwang ka teng

source: We put a spin on the classic game, I Spy. 🔍
tsn: Re fetola go sekae motshameko wa maemo, Ke Setlhola.🔍

source: This game develops:
tsn: Motshameko o o a tswelela:

source: ✔️Social ✔️Early Reading & Writing
tsn: ✔️Le batho ✔️Go kgona gobala le go kwala ba sa le bannye
