Repository: Ari-Ramkilowan/po-files
Catalog: translations/SGroup18(Release (open))_Afrikaans.po
Languages: afr

source: Need some inspiration? Keep the game going with questions like these: Level 1 • Look around and choose an item that everyone can see. • Don’t tell the others what it is. • Then say “I spy with my little eye, something that is green.” • Let the children guess what it is by calling out all the green things they see. • Try not to make it too difficult. Level 2 • Then say “I spy with my little eye, something beginning with ‘w’.” • Use the sound “w”, not the letter. • Let the kids guess the item. • Give each child a turn to take a guess. Level 3 • Then say “I spy with my little eye, something beginning with ‘ch’.” • Use the sound “ch”, not the letter. • Let the kids guess the item. • Give each child a turn to take a guess.
afr: Het jy inspirasie nodig? Hou die speletjie aan die gang met vrae soos hierdie: Vlak 1 • Kyk rond en kies ’n item wat almal kan sien. • Moenie die ander vertel wat dit is nie. • Sê dan: “Ek sien met my kleine ogies iets wat groen is.” • Laat die kinders raai wat dit is deur al die groen dinge wat hulle sien, uit te roep. • Probeer om dit nie te moeilik te maak nie. Vlak 2 • Sê dan: “Ek sien met my kleine ogies iets wat met ‘w’ begin.” • Gebruik die klank ‘w’, nie die letter nie. • Laat die kinders die item raai. • Gee elke kind ’n beurt om te raai. Vlak 3 • Sê dan: “Ek sien met my kleine ogies iets wat met ‘br’ begin.” • Gebruik die klank ‘br’, nie die letters nie. • Laat die kinders die item raai. • Gee elke kind ’n beurt om te raai.

source: We’re taking I Spy to the next level with some eye glasses. Here’s what you’ll need 👓: • 2 used toilet rolls per child. • String. • Scissors. • 2 sticks per child. • Cellotape.
afr: Ons kikker dié speletjie op met brille. Hier is wat jy nodig het: 👓 • 2 gebruikte toiletrolle per kind • Tou • ’n Skêr • 2 stokkies per kind • Kleefband

source: Read the notes
afr: Lees die notas

source: Back to menu
afr: Terug na spyskaart

source: You’ll be showing these cool kids how to make a pair of glasses.😎 1. Cut the toilet roll into 2 rings and tie them together to make glasses 2. Attach the sticks to the sides of the glasses to make the ‘arms’ of the glasses. 3. Support the younger kids. 4. Encourage the older ones to this on their own. 5. Ask the children to put their glasses on and talk about what glasses do. 6. Play I Spy: Find something in the room that everyone can see, for example, a table. 7. Say: “I Spy with my little eye, something beginning with ‘t’ (sound)” 8. Let each child have a turn guessing. 9. Walk around the room and tell them what you see through your glasses. 10. Get them to walk with you, glasses on!
afr: Jy sal hierdie oulike kinders wys hoe om ’n bril te maak. 😎 1. Knip die toiletrol in 2 ringe en bind dit saam om ’n bril te maak. 2. Heg die stokkies aan die kante van die bril vas om die ‘arms’ van die bril te maak. 3. Help die jonger kinders hiermee. 4. Moedig die ouer kinders aan om dit op hul eie te doen. 5. Vra die kinders om hul brille op te sit en praat oor die funksie van brille. 6. Speel Ek sien met my Kleine Ogies (I Spy): Vind iets in die kamer wat almal kan sien, soos ’n tafel. 7. Sê: “Ek sien met my kleine ogies iets wat met ‘t’ (klank) begin.” 8. Gee elke kind ’n beurt om te raai. 9. Loop deur die kamer en vertel hulle wat jy deur jou bril sien. 10. Laat hulle saam met jou loop, brille aan!

source: See what you need
afr: Kyk wat jy nodig het

source: See how it works
afr: Kyk hoe dit werk

source: We put a spin on the classic game, I Spy. 🔍
afr: Ons speel ‘Ek sien met my kleine ogies’ (I Spy) effens anders. 🔍

source: This game develops:
afr: Hierdie speletjie ontwikkel:

source: ✔️Social ✔️Early Reading & Writing
afr: ✔️Sosiale vaardighede ✔️Vroeë lees en skryf
