Repository: Ari-Ramkilowan/po-files
Catalog: translations/SGroup11(Release (open))_Afrikaans.po
Languages: afr

source: The little ones might struggle with the higher levels, but these questions are a great way to ease them into basic maths, and an education on money. 💸 Level 1 • What colours have you used? • What shape are the coins? • Which is the biggest coin? • Which is the smallest? • How many coins do we have? • What do we do with money? • Where should we keep our money? Level 2 • Who can show me a R1 coin? • Who can show me a R2 coin? • Who can show me a R5 coin? • How can you make R6? • How can you make R3 etc? • Etc Level 3 • Who can show me a 5 cent coin? • Who can show me a 10 cent coin? • Who can show me a 20 cent coin? • Who can show me a 50 cent coin? • How can you make 20 cents? • How can you make 10 cents? • Etc
afr: Die kleintjies kan met die hoër vlakke sukkel, maar hierdie vrae is ’n goeie manier om hulle geleidelik aan basiese wiskunde en opvoeding oor geld bloot te stel. 💸 Vlak 1 • Watter kleure het jy gebruik? • Watter vorm is die muntstukke? • Wat is die grootste muntstuk? • Wat is die kleinste? • Hoeveel muntstukke het ons? • Wat doen ons met geld? • Waar moet ons ons geld hou? Vlak 2 • Wie kan vir my ’n R1-muntstuk wys? • Wie kan vir my ’n R2-muntstuk wys? • Wie kan vir my ’n R5-muntstuk wys? • Hoe kan jy R6 opmaak? • Hoe kan jy R3, ens. opmaak? Vlak 3 • Wie kan vir my ’n 5 sent-muntstuk wys? • Wie kan vir my ’n 10 sent-muntstuk wys? • Wie kan vir my ’n 20 sent-muntstuk wys? • Wie kan vir my ’n 50 sent-muntstuk wys? • Hoe kan jy 20 sent opmaak? • Hoe kan jy 10 sent opmaak?

source: Engage the children in a conversation about money while they go about this game. 1. Make sure each coin has been washed and is clean. 2. While you talk about money and what it’s used for, give each child a coin. 3. Ask them to look at their coin and tell you what they see. 4. Give them each a crayon and a piece of paper. 5. Show them that if you put the coin under the paper and then rub the crayon over it, you’ll see the picture of a coin. 6. Get them to share their items and explore different coins and colours.
afr: Begin ’n gesprek oor geld terwyl die kinders hierdie speletjie speel. 1. Maak seker dat elke muntstuk gewas en skoon is. 2. Terwyl jy oor geld en die gebruik daarvan praat, gee elke kind ’n muntstuk. 3. Vra hulle om na hul muntstuk te kyk en te vertel wat hulle sien. 4. Gee hulle elkeen ’n kryt en ’n vel papier. 5. Wys hulle dat as jy die muntstuk onder die papier sit en die kryt daaroor krap, jy die prentjie van die muntstuk sal sien. 6. Laat hulle items met mekaar deel en verskillende muntstukke en kleure verken.

source: Back to menu
afr: Terug na spyskaart

source: See what you need
afr: Kyk wat jy nodig het

source: See how it works
afr: Kyk hoe dit werk

source: Read the notes
afr: Lees die notas

source: Remind the kids they’ll need to be very responsible when they’re each given one of the following: 1. A coin 2. A piece of paper 3. A crayon
afr: Herinner die kinders dat hulle baie verantwoordelik moet wees wanneer elkeen die volgende ontvang: 1. ’n Muntstuk 2. ’n Vel papier 3. ’n Kryt

source: This game develops:
afr: Hierdie speletjie ontwikkel:

source: It’s never too early to start learning about money with Money Rubs! 💰
afr: Dit is nooit te vroeg om oor geld te begin leer met Muntstuk-uitkrap (Money Rubs) nie! 💰

source: ✔️Numbers , shapes & sizes ✔️ Arm & Hand Control
afr: ✔️Getalle, vorms en grootte ✔️Arm- en handbeheer
