Repository: Ari-Ramkilowan/po-files
Catalog: translations/SGroup1(Release (open))_Zulu.po
Languages: zul

source: This is the story, as well as Mandla’s actions and emotions: 1. Mandla wants to go and play with his friend Lebo (he’s excited) 😃 2. Mandla’s mama says he can go (he’s happy) 🙂 3. Mandla walks to Lebo’s house (he’s walking)🚶 4. When he gets to Lebo’s house she’s not there (he’s sad) 😞 5. So Mandla sits on the step and waits for her (he sits and feels tired) 😓 6. Lebo’s mama arrives (he’s pleased) 😁and Mandla asks where Lebo is (he’s polite) 🗣 7. She says that Lebo has gone to Mandla’s house (he’s surprised) 😱 8. Mandla runs home to find Lebo (he’s running). 🏃 9. She is there and he is happy. 😆 10. He hugs her. 🤗 You can add to the story to make it more exciting and give the children more chances to mime actions or express feelings.
zul: Nansi indaba, kanjalo neminyakazo kaMandla nemizwa yakhe: 1. UMandla ufuna ukuhamba ayodlala nomngani wakhe uLebo (weneme). 😃 2. Unina kaMandla uthi angahamba (ujabule). 🙂 3. UMandla uyahamba aye kubo kaLebo (uyahamba).🚶 4. Uma esefika kubo kaLebo ufika engekho (udangele). 😞 5. Ngakho uMandla uhlala emasitebhisini bese emlinda (uyahlala aze azizwe esekhathele). 😓 6. Unina kaLebo uyafika (uyajabula) 😁uMandla ube esebuza ukuthi ukuphi uLebo (ubuza ngenhlonipho). 🗣 7. Uthi uLebo uye kubo kaMandla (uyamangala). 😱 8. UMandla uyagijima uyagoduka lapho efica khona uLebo (uyagijima). 🏃 9. Ukhona lapho ngakho uyajabula. 😆 10. Uyamanga. 🤗 Ungafaka okunye endabeni ukuze uyenze ihlabahlose kakhulu futhi unikeze izingane amanye amathuba okulingisa ngezenzo noma ukuzwakalisa imizwa yazo.

source: Why not do The Feelings Story activity? 🎭
zul: Kungani ungenzi umsebenzi Wendaba Yemizwa? 🎭

source: See what you need
zul: Bheka ukuthi yini oyidingayo

source: See how it works
zul: Bheka ukuthi kusebenza kanjani

source: Read the notes
zul: Funda amanothi

source: Back to menu
zul: Buyela kumenyu

source: Get ready for some acting. Lights, camera, action! 🎬 1. Tell the children the story, using puppets if you have them. 2. If not, use lots of actions, facial expressions and different voices to make it exciting. 3. Then ask the children to stand up. 4. Tell them the story again, one line at a time and ask the children to do the actions of the character Mandla. 5. Also encourage them to do facial expressions by saying, “What does a sad face look like?” or “Show me a happy face.” 6. Encourage them to take part and do any action they want to, so that they’re a part of the story.
zul: Ukulungela ukulingisa. Mawuqale umsebenzi! 🎬 1. Xoxela izingane izindaba, usebenzisa ama-puppet uma unawo. 2. Uma kungenjalo, sebenzisa iminyakazo eminingi, ulingise ngobuso ushintshashintshe nephimbo lakho ukuze uyenze ithathekise indaba. 3. Bese ucela izingane zisukume. 4. Phinda uzixoxele indaba, umugqa ngomugqa ngesikhathi bese ucela izingane zilinganise ngeminyakazo umlingiswa onguMandla. 5. Phinda uzikhuthaze ukuba zilinganise ngobuso ngokuthi, “Bunjani ubuso obudangele?” noma, “Ngikhombise ubuso obuneme.” 6. Zikhuthaze ukuba zizibandakanye futhi zenze noma yimiphi iminyakazo ezithanda ukuyenza, ukuze zibe yingxenye yendaba.

source: This game develops:
zul: Lo mdlalo uthuthukisa:

source: ✔️Social skills ✔️Emotional skills
zul: ✔️Amakhono okuphilisana emphakathini ✔️Amakhono emizwa

source: This game is all about imagination, so all you need is the children, and the story in the notes. But you can use puppets
zul: Lo mdlalo umayelana nokusabalalisa umqondo, ngakho konke okudingayo yizingane, nendaba esemanothini. Kodwa ungasebenzisa ama-puppet.
