Repository: Ari-Ramkilowan/po-files
Catalog: translations/SGroup11(Release (open))_Southern Sotho.po
Languages: sot

source: The little ones might struggle with the higher levels, but these questions are a great way to ease them into basic maths, and an education on money. 💸 Level 1 • What colours have you used? • What shape are the coins? • Which is the biggest coin? • Which is the smallest? • How many coins do we have? • What do we do with money? • Where should we keep our money? Level 2 • Who can show me a R1 coin? • Who can show me a R2 coin? • Who can show me a R5 coin? • How can you make R6? • How can you make R3 etc? • Etc Level 3 • Who can show me a 5 cent coin? • Who can show me a 10 cent coin? • Who can show me a 20 cent coin? • Who can show me a 50 cent coin? • How can you make 20 cents? • How can you make 10 cents? • Etc
sot: Bana ba banyenyane ba ka nna ba thatafallwa ke mehato e ka hodimo, empa dipotso tsena ke tsela e ntle ya ho ba qadisa ka mmetse wa motheo, le thuto e mabapi le tjhelete. 💸 Mohato wa 1 • O sebedisitse mebala efe? • Dikhoine di na le sebopeho sefe? • Ke khoine efe e kgolo ho di feta? • Ke efe e nyane ho di feta? • Re na le dikhoine tse kae? • Re etsa eng ka tjhelete? • Re lokela ho boloka tjhelete ya rona hokae? Mohato wa 2 • Ke mang ya ka mpontshang khoine ya R1? • Ke mang ya ka mpontshang khoine ya R2? • Ke mang ya ka mpontshang khoine ya R5? • O ka etsa R6 jwang? • O ka etsa R4 jwang, jj? Mohato wa 3 • Ke mang ya ka mpontshang khoine ya disente tse 5? • Ke mang ya ka mpontshang khoine ya disente tse 10? • Ke mang ya ka mpontshang khoine ya disente tse 20? • Ke mang ya ka mpontshang khoine ya disente tse 50? • O ka etsa 20 sente jwang? • O ka etsa 10 sente jwang?

source: Engage the children in a conversation about money while they go about this game. 1. Make sure each coin has been washed and is clean. 2. While you talk about money and what it’s used for, give each child a coin. 3. Ask them to look at their coin and tell you what they see. 4. Give them each a crayon and a piece of paper. 5. Show them that if you put the coin under the paper and then rub the crayon over it, you’ll see the picture of a coin. 6. Get them to share their items and explore different coins and colours.
sot: Qala puisano e mabapi le tjhelete ha bana ba ntse ba tswela pele ka papadi ena. 1. Netefatsa hore khoine ka nngwe e hlatswitswe mme e hlwekile. 2. Ha o ntse o bua ka tjhelete le hore e sebedisetswa eng, efa ngwana ka mong khoine. 3. Ere ba shebe dikhoine tsa bona mme ba o bolelle hore ba bona eng. 4. Efa e mong le e mong kerayone le sekgetjhana sa pampiri. 5. Ba bontshe hore ha o bea khoine ka tlasa pampiri mme o pikitla ka kerayone ka hodima yona, o tla bona setshwantsho sa khoine. 6. Ere ba abelane ka dintho tsa bona mme ba sibolle dikhoine tse fapaneng le mebala.

source: Back to menu
sot: Kgutlela ho menu

source: See what you need
sot: Sheba seo o se hlokang

source: See how it works
sot: Bona hore e sebetsa jwang

source: Read the notes
sot: Bala dinoutso

source: Remind the kids they’ll need to be very responsible when they’re each given one of the following: 1. A coin 2. A piece of paper 3. A crayon
sot: Hopotsa bana hore ba hloka ho ba le boikarabelo ha ngwana ka mong a fuwa e nngwe ya tse latelang: 1. Khoine 2. Sekgetjhana sa pampiri 3. Kerayone

source: This game develops:
sot: Papadi ena e ntshetsa pele:

source: It’s never too early to start learning about money with Money Rubs! 💰
sot: Ha ho nako e sa lokelang ho qala ho ithuta ka tjhelete mmoho le Money Rubs! 💰

source: ✔️Numbers , shapes & sizes ✔️ Arm & Hand Control
sot: ✔️Dinomoro, dibopeho le boholo ✔️ Taolo ya sephaka le letsoho
