Repository: Ari-Ramkilowan/po-files
Catalog: translations/SGroup5(Release (open))_Venda.po
Languages: ven

source: Some little ones might get stuck, but that’s fine. Here are some questions to help them talk about what’s happening and learn from it: 💬 Level 1 (simple structure) • Who can remember the pattern? • Which colour was on the bottom? • Which colour was on the top? Level 2 (more complex structure) • Who can remember the pattern? • Which colour was on the bottom? • Which colour was on the top? • Which colours will you use to repeat the pattern? • What does the pattern look like? Level 3 (even more complex structure) • Who can remember the pattern? • Which colours will you use to repeat the pattern? • What does the pattern look like? • How did you remember? • What else can you build with the bricks?
ven: Vhaṅwe vhana vhaṱuku vha nga kundelwa, na zwenezwo zwo luga. Idzi ndi dziṅwe dza mbudziso dzine dza nga vha thusa u amba nga ha zwine zwa khou itea na u guda nga hazwo: 💬 Ḽiga 1 • Ndi nnyi ane a kha ḓi humbula phetheni? • Ndi ufhio muvhala we wa vha u nga fhasi? • Ndi ufhio muvhala we wa vha u nga nṱha? Ḽiga 2 • Ndi nnyi ane a kha ḓi humbula phetheni? • Ndi ufhio muvhala we wa vha u nga fhasi? • Ndi ufhio muvhala we wa vha u nga nṱha? • Ndi ifhio mivhala ine na nga i shumisa u dovholola phetheni? • Phetheni i fana na mini? Ḽiga 3 • Ndi nnyi ane a kha ḓi humbula phetheni? • Ndi mivhala ifhio ine na nga i shumisa u dovholola phetheni? • Phetheni i fana na mini? • No zwi humbulisa hani? • Ndi mini tshiṅwe tshine na nga tshifhaṱa/tshivhumba nga zwibuḽoko izwi?

source: See what you need
ven: Zwine vha ṱoḓa

source: See how it works
ven: Zwi shumisa hani

source: Read the notes
ven: Kha vha vhale notsi

source: Back to menu
ven: Kha vha humele murahu kha zwirengomu (Menu)

source: It’s time to test that memory with a game called Lego — Can You Remember? 🏅
ven: Ndi tshifhinga tsha u linga muhumbulo nga mutambo une wa vhidzwa LEGO — Ni a Kona u Humbula? 🏅

source: The aim is to see if the kids can remember what you did and repeat it. It helps them learn to pay attention. 🧐 1. Build a pattern of 2 bricks (e.g. red then yellow). 2. Show children for 5 seconds and then ask them to remember. 3. Hide the bricks and ask them to see if they can remember the pattern. 4. Repeat with another pattern using different colours or a different order. 5. Each time add more bricks. 6. Use fewer bricks (simple structure) with young children (ages 2 — 4). 7. Use more bricks with older children (ages 4 — 8). 8. Get the children to build patterns for everyone to copy. 9. Talk to the children about shapes, colours, or the number of bricks.
ven: Ndivho ndi u vhona arali vhana vha tshi kha ḓi ḓivha zwe vha vha gudisa na u kona u zwi dovholola. Zwi vha thusa u guda u thetshelesa nga vhuronwane. 🧐 1. Kha vha fhaṱe phetheni ya zwibuḽoko zwivhili (2) (sa tsumbo, tshitswuku vha kone u tevhela nga yeḽo/tshitopana). 2. Kha vha sumbedze vhana lwa sekondo dza (5) vha kone u vha vhudza uri vha humbule. 3. Kha vha dzumbe tshibuḽoko vha vha vhudzise arali vha tshi kha ḓi humbula phetheni. 4. Kha vha dovholole nga iṅwe phetheni vha tshi khou shumisa muṅwe muvhala kana nga nḓila/thevhekano yo fhambanaho. 5. Tshifhinga tshiṅwe na tshiṅwe vha nga engedza zwiṅwe zwibuḽoko. 6. Kha vha shumise zwibuḽoko zwi si gathi (tshivhumbeo tshi sa konḓi) na vhana vhaṱuku (miṅwaha ya 2-4). 7. Kha vha engedze zwiṅwe zwibuḽoko kha vhaṅwe vhana (miṅwaha ya 4-8). 8. Kha vha ite uri vhana vha fhaṱe phetheni uri muṅwe na muṅwe a kopele. 9. Kha vha ambe na vhana nga ha tshivhumbeo, mivhala, kana tshivhalo tsha zwibuḽoko.

source: This game develops:
ven: Mutambo uyu u bveledza:

source: ✔️Numbers , Shapes & Sizes ✔️Skills for Learning
ven: ✔️Nomboro, zwivhumbeo na saizi ✔️Vhukoni ha u guda

source: Get as many Lego, Duplo or building blocks as you have. Each child is going to need the same amount as you.
ven: Kha vha kuvhanganye LEGO, DUPLO, kana zwibuḽoko zwine vha vha nazwo. Ṅwana muṅwe na muṅwe u ḓo ṱoḓa tshivhalo tshi fanaho na tshavho.
