Repository: Ari-Ramkilowan/po-files
Catalog: translations/SGroup20(Release (open))_Zulu.po
Languages: zul

source: See how it works
zul: Bheka ukuthi kusebenza kanjani

source: Animal Pond
zul: Uma ubungakazixoxeli izingane indaba namhlanje, i-Animal Pond kungaba umsebenzi omuhle kakhulu. 🐘🐂🐪

source: Read the notes
zul: Funda amanothi

source: Back to menu
zul: Buyela kumenyu

source: See what you need
zul: Bheka ukuthi yini oyidingayo

source: Let the children build on their brilliant stories by asking them these questions: Level 1 • What animal do you have? • Where does he want to go? • How will you help him? • What will you build? • How will you build it? • How will the animal cross? • Where is he going now? Level 2 • How does your goat feel? • What does he feel that way? • What will make him feel scared? • What will make him feel safe and happy? Level 3 • Tell me the story of your little goat.
zul: Vumela izingane zakhele ezindabeni zazo ezithathekisayo ngokuzibuza le mibuzo: Izinga 1 • Yisiphi isilwane onaso? • Sifuna ukuya kuphi? • Uzosisiza kanjani? • Uzokwakhani? • Uzoyakha kanjani? • Isilwane sizowela kanjani? • Uya kuphi manje? Izinga 2 • Imbuzi yakho izizwa kanjani? • Kungani izizwa ngaleyo ndlela? • Yini eyoyenza izizwe yesaba? • Yini eyoyenza izizwe iphephile futhi ijabule? Izinga 3 • Ngitshele indaba yembuzi yakho encane.

source: This game develops:
zul: Lo mdlalo uthuthukisa:

source: ✔️Skills for Learning ✔️Exploring & Finding Out
zul: ✔️Amakhono okufunda ✔️Amakhono okufunafuna

source: So many benefits, so few items needed: 1. Duplo LEGO blocks 2. Plastic animals 3. Blue paper 4. Scissors
zul: Izinzuzo ezingaka, kodwa kumbalwa kakhulu okudingekayo: 1. Amabhuloki e-DUPLO LEGO 2. Izilwane zepulastiki 3. Iphepha eliluhlaza okwesibhakabhaka 4. Isikele

source: How does it work? 1. Cut a circle out of the blue paper and use it as the pond. 2. Tell the story about a little animal who is trying to get across the pond to see its mommy. 3. It can’t swim and it’s too far to walk around the pond. 4. Divide the children into pairs and give them some duplo blocks. 5. Ask them to build a bridge for the little animal. 6. Once they have finished, ask them to show you how their animal crosses the bridge 7. Get them to tell you the story in their own way
zul: Kwenziwa njani? 1. Sika isiyingi ephepheni elihlaza okwesibhakabhaka bese ulisebenzisa njengechibi. 2. Xoxa indaba mayelana nesilwane esincane esizama ukuwelela ngaphesheya kwechibi ukuze sibone unina. 3. Asikwazi ukubhukuda futhi kukude kakhulu ukuhambe sijikeleze ichibi. 4. Hlukanisa izingane zibe ngazimbili bese uzinika amanye amabhuloki e-DUPLO. 5. Zicele zakhe ibhuloho lesilwane esincane. 6. Uma seziqedile, zicele ukuba zikubonise ukuthi isilwane sazo siwela kanjani ibhuloho 7. Zicele zikutshele indaba ngendlela yazo.
