Repository: Ari-Ramkilowan/po-files
Catalog: translations/SGroup8(Release (open))_Zulu.po
Languages: zul

source: Another great arts and crafts activity is Making Faces 😃🙃🤪😜🤩😎😠🤗🤐😴🤕🤒🤠🤯😍
zul: Amanye amakhono obuciko bezandla umdlalo Wokwenza Ubuso 😃🙃🤪😜🤩😎😠🤗🤐😴🤕🤒🤠🤯😍

source: But I don’t mean pulling faces, I mean making them with: 1. 1 piece of paper per child 2. Wool 3. Scissors and glue For younger children: 1. Cut out 1 pair of eyes per child. 2. Cut out 1 pair of ears per child. 3. Cut out nose per child. 4. Cut out mouth per child. For older children: 1. Pictures where they can cut out the eyes, nose, mouth etc.
zul: Angisho ukushintsha ubuso, ngisho ukwenza ubuso ngalokhu: 1. Ucezu olu-1 lwephepha ingane ngayinye 2. Iwuli 3. Izikele 4. I-I-glue Izingane ezisencane: 1. Sika ipheya eli-1 lamehlo ingane ngayinye. 2. Sika ipheya eli-1 lezindlebe ingane ngayinye. 3. Sika ikhala ingane ngayinye. 4. Sika umlomo ingane ngayinye. Okwezingane ezindadlana: 1. Izithombe lapho bengasika khona amehlo, ikhala, umlomo njll.

source: Read the notes
zul: Funda amanothi

source: See what you need
zul: Bheka ukuthi yini oyidingayo

source: See how it works
zul: Bheka ukuthi kusebenza kanjani

source: Back to menu
zul: Buyela kumenyu

source: This game develops:
zul: Lo mdlalo uthuthukisa:

source: ✔️Arm & Hand Control ✔️Talking & Understanding
zul: ✔️Ikhono lokulawula izingalo nezandla ✔️Ukukhuluma nokuqonda

source: Once you have everything you need: 1. Give each child a piece of paper and cut-out pictures of noses, eyes, ears and mouths to give to younger children. 2. Give pictures of faces to older children. 3. Ask them to use the pictures to make a face. 4. Talk about the senses as you do it (smell, taste, seeing, hearing etc.). 5. Get them to stick their pictures down when they have made their faces. 6. Give them each some wool and ask them to turn it into hair. 7. They can cut and stick the materials in any way they want to. 8. Look at the faces together and talk about them to help the kids learn. There are examples of what to ask in the notes. 9. Cut the faces out and attach them to a stick. 10. You can use these to tell stories.
zul: Uma unayo yonke into oyidingayo: 1. Nikeza ingane ngayinye ucezu lwephepha bese usika izithombe zamakhala, amehlo, nezindlebe nemilomo ozokunika izingane ezisencane. 2. Nikeza izingane ezisencane izithombe zobuso. 3. Bacele basebenzise izithombe ukwenza ubuso. 4. Khuluma ngezinzwa ngenkathi ukwenza lokho (ukuhogela, ukunambitha, ukubona, ukuzwa, ukuthinta njll.). 5. Batshele banamathelise izithombe phansi uma sebenze ubuso babo. 6. Banikeze ngamunye iwuli bese ubatshela bayenze izinwele. 7. Bangasika bese benamathelisa nganoma iyiphi indlela abafuna ngayo. 8. Buka ubuso ndawonye futhi ukhulume ngabo ukuze usize izingane zifunde. Kunezibonelo zalokho ongakubuza emanothini. 9. Sika ubuso bese ubunamathelisa endukwini. 10. Ungasebenzisa lezi ukuxoxa izindaba.

source: As promised, here are some questions: ❓ Level 1 • What do we use our noses for? • What do we use our eyes for? • And our ears? • Is your face happy or sad? • What kind of hair will you make? • What is the name of this face? Level 2 • What is your favourite taste? • What do you like to smell? • What can you hear right now? • What can you see with your eyes if you look left? • What can you see with your eyes if you look to the right? Level 3 Allow older children to make up a story - for example: • Who does your face belong to? • Mine is a gogo • What do you want to say to gogo? • Gogo asks: “What you would like for supper?” • Gogo asks if you will help her make supper. • What shall we do first? You can even act the story out if you like.
zul: Njengoba bekuthenjisiwe, nansi eminye imibuzo: Izinga 1 • Siwasebenzisela ukwenzani amakhala? • Siwasebenzisela ukwenzani amehlo? • Izindlebe zethu zona? • Ingabe ubuso bakho bujabule noma budangele? • Hlobo luni lwezinwele ozolwenza? • Yini igama lalobu buso? Izinga 2 • Yikuphi ukunambitheka okuyintandokazi yakho? • Yini othanda ukuyihogela? • Yini oyizwayo njengamanje? • Yini oyibonayo ngamehlo akho uma ubuka kwesokunxele? • Yini oyibonayo ngamehlo akho uma ubuka kwesokudla? Izinga 3 Vumela izingane ezindadlana ziqambe indaba – isibonelo: • Ubuso bakho bungobukabani? • Obami obukagogo. • Yini ofuna ukuyitshela ugogo? • Ugogo uyabuza: “Yini ongathanda ukuyidla ngesidlo sakusihlwa?” • Ugogo uyabuza ukuthi uzomsiza na ukwenza isidlo sakusihlwa. • Yini esizoyenza kuqala? Ningaze niyilingise indaba uma nithanda.
