Repository: Ari-Ramkilowan/po-files
Catalog: translations/SGroup11(Release (open))_South Ndebele.po
Languages: nbl

source: The little ones might struggle with the higher levels, but these questions are a great way to ease them into basic maths, and an education on money. 💸 Level 1 • What colours have you used? • What shape are the coins? • Which is the biggest coin? • Which is the smallest? • How many coins do we have? • What do we do with money? • Where should we keep our money? Level 2 • Who can show me a R1 coin? • Who can show me a R2 coin? • Who can show me a R5 coin? • How can you make R6? • How can you make R3 etc? • Etc Level 3 • Who can show me a 5 cent coin? • Who can show me a 10 cent coin? • Who can show me a 20 cent coin? • Who can show me a 50 cent coin? • How can you make 20 cents? • How can you make 10 cents? • Etc
nbl: Abancane bangatlhaga namaleveli aphakeme kodwana imibuzo le indlela elula yokubasiza ezibalweni zokuthoma Awakufunda ngemali. 💸 Ileveli yoku - 1 • Ngimiphi imibala oyisebenzisile? • Ihlamvu ijame bunjani? • Ngiyiphi ihlamvu ekulu? • Ngiyiphi ihlamvu encane? • Zingaki iinhlamvu esinazo? • Senzani ngemali? • Imali yethu kufuze siyibeke kuphi? Ileveli Iyei - 2 • Ngubani ongangitjengisa ihhamvu ye - R1? • Ngubani ongangitjengisa ihlamvu ye - R2? • Ngubani ongangitjengisa ihlamvu ye - R5? • I - R6 ungayenza njani? • I - R3 ungayenza njani, njll? Ileveli Iyei - 3 • Ngubani ongangitjengisa ihlamvu yamasente ama - 5? • Ngubani ongangitjengisa ihlamvu yamasente ama - 10? • Ngubani ongangitjengisa ihlamvu yamasente ama - 20? • Ngubani ongangitjengisa ihlamvu yamasente ama - 50? • Ungawenza njani amasente ama - 20? • Ungawenza njani amasente ama - 10?

source: Engage the children in a conversation about money while they go about this game. 1. Make sure each coin has been washed and is clean. 2. While you talk about money and what it’s used for, give each child a coin. 3. Ask them to look at their coin and tell you what they see. 4. Give them each a crayon and a piece of paper. 5. Show them that if you put the coin under the paper and then rub the crayon over it, you’ll see the picture of a coin. 6. Get them to share their items and explore different coins and colours.
nbl: Thoma ikulumiswaAwa ngemandla abantwana nabenza umdlalo lo. 1.Qininisekisa ukuthi yoke ihlamvu ihlanziwe begodu ihlanzekile. 2.Nawukhuluma ngemali Awakuthi yenzani, nikeza umntwana ngamunye ihlamvu. 3.Babawe bona baqale ihlamvu batjho Awakuthi babonani. 4.Nikela omunye Awamunye ikhrayoni nesiquntu sephepha. 5.Batjengise ukuthi nawubeka ihlamvu ngaphasi kwephepha bese utlikitla ikhrayoni ngaphezulu, uzakubona isitombe sehlamvu leyo. 6.Thana babelane izinto zabo bese babona ezinye iinhlamvu nemibala yazo.

source: Back to menu
nbl: Buyela erhelweni

source: See what you need
nbl: Bona ukuthi utlhoga ini

source: See how it works
nbl: Bona ukuthi isebenza bunjani

source: Read the notes
nbl: Funda amaAwathi

source: Remind the kids they’ll need to be very responsible when they’re each given one of the following: 1. A coin 2. A piece of paper 3. A crayon
nbl: Khumbuza abantwana ukuthi bathloga ukuba Awakuziphendulela nabanikezwe lokhu ngamumunye: 1.Ihlamvu yemali 2.Isiquntu sephepha 3.Ikhrayoni

source: This game develops:
nbl: Umdlalo lo uthuthukisa:

source: It’s never too early to start learning about money with Money Rubs! 💰
nbl: Angeze wathi kumsinya ukufunda ngemali nge - Money Rubs! 💰

source: ✔️Numbers , shapes & sizes ✔️ Arm & Hand Control
nbl: ✔️IiAwambolo, ubujamo nesayizi ✔️ Ukulawula umkhoAwa nesandla
