Repository: Ari-Ramkilowan/po-files
Catalog: translations/SGroup18(Release (open))_Venda.po
Languages: ven

source: Need some inspiration? Keep the game going with questions like these: Level 1 • Look around and choose an item that everyone can see. • Don’t tell the others what it is. • Then say “I spy with my little eye, something that is green.” • Let the children guess what it is by calling out all the green things they see. • Try not to make it too difficult. Level 2 • Then say “I spy with my little eye, something beginning with ‘w’.” • Use the sound “w”, not the letter. • Let the kids guess the item. • Give each child a turn to take a guess. Level 3 • Then say “I spy with my little eye, something beginning with ‘ch’.” • Use the sound “ch”, not the letter. • Let the kids guess the item. • Give each child a turn to take a guess.
ven: Vha khou ṱoḓa ṱhuṱhuwedzo? Kha vha ise mutambo phanḓa nga mbudziso dzi fanaho na idzi: Ḽiga 1 • Sedzani u mona navho vha nange tshithu tshine muthu muṅwe na muṅwe a kona u tshi vhona. • Ni songo vhudza vhaṅwe uri ndi mini. • Ni kone u amba uri “Ndi Ṱholi nga maṱo anga maṱukuṱuku, tshiṅwe tshithu tshidala.” • Kha vha litshe vhana vha humbulele nga u amba zwoṱhe zwithu zwine zwa vha zwidala kha zwine vha khou zwi vhona. • Kha vha lingedze uri zwi sa tu tou konḓa. Ḽiga 2 • Vha kone u amba uri “Ndi Ṱholi nga maṱo anga maṱukuṱuku, tshithu tshine tsha thoma nga ‘w’.” • Kha vha shumise muungo “w”, hu si ḽeḓere. • Kha vha litshe vhana vha humbulele uri ndi mini. • Kha vha ṋee ṅwana muṅwe na muṅwe tshikhala tsha u humbulela. Ḽiga 3 • Vha ambe uri “Ndi Ṱholi nga maṱo anga maṱukuṱuku, tshithu tshine tsha thoma nga ‘tsh’.” • Kha vha shumise muungo ‘tsh’ hu si ḽeḓere. • Kha vha litshe vhana vha humbulele uri ndi mini. • Kha vha tendele vhana u sielisana kha u humbulela.

source: We’re taking I Spy to the next level with some eye glasses. Here’s what you’ll need 👓: • 2 used toilet rolls per child. • String. • Scissors. • 2 sticks per child. • Cellotape.
ven: Ri khou tamba ndi Ṱholi kha ḽiṅwe sia hu tea u vha hu na mangilasi a maṱo. Zwine vha ṱoḓa 👓: • Rolo dza thishu dzo no shumaho mbili (2) nga ṅwana • Thambo • zwigero • Zwitanda zwivhili (2) nga ṅwana • Seḽotheiphi

source: Read the notes
ven: Kha vha vhale notsi

source: Back to menu
ven: Kha vha humele murahu kha zwirengomu

source: You’ll be showing these cool kids how to make a pair of glasses.😎 1. Cut the toilet roll into 2 rings and tie them together to make glasses 2. Attach the sticks to the sides of the glasses to make the ‘arms’ of the glasses. 3. Support the younger kids. 4. Encourage the older ones to this on their own. 5. Ask the children to put their glasses on and talk about what glasses do. 6. Play I Spy: Find something in the room that everyone can see, for example, a table. 7. Say: “I Spy with my little eye, something beginning with ‘t’ (sound)” 8. Let each child have a turn guessing. 9. Walk around the room and tell them what you see through your glasses. 10. Get them to walk with you, glasses on!
ven: Vha ḓo vha vha tshi khou sumbedza vhana uri vha itisa hani mangilasi.😎 1. Kha vha gere roḽo ya thishu nga vhukati zwi vhe riingi mbili vha dzi vhofhekanye dzi vhe mangilasi. 2. Kha vha vhofhelele nga matungo a mangilasi ‘zwanda’ zwa mangilasi. 3. Kha vha thuse vhana vhaṱuku. 4. Kha vha ṱuṱuwedze vhana vhahulwane vha tou ḓiitela nga vhone vhaṋe. 5. Kha vha vhudze vhana vha ambare mangilasi avho vha ambe nga ha zwine mangilasi a ita. 6. Kha vha tambe ndi Ṱholi. Kha vha wane tshithu tshiṅwe na tshiṅwe afho kiḽasini tshine muṅwe na muṅwe a kona u tshi vhona, sa tsumbo, ṱafula. 7. Kha vha ambe uri: “Ndi Ṱholi nga maṱo anga maṱukuṱuku, tshiṅwe tshine tsha thoma nga ‘ṱh’ (mubvumo)” 8. Kha vha ite uri ṅwana muṅwe na muṅwe a humbulele. 9. Kha vha mone na kiḽasi vha vha vhudze zwine vha khou zwi vhona nga mangilasi avho. 10. Kha vha tshimbile navho, vho ambara mangilasi!

source: See what you need
ven: Zwine vha ṱoḓa

source: See how it works
ven: Zwi shumisa hani

source: We put a spin on the classic game, I Spy. 🔍
ven: Ri khou fhirela kha mitambo ya kale, Ndi ṱholi/tshipai. 🔍

source: This game develops:
ven: Mutambo u bveledza:

source: ✔️Social ✔️Early Reading & Writing
ven: ✔️Zwa matshilisano ✔️U ṱavhanya u kona u vhala na u ṅwala
