Repository: Ari-Ramkilowan/po-files
Catalog: translations/SGroup14(Release (open))_Tswana.po
Languages: tsn

source: Read the notes
tsn: Bala dintlha

source: See what you need
tsn: Bona se o se tlhokang

source: See how it works
tsn: Bona kafa o tshamekiwang ka teng

source: Back to menu
tsn: Boela kwa mmenyung

source: While their creative juices are flowing, get their brains going by asking them some questions. Level 1 • What colour is this? • What shape is this • How many colours can you see? • Where will you stick this? Level 2 • How many pieces do you have? • What pattern is this? Level 3 • How will you use these pieces to make a picture? • What is your picture? • Can you tell me about it? • Can you make your name?
tsn: Fa dijuse tsa bone tsa maitirelo di ntse di elela, dira gore ba akanye ka go ba botsa dipotso dingwe. Maemo 1 • Selo se se mmala ofe? • Se ke popego mang? • Ke mebala e le kae e o kgonang go e bona? • O ka kgomaretsa se fa kae? Maemo 2 • O na le ditoki di le kae? • Se ke phethene e fe? Maemo 3 • O ka dirisa ditoki tse jang go dira setshwantsho? • Setshwantsho sa gago ke eng? • A o ka mpolelela ka sone? • A o ka dira leina la gago?

source: ✔️Arm & Hand Control ✔️Numbers , Shapes & Sizes
tsn: ✔️Taolo ya lebogo le seatla ✔️Dipalo, dipopego le disaese

source: Now it’s time to turn trash into treasure. 1. Make sure the chip packets are clean. 2. Ask the kids to share the chip packets between themselves. 3. Then ask them to cut or tear up chip packets into small pieces or shapes. 4. Get them to stick these pieces of chip packet onto the paper. 5. Encourage creativity as they make their pictures. 6. Talk about shapes, sizes, colour, texture, patterns, etc. 7. Help them to cut and stick as is needed. 8. Older children can even make spell their names out with the pieces.
tsn: Jaanong ke nako ya go fetola matlakala go a dira khumo. 1. Tlhomamisa gore dipakete tsa ditšhipisi di phepa. 2. Kopa bana gore ba abelane le ba bangwe. 3. O bo o ba kopa gore ba sege kgotsa ba gagole dipakete go di dira ditokinyana kgotsa dipopego. 4. Dira gore ba kgomaretse ditoki tse tsa dipakete tsa ditšhipisi mo pampiring. 5. Kgothaletsa gore ba itlhamele dilo jaaka ba ntse ba dira ditshwantsho. 6. Bua ka dipopego, disaense, mmala, tshwarego, diphethene, jalo jalo. 7. Ba thuse gore ba sege le go kgomaretsa jaaka go tlhokega. 8. Ebile bana ba bagolwane ba ka peleta maina a bone ka ditokinyana tseo.

source: Use Chip Packet Fun to teach the kids about not only making art, but recycling too.🥔
tsn: Dirisa Motshameko o o Monate wa Dipakete tsa Ditšhipisi go ruta bana kaga go sa dirise botsweretshi, ka go dira dilo tse dingwe ka tse di latlhilweng.🥔

source: If there’s litter in the area, why not get the kids to collect it and throw it away while they look for chip packets? This is what you’ll for this game: • A clean chip packet per child • Piece of paper per child • Glue and scissors
tsn: Fa e le gore go na le matlakala mo lefelong leo, goreng o sa dire gore bana ba a kokoanye le go a latlha fa ba ntse ba batla dipakete tsa ditšhipisi. Tse ke tse o tla di tlhokang mo motshamekong ono: • Pakete e e phepa ya ditshipisi ngwana mongwe le mongwe • Pampiri ngwana mongwe le mongwe • Tloluo • Sekere

source: This game develops:
tsn: Motshameko o o a tswelela:
