Repository: Ari-Ramkilowan/po-files
Catalog: translations/SGroup12(Release (open))_Xhosa.po
Languages: xho

source: It’s time for these budding entrepreneurs to learn about the value of money. 1. Give each child their coin rubbings from the previous activity. 2. Ask them to cut out the coins. 3. Help those that need it. 4. Help them to fold over their piece of paper to make a purse. 5. Ask the children to put their coins into their new purse for safekeeping. 6. Set up a shop. 7. Talk about the items in your shop as you set up. 8. Have words under your items. Eg, milk, bread, cereal, etc. 9. Ask each child to come to your shop and buy something. 10. When they give you their money, tell them what they can buy with it. 11. Talk as you play and ask questions to help the children learn. 12. For the older children, ask them for money and give them change.
xho: Lixesha lokuba abahlotyana beshishini bafunde malunga nomgangatho wemali. 1. Nika umntwana ngamnye iibrabhings zemali ezivela kwimisebenzi yangaphambili. 2. Bucele basike ikhoyini. 3. Nceda abo bayidingayo. 4. Bancede ukuba basonge ipisi yephepha ukwenza isikhwama. 5. Buza abantwana ukuba bafake iimali zabo kwiinkokhelo zabo ezintsha. 6. Misela ivenkile. 7. Thetha malunga nezinto ezithengayo kwithengisi njengoko usukile. 8. Yibanamagama phantsi kwezinto zakho.Umzekelo, ubisi, isonka, isiriyeli, njl njl. 9. Buza ngamnye umntwana ukuba eze kwintengiso yakho aze athenge into. 10 Xa bekunika imali yabo, xelele oko bangayithenga khona. 11. Thetha njengoko udlala kwaye ubuze imibuzo ukuze uncede abantwana bafunde. 12. Kubantwana abadala bacele bahlawulele into kwaye babanike itshintshi.

source: See what you need
xho: Bona okudingayo

source: See how it works
xho: Jonga ukuba isebenza njani

source: Read the notes
xho: Funda amanqaku

source: Back to menu
xho: Buyela kwimenyu

source: Spending money is easy, it’s saving money that’s hard. Try remind the children how important saving is while you talk to them. 🏦 Level 1 • Where do you keep your money? • What do you want to buy at my shop? • What are you going to cook with these things…? • What else would you like to buy? Level 2 • How much money have you got? • That will cost… Level 3 • Have you got any money left? • Would you like to use that money to buy something else? • Do you have enough? • Or would you rather save it for next time? • What sounds does milk start with? (mmmm) • What sound does fish start with? (ffff)
xho: Ukuchitha imali kulula, kukugcina imali okunzima. Zama ukukhumbuza abantwana ngokugcina imali ngoku uthetha nabo. 🏦 Umgangatho 1 • Ingaba uyigcinaphi imali yakho? • Ufuna ukuthenga ntoni kwivenkile yam? • Yintoni oya kupheka ngalezi zinto? • Yintoni enye ongathanda ukuyithenga? Umgangatho 2 • Ingaba wawunamalini? • Leyo eyakubiza ... Umgangatho 3 • Ingaba unayo imali eshiyekile? • Ungathanda ukusebenzisa loo mali ukuthenga enye into? • Unayo ngokwaneleyo? • Okanye ngaba ungayilondoloza ixesha elizayo? • Ziziphi izandi ubisi eliqala ngalo (mmmm) • Ingaba sesiphi isandi intlanzi eqlala ngaso (ffff)

source: Let’s put the Money Rubs the children did to good use with Spending Coins!💰
xho: Masithathe ezi zinto zemali abantwana abazenzile malunga nokuChitha imli eziNkonzo! 💰

source: This game develops:
xho: Lo mdlalo uphuhlisa:

source: ✔️Talking & Understanding ✔️Social
xho: ✔️Ukuthetha kunye nokuqonda ✔️Izakhono zasekuhlaleni

source: Now that the children have created their own money during the previous activity, it’s time to give them something to spend it on. You’ll need: 1. Coin drawings from the previous Small Group Activity. 2. Scissors. 3. A piece of paper for each child to make a purse. 4. Empty food containers such as cereal boxes, milk bottles, egg boxes, etc. Have enough for each child to “buy” a few items. 🍞🥔🥚
xho: Ngoku ukuba abantwana baye badala imali yabo ngexesha lomsebenzi wangaphambili, lixesha lokuba banike into yokuyisebenzisa. Uza kudinga: 1. Yenza imidwebo evela kuMaqela aMancinci aGqithileyo oMsebenzi. 2. Izikere. 3. Icandelo lephepha kumntwana ngamnye ukuba enze isikhwama. 4. Iziqulathi zokutya ezingenato ezifana neqokobhe lesiriyeli, iqokbhe yobisi, iqokobhe lamaqanda, njl njl. Yibanokoneleyo kumntwana ngamnye "ukuthenga" izinto ezimbalwa. . 🍞🥔🥚
