Repository: Ari-Ramkilowan/po-files
Catalog: translations/SGroup18(Release (open))_Southern Sotho.po
Languages: sot

source: Need some inspiration? Keep the game going with questions like these: Level 1 • Look around and choose an item that everyone can see. • Don’t tell the others what it is. • Then say “I spy with my little eye, something that is green.” • Let the children guess what it is by calling out all the green things they see. • Try not to make it too difficult. Level 2 • Then say “I spy with my little eye, something beginning with ‘w’.” • Use the sound “w”, not the letter. • Let the kids guess the item. • Give each child a turn to take a guess. Level 3 • Then say “I spy with my little eye, something beginning with ‘ch’.” • Use the sound “ch”, not the letter. • Let the kids guess the item. • Give each child a turn to take a guess.
sot: Na o batla kgothatso? Ntshetsa papadi pele ka ho botsa dipotso tse kang tsena: Mohato wa 1 • Sheba hohle mme o kgethe ntho eo bohle ba ka e bonang. • Se ke wa bolella ba bang hore ke eng. • Jwale ere “Ke bona ka leihlwana la ka, ntho e tala.” • Ere bana ba nohe hore ke eng ka ho bitsa dintho tsohle tse tala tseo ba di bonang. • O leke hore o se e thatafatse. Mohato wa 2 • Jwale ere “Ke bona ka leihlwana la ka, ntho e qalang ka ‘f’.” • Sebedisa modumo wa “f”, e seng tlhaku. • Ere bana ba nohe ntho eo. • Efa ngwana ka mong sebaka sa ho noha. Mohato wa 3 • Jwale ere “Ke bona ka leihlwana la ka, ntho e qalang ka ‘s’.” • Sebedisa modumo ona “s”, e seng tlhaku. • Ere bana ba nohe ntho eo. • Nea ngwana ka mong sebaka sa ho noha.

source: We’re taking I Spy to the next level with some eye glasses. Here’s what you’ll need 👓: • 2 used toilet rolls per child. • String. • Scissors. • 2 sticks per child. • Cellotape.
sot: Re nyollela I Spy mohatong o latelang ka digalase tsa mahlo. Tsena ke tseo o tlang ho di hloka 👓: • Ditshwari tse pedi tsa pampiri ya ntlwana bakeng sa ngwana ka mong • Kgwele • Dikere • Dithupa tse 2 bakeng sa ngwana ka mong • Theipi e kgomaretsang

source: Read the notes
sot: Bala dinoutso

source: Back to menu
sot: Kgutlela ho menu

source: You’ll be showing these cool kids how to make a pair of glasses.😎 1. Cut the toilet roll into 2 rings and tie them together to make glasses 2. Attach the sticks to the sides of the glasses to make the ‘arms’ of the glasses. 3. Support the younger kids. 4. Encourage the older ones to this on their own. 5. Ask the children to put their glasses on and talk about what glasses do. 6. Play I Spy: Find something in the room that everyone can see, for example, a table. 7. Say: “I Spy with my little eye, something beginning with ‘t’ (sound)” 8. Let each child have a turn guessing. 9. Walk around the room and tell them what you see through your glasses. 10. Get them to walk with you, glasses on!
sot: O tla be o bontsha bana bana ba batle kamoo ho etswang para ya digalase.😎 1. Seha rolo ya pampiri ya ntlwana o etse diring tse 2 mme o di tlamelle hammoho ho etsa digalase. 2. Kgomaretsa dithupa ho mahlakore a digalase bakeng saho etsa ‘matsoho’ a digalase. 3. Tshehetsa bana ba banyenyane. 4. Kgothaletsa ba baholwanyane ho iketsetsa ka bobona. 5. Kopa bana ho rwala digalase tsa bona mme le bue ka seo digalase di se etsang. 6. Bapalang I Spy: Batla ho hong ka phaposing hoo bohle ba ka ho bonang, ho etsa mohlala, tafole. 7. Ere: “Ke bona ka leihlwana la ka, ntho e nngwe e qalang ka ‘t’ (modumo)” 8. Efa ngwana ka ong sebaka sa ho noha. 9. Tsamaya ka phaposing o ntse o ba bolella seo o se bonang ka digalase tsa hao. 10. Ere ba tsamaye le wena, ba rwetse digalase!

source: See what you need
sot: Sheba seo o se hlokang

source: See how it works
sot: Bona hore e sebetsa jwang

source: We put a spin on the classic game, I Spy. 🔍
sot: Re fetola mawa papading e tlwaelehileng, I Spy. 🔍

source: This game develops:
sot: Papadi ena e ntshetsa pele:

source: ✔️Social ✔️Early Reading & Writing
sot: ✔️Phedisano ✔️Ho bala le ho ngola ho tloha bonyaneng
