Repository: Ari-Ramkilowan/po-files
Catalog: translations/SGroup16(Release (open))_Afrikaans.po
Languages: afr

source: See how it works
afr: Kyk hoe dit werk

source: Read the notes
afr: Lees die notas

source: Back to menu
afr: Terug na spyskaart

source: See what you need
afr: Kyk wat jy nodig het

source: Right now could be the perfect time to teach the children about the past with Dinosaur Footprints. 🦖
afr: Nou is die ideale tyd om die kinders oor die verlede te leer met behulp van Dinosourus-voetspore (Dinosaur Footprints). 🦖

source: While the children work with their hands, keep their minds busy with some questions like these: Level 1 • What do you know about dinosaurs? • What sounds do dinosaurs make? • How many footprints will you make? • How many toes does this dinosaur have? • Should we walk around the room pretending we are dinosaurs? Level 2 • How big were dinosaurs? • When did dinosaurs live? (The answer can be something like: a long, long time ago)
afr: Terwyl die kinders met hul hande werk, hou hul denke besig met ’n paar vrae soos hierdie: Vlak 1 • Wat weet jy van dinosourusse? • Watter geluide maak dinosourusse? • Hoeveel voetspore sal jy maak? • Hoeveel tone het hierdie dinosourus? • Moet ons deur die kamer loop en maak asof ons dinosourusse is? Vlak 2 • Hoe groot was dinosourusse? • Wanneer het dinosourusse gelewe? (Die antwoord kan iets wees soos: baie, baie lank gelede.)

source: Before you get going on the activity, talk to the kids about dinosaurs. 🦕 1. Give each child a cut out dinosaur footprint. 2. Dip the foot in paint. 3. Press the foot onto clean paper and make a print. 4. Get children to do their own, and make a few prints on the paper. 5. They can stick leaves or grass onto the picture too. 6. Put glue around the prints and sprinkle sand on it. 7. Allow it to dry.
afr: Voordat jy met die aktiwiteit begin, praat met die kinders oor dinosourusse. 🦕 1. Gee vir elke kind ’n uitgeknipte voetspoor van ’n dinosourus. 2. Doop die voet in verf. 3. Druk die voet op skoon papier en maak ’n afdruk. 4. Laat die kinders hul eie doen en ’n paar afdrukke op die papier maak. 5. Hulle kan ook blare of gras op die prent plak. 6. Smeer gom rondom die afdrukke en strooi sand daaroor. 7. Laat dit droog word.

source: ✔️Talking & Understanding ✔️Arm & hand control
afr: ✔️Praat en verstaan ✔️Arm- en handbeheer

source: All you need is: 1. A cut out dinosaur footprint per child. (The older kids can cut out their own. Ideally, these should be made from, thick, hard card.) 2. Paint. 3. A piece of paper for each child. 4. Glue 5. Sand
afr: Al wat jy nodig het, is: 1. ’n Uitgeknipte voetspoor van ’n dinosourus per kind. (Die ouer kinders kan hul eie uitknip. Dit moet ideaalgesproke van dik, harde karton gemaak wees.) 2. Verf 3. ’n Vel papier vir elke kind 4. Gom 5. Sand

source: This game develops:
afr: Hierdie speletjie ontwikkel:
