Repository: Ari-Ramkilowan/po-files
Catalog: translations/SGroup17(Release (open))_Pedi; Sepedi;  Northern Sotho.po
Languages: nso

source: See what you need
nso: Bona se o se hlokago

source: See how it works
nso: Bona ka moo e šomago ka gona

source: Read the notes
nso: Bala dinoutse

source: Back to menu
nso: Re boela morago go menyu

source: This game develops:
nso: Papadi ye e kaonafatša:

source: Here’s what you’ll need to keep the kids busy: 1. A pre-drawn picture of a dinosaur for each child. 2. Squares about the size of a stamp in 2 or 3 different colours. 3. Glue. 4. Scissors.
nso: Tše ke tše o tla di hlokago gore digotlane di phele di tsene fase ka mošomo: 1. Seswantšho se se tlilego se thadilwe go ngwana yo mongwe le yo mongwe 2. Dikwere tša bogolo bjo bo ka lekanago le setempe ka mebala ye 2 goba ye 3 ye e fapanego 4. Sekgomaretši 5. Sekero

source: We started from the ground up by making dinosaur footprints in the last activity, so how about we move on to Making Dinosaurs? 🦕
nso: Re thomile fase re eya godimo ka go dira mehlala ya ntatauwane mo mošomong wa mafelelo, go ka ba bjang ge re ka fetela go hlogo ya Go dira Dintatauwane? 🦕

source: ✔️Numbers , Shapes & Sizes ✔️Skills for Learning
nso: ✔️ Dinomoro, dibopego le bogolo ✔️Bokgoni bja go ithuta

source: Keep the kids wide awake by encouraging them to make dinosaur noises while they work. 🦖🦕 1. Give each child a picture of a dinosaur. 2. Cut out the colourful squares for younger children. 3. Let older children cut their own little squares. 4. Sort the little squares into piles depending on their colour. 5. Show the children how to stick the squares onto their dinosaurs. 6. Help the younger ones while encouraging the older ones. 7. Help them make a pattern using colours (red, blue, red, blue, red, etc).
nso: Dira gore digotlane di dule di phafogile ka go di hlohleletša go dira mašata a ntatauwane ge di tsene fase ka mošomo. 🦖🦕 1. Efa ngwana yo mongwe le yo mongwe seswantšho sa ntatauwane. 2. Ripela bana ba bannyane dikwere tša mebalabala. 3. E re bana ba bagolo ba ripe dikwere tša bona tše nnyane. 4. Beakanya dikwere tše nnyane ka mekgobo go ya ka mebala ya tšona. 5. Bontšha bana ka moo ba ka kgomaretšago dikwere godimo ga dintatauwane tša bona. 6. Thuša bana ba bannyane mola ka go le lengwe o hlohleletša ba bagolo. 7. Ba thuše go dira phethene ba šomiša mebala (khwibidu, talalerata, khwibidu, talalerata, khwibidu, bjalobjalo).

source: Not sure what to ask the children next? Here are some ideas: Level 1 • What does this dinosaur need? • Where will these spikes go? • How many do you need? • What colours will you choose? Level 2 • What pattern will you make? • Which one shall we start with? • When did dinosaurs live? (The answer can be something like: a long, long time ago). • Are there still dinosaurs on earth? (Answer: no, they have all died). • What do they eat? (Answer: some eat plants, some eat other animals). Level 3 • What sound does dinosaur start with? (da) • What else starts with ‘da’? • Do you know the names of different types of dinosaurs? (Answer: T. rex, brontosaurus, triceratops).
nso: Ga o na bohlatse ka se sengwe seo o ka botšišago bana ka sona? Tše ke tše dingwe tša dikgopolo: Kgato ya 1 • Naa ntatauwane ye e nyaka eng? • Naa disepaeke tše di tla ya kae? • Naa o nyaka tše kae? • Naa o tla kgetha mebala efe? Kgato ya 2 • Naa o tla dira phethene efe? • Naa re ka thoma ka efe? • Naa dintatauwane di phetše neng? (Karabo e ka ba ye e swanago le ya gore: nakong ya kgalekgale). • Naa go sa na le dintatauwane mo lefaseng? (Karabo: aowa, di hwile ka moka ga tšona, di timeletše). • Naa di ja eng? (Karabo: tše dingwe di ja mehlare, mola tše dingwe di e ja diphoofolo). Kgato ya 3 • Naa lentšu le ntatauwane le thoma ka modumo ofe? (nta) • Naa ke eng ye nngwe ya go thoma ka ‘nta’? • Naa o tseba maina a mehuta ye e fapafapanego ya dintatauwane? (Karabo: T. rex, brontosaurus, triceratops).
