Repository: Ari-Ramkilowan/po-files
Catalog: translations/SGroup7(Release (open))_Afrikaans.po
Languages: afr

source: Read the notes
afr: Lees die notas

source: See what you need
afr: Kyk wat jy nodig het

source: See how it works
afr: Kyk hoe dit werk

source: Back to menu
afr: Terug na spyskaart

source: The lion is the king of the jungle, let’s see what the kids know about it: Level 1 • What sound does a lion make? • Where do they live? • What do they eat? • What should you do if you see a lion? Level 2 • What kind of animals are they? (Cats and mammals) • What do they look like? • How big are they? • What colour are they? Level 3 • What else can you tell me about lions? • What other animals live near lions? • Let’s talk about those – what do you know about elephants, or rhinos? • What sound does the word ‘lion’ start with? • What sound does the word ‘rhino’ start with? • What sound does the word ‘elephant’ start with?
afr: Die leeu is die koning van die oerwoud. Kom ons kyk wat die kinders daarvan weet: Vlak 1 • Watter geluid maak ’n leeu? • Waar woon hulle? • Wat eet hulle? • Wat moet jy doen as jy ’n leeu sien? Vlak 2 • Watter soort diere is hulle? (Katte en soogdiere) • Hoe lyk hulle? • Hoe groot is hulle? • Watter kleur is hulle? Vlak 3 • Wat kan jy my nog van leeus vertel? • Watter ander diere woon naby leeus? • Kom ons praat oor hulle – wat weet jy van olifante of renosters? • Met watter klank begin die woord ‘leeu’? • Met watter klank begin die woord ‘renoster’? • Met watter klank begin die woord ‘olifant’?

source: This game develops:
afr: Hierdie speletjie ontwikkel:

source: Have you made any Little Lions yet? 🦁
afr: Het julle al enige Klein Leeutjies (Little Lions) gemaak? 🦁

source: ✔️Walking & Moving ✔️Arm & Hand control
afr: ✔️Loop en beweeg ✔️Arm- en handbeheer

source: If you have time, get the children cut these things out themselves: ✂ - 1 paper per child for the lion’s face - 2 black eyes per child cut out of paper - 1 nose per child cut out of paper - 2 ears per child cut out of paper - 1 plastic / onion bag per child
afr: As jy tyd het, laat die kinders hierdie goed self uitknip: ✂ - 1 vel papier per kind vir die leeu se gesig - 2 swart oë per kind wat uit papier geknip is - 1 neus per kind wat uit papier geknip is - 2 ore per kind wat uit papier geknip is - 1 plastiek-/uiesak per kind

source: You can use this activity as an opportunity to teach children about animals. 1.Talk about lions before you make the lion face. 2.Ask each child to cut out a circle to make the lions face. 3.They can colour in the face of the lion and stick on eyes, nose and ears. 4.Get them to cut strips of plastic or onion bag for the mane of the lion. 5.Stick on the strips. 6.If you have string, you could make holes in the eyes and turn the lion face into a mask. 7.Get children to crawl around and roar like lions.
afr: Jy kan hierdie aktiwiteit gebruik as ’n geleentheid om kinders oor diere te leer. 1. Praat oor leeus voordat julle die leeugesig maak. 2. Vra elke kind om ’n sirkel uit te knip om die leeugesig te maak. 3. Hulle kan die gesig van die leeu inkleur en die oë, neus en ore opplak. 4. Laat hulle stroke plastiek of uiesak vir die leeu se maanhare uitknip. 5. Plak stroke vas. 6. As jy tou het, kan jy gate in die oë maak en die leeugesig gebruik om ’n masker te maak. 7. Laat die kinders rondkruip en soos leeus brul.
