Repository: Ari-Ramkilowan/po-files
Catalog: translations/SGroup8(Release (open))_Afrikaans.po
Languages: afr

source: Another great arts and crafts activity is Making Faces 😃🙃🤪😜🤩😎😠🤗🤐😴🤕🤒🤠🤯😍
afr: ’n Ander lekker aktiwiteit vir kuns en handwerk is Maak Gesigte (Making Faces). 😃🙃🤪😜🤩😎😠🤗🤐😴🤕🤒🤠🤯😍

source: But I don’t mean pulling faces, I mean making them with: 1. 1 piece of paper per child 2. Wool 3. Scissors and glue For younger children: 1. Cut out 1 pair of eyes per child. 2. Cut out 1 pair of ears per child. 3. Cut out nose per child. 4. Cut out mouth per child. For older children: 1. Pictures where they can cut out the eyes, nose, mouth etc.
afr: Ek bedoel nie hulle moet gesigte trek nie, hulle moet gesigte maak: 1. 1 vel papier per kind 2. Wol 3. ’n Skêr 4. Gom Vir jonger kinders: 1. Knip 1 paar oë per kind uit. 2. Knip 1 paar ore per kind uit. 3. Knip ’n neus per kind uit. 4. Knip ’n mond per kind uit. Vir ouer kinders: 1. Prente waaruit hulle die oë, neus, mond, ens. kan knip. Kyk hoe dit werk

source: Read the notes
afr: Lees die notas

source: See what you need
afr: Kyk wat jy nodig het

source: See how it works
afr: Kyk hoe dit werk

source: Back to menu
afr: Terug na spyskaart

source: This game develops:
afr: Hierdie speletjie ontwikkel:

source: ✔️Arm & Hand Control ✔️Talking & Understanding
afr: ✔️Arm- en handbeheer ✔️Praat en verstaan

source: Once you have everything you need: 1. Give each child a piece of paper and cut-out pictures of noses, eyes, ears and mouths to give to younger children. 2. Give pictures of faces to older children. 3. Ask them to use the pictures to make a face. 4. Talk about the senses as you do it (smell, taste, seeing, hearing etc.). 5. Get them to stick their pictures down when they have made their faces. 6. Give them each some wool and ask them to turn it into hair. 7. They can cut and stick the materials in any way they want to. 8. Look at the faces together and talk about them to help the kids learn. There are examples of what to ask in the notes. 9. Cut the faces out and attach them to a stick. 10. You can use these to tell stories.
afr: Sodra jy alles het wat jy nodig het: 1. Gee elke kind ’n vel papier en knip prente van neuse, oë, ore en monde uit om vir jonger kinders te gee. 2. Gee die ouer kinders prente van gesigte. 3. Vra hulle om die prente te gebruik om ’n gesig te maak. 4. Terwyl dit gedoen word, praat oor die sintuie (ruik, proe, sien, hoor, raak). 5. Wanneer hulle die gesigte gemaak het, vra hulle om die prente te plak. 6. Gee vir elkeen ’n bietjie wol en vra hulle om dit in hare te verander. 7. Hulle kan die materiaal knip en plak nes hulle wil. 8. Kyk saam na die gesigte en praat daaroor om die kinders te help leer. Daar is in die notas voorbeelde van wat om te vra. 9. Knip die gesigte uit en heg dit aan ’n stok. 10. Jy kan dit gebruik om stories te vertel.

source: As promised, here are some questions: ❓ Level 1 • What do we use our noses for? • What do we use our eyes for? • And our ears? • Is your face happy or sad? • What kind of hair will you make? • What is the name of this face? Level 2 • What is your favourite taste? • What do you like to smell? • What can you hear right now? • What can you see with your eyes if you look left? • What can you see with your eyes if you look to the right? Level 3 Allow older children to make up a story - for example: • Who does your face belong to? • Mine is a gogo • What do you want to say to gogo? • Gogo asks: “What you would like for supper?” • Gogo asks if you will help her make supper. • What shall we do first? You can even act the story out if you like.
afr: Soos belowe, hier is ’n paar vrae: Vlak 1 • Waarvoor gebruik ons ons neus? • Waarvoor gebruik ons ons oë? • En ons ore? • Is jou gesig gelukkig of hartseer? • Watter soort hare sal jy maak? • Wat is die naam van hierdie gesig? Vlak 2 • Wat is jou gunsteling smaak? • Wat is vir jou lekker om te ruik? • Wat kan jy nou hoor? • Wat kan jy met jou oë sien as jy na links kyk? • Wat kan jy met jou oë sien as jy na regs kyk? Vlak 3 Laat ouer kinders toe om ’n storie op te maak – byvoorbeeld: • Aan wie behoort jou gesig? • Myne is ’n gogo. • Wat wil jy vir gogo sê? • Gogo vra: “Wat wil jy vir aandete hê?” • Gogo vra of jy haar sal help om aandete te maak. • Wat sal ons eerste doen? Jy kan die storie uitspeel as jy wil.
