Repository: Ari-Ramkilowan/po-files
Catalog: translations/SGroup18(Release (open))_Tsonga.po
Languages: tso

source: Need some inspiration? Keep the game going with questions like these: Level 1 • Look around and choose an item that everyone can see. • Don’t tell the others what it is. • Then say “I spy with my little eye, something that is green.” • Let the children guess what it is by calling out all the green things they see. • Try not to make it too difficult. Level 2 • Then say “I spy with my little eye, something beginning with ‘w’.” • Use the sound “w”, not the letter. • Let the kids guess the item. • Give each child a turn to take a guess. Level 3 • Then say “I spy with my little eye, something beginning with ‘ch’.” • Use the sound “ch”, not the letter. • Let the kids guess the item. • Give each child a turn to take a guess.
tso: U lava nhlohlotelo? Yisa ntlangu emahlweni hi swivutiso swo fana na leswi: Levhele ya 1 • Valanga hinkwakonkwako u hlawula ayitheme leyi va yi vonaka hinkwavo. • U nga va byeli lavan’wana leswaku i yini. • Kutani u ku “Ndza hlola hi swimahlwana swa mina, xanchumu xa rihlaza.” • Endla leswaku vana va bvumba leswaku i yini hi ku vula swilo hinkwaswo swa rihlaza leswi va swi vonaka. • Ringeta ku endla leswaku swi olova. Levhele ya 2 • Kutani u ku “Ndza hlola hi swimahlwana swa mina, xin’wana lexi sungulaka hi ‘w’.” • Tirhisa mpfumawulo “w”, ku nga ri letere. • Endla leswaku vana va bvumba ayitheme. • Nyika n’wana un’wana na un’wana nkarhi wo bvumba. Levhele ya 3 • Kutani u ku “Ndzi hlola hi xitihlwana xa mina, xin’wana lexi sungulaka hi ‘ch’.” • Tirhisa mpfumawulo “ch”, ku nga ri letere. • Endla leswaku vana va bvumba ayitheme. • Nyika n’wana un’wana na un’wana nkarhi wo bvumba.

source: We’re taking I Spy to the next level with some eye glasses. Here’s what you’ll need 👓: • 2 used toilet rolls per child. • String. • Scissors. • 2 sticks per child. • Cellotape.
tso: Hi hundzisela Ndza Hlola eka levhele yin’wana hi manghilazi ya mahlo. Hi leswi leswi u nga ta swi lava 👓: • Tirholo ta le thoyilete ti 2 leti nga tirhisiwa hi n’wana • Ntambu • Xikero • Swimhandzana swi 2 hi n’wana • Thepi yo damarhela

source: Read the notes
tso: Hlaya tinotsi

source: Back to menu
tso: Ku tlhelela eka menyu

source: You’ll be showing these cool kids how to make a pair of glasses.😎 1. Cut the toilet roll into 2 rings and tie them together to make glasses 2. Attach the sticks to the sides of the glasses to make the ‘arms’ of the glasses. 3. Support the younger kids. 4. Encourage the older ones to this on their own. 5. Ask the children to put their glasses on and talk about what glasses do. 6. Play I Spy: Find something in the room that everyone can see, for example, a table. 7. Say: “I Spy with my little eye, something beginning with ‘t’ (sound)” 8. Let each child have a turn guessing. 9. Walk around the room and tell them what you see through your glasses. 10. Get them to walk with you, glasses on!
tso: U ta komba vana lava va kahle maendlelo ya phere ya manghilazi ya mahlo. 😎 1. Tsema rholo ya le thoyilete yi va tiringi ti 2 na ku tiboha xikan’we ti endla manghilazi. 2. Khomisa swimhandzana ematlhelo ka manghilazi ku endla ‘mavoko’ ya manghilazi. 3. Nyika vana lavantosngo nseketelo. 4. Khutaza lavakulu ku va tiendlela ha voxe. 5. Byela vana ku mbala manghilazi ya vona na ku vulavula hi leswi manghilazi ma endlaka swona. 6. Tlanga Ndza Hlola: Kuma xanchumu ekamareni lexi va xi vonaka hinkwavo, xikombiso, tafula. 7. U nge: “Ndza Hlola hi swimahlwana swa mina, xin’wana lexi sungulaka hi ‘t’ (mpfumawulo)” 8. Endla leswaku n’wana un’wana na un’wana a kuma nkarhi wo bvumba. 9. Rhendzeleka na kamara na ku va byela leswi u swi vonaka hi manghilazi ya wena. 10. Endla leswaku va vulavula na wena, mbala manghilazi!

source: See what you need
tso: Vona leswi u swi lavaka

source: See how it works
tso: Vona leswaku swi tirha njhani

source: We put a spin on the classic game, I Spy. 🔍
tso: Hi cince kantsongo ntlangu wa xiyimo xa le henhla, Ndza Hlola. 🔍

source: This game develops:
tso: Ntlangu lowu wu ya emahlweni:

source: ✔️Social ✔️Early Reading & Writing
tso: ✔️Vumunhu ✔️Ku hlaya ka masungulo na ku tsala
