Repository: Ari-Ramkilowan/po-files
Catalog: translations/SGroup19(Release (open))_Tsonga.po
Languages: tso

source: Back to menu
tso: Ku tlhelela eka menyu

source: See what you need
tso: Vona leswi u swi lavaka

source: Read the notes
tso: Hlaya tinotsi

source: See how it works
tso: Vona leswaku swi tirha njhani

source: This game develops:
tso: Ntlangu lowu wu ya emahlweni:

source: It’s time to decorate your classroom by Making Chains. Don’t worry, the children’s chains will be way nice than these: ⛓
tso: I nkarhi wo khavisa kamara ra wena ra tlilasi hi ku Endla Tinketana. U nga vileli, tinketana ta vana ti ta va ti sasekile ku hundza leti: ⛓

source: ✔️Skills for Learning ✔️Arm & hand control
tso: ✔️Swikili swo dyondza ✔️Ku lawula voko na xandla

source: Good news! You probably have everything you need under your nose right now. 1. Coloured paper 2. Scissors 3. Glue
tso: Mahungu lamanene! U nga va u ri na hinkwaswo leswi u swi lavaka kwala u nga kona eka nkarhi wa sweswi. 1. Phepha ra muhlovohlovo 2. Xikero 3. Dlilu

source: Not exactly sure what to ask? Try out some of these questions: Level 1 • What colour do you like? • How many links will you make? • What could you use your chain for? Level 2 • What is your pattern? • How many colours do you have? Level 3 • How many links do you have? • How many links does your friend have? • How many links do you have together? • What if I take 5 links away? • How many will you have left?
tso: Xana awu swi tivi leswaku u nga vutisa yini? Ringeta swin’wana swa swivutiso leswi: Levhele ya 1 • Xana u tsakela muhlovo wihi? • Xana u ta hlanganisa swilo swingani? • Xana nketani ya wena u nga yi tirhisa ku endla yini? Levhele ya 2 • Xana phetheni ya wena i yini? • Xana u na mihlovo yingani? Levhele ya 3 • Xana u hlanganise swilo swingani? • Xana munghana wa wena u hlanganise swilo swingani? • Xana mi hlanganise swilo swingani loko swi hinkwenu ka n’wina? • Loko ndzo susa 5 wa leswi mi swi hlanganiseke? • Xana mi ta sala na swingani?

source: This activity is great for the children’s hand-eye coordination! 🖐🏿 👁 • Help the children cut the coloured paper into short strips. • They should each have about 10 strips . • Stick the 2 short edges of one strip together, making a ring. • Thread a new strip through the ring and stick its ends together, linking the 2 rings. • Continue with at least 10 strips, and make rings that link to each other. • Make scarves, necklaces, or belts with them before hanging them up in the classroom. • Ask questions as you work to help the kids learn.
tso: Nghingiriko lowu wu kahle eka vana leswaku va va na ku tirhisana ka mahlo na mavoko! 🖐🏿 👁 • Pfuna vana ku tsema phepha ra muhlovohlovo ri va switiripi swo koma. • Un’wana na un’wana wa vona u fanele ku va na switiripi swa 10. • Damarheta makumu ma 2 la mo koma ya xitiripi xin’we ma khomana, ma endla xingwavila. • Hulela xitiripi xintshwa endzeni ka xingwavila na ku damarheta makumu ma xona ma khomana, mahlanganisa swingwavila leswi 2. • Yisa emahlweni hi ku ringana 10 ra switiripi, na ku endla swingwavila leswi khomanaka. • Endla swikhafu, tichayeni ta le nhan’wini kumbe mabandi hi swona u nga se swi hayeka ekamareni ro dyondzela. • Vutisa swivutiso loko u ri karhi u tirha ku pfuna vana ku va va dyondza.
