Repository: Ari-Ramkilowan/po-files
Catalog: translations/SGroup20(Release (open))_Venda.po
Languages: ven

source: See how it works
ven: Zwi shumisa hani

source: Animal Pond
ven: Arali vha sa athu u anetshela vhana tshiṱori ṋamusi, Tshisima tsha Zwipuka tshi nga vha mushumo wavhuḓisa. 🐘🐂🐪

source: Read the notes
ven: Kha vha vhale notsi

source: Back to menu
ven: Kha vha humele murahu kha menyu

source: See what you need
ven: Zwine vha ṱoḓa

source: Let the children build on their brilliant stories by asking them these questions: Level 1 • What animal do you have? • Where does he want to go? • How will you help him? • What will you build? • How will you build it? • How will the animal cross? • Where is he going now? Level 2 • How does your goat feel? • What does he feel that way? • What will make him feel scared? • What will make him feel safe and happy? Level 3 • Tell me the story of your little goat.
ven: Kha vha tendele vhana vha sike zwiṱori zwavho nga u vha vhudzisa mbudziso idzi: Ḽiga 1 • No fara tshipuka tshifhio? • Tshi khou ṱoḓa u ya ngafhi? •Ni ḓo tshithusisa hani? • Ni ḓo fhaṱa mini? • Ni ḓo tshifhaṱisa hani? • Tshipuka tshi ḓo pfukisa hani? • Tshi khou ya ngafhi zwino? Ḽiga 2 • Mbudzi i ḓi pfa hani? •Ndi ngani i tshi khou ḓipfa nga iyi nḓila? • Ndi mini tshine tsha nitshuwisa? • Ndi mini tshine tsha ḓo ita uri ni pfe no tsireledzea nahone no takala? Ḽiga 3 • Nṱalutshedzeni tshiṱori nga ha tshibudzana tshaṋu.

source: This game develops:
ven: Mutambo uyu u bveledza:

source: ✔️Skills for Learning ✔️Exploring & Finding Out
ven: ✔️Vhukoni ha u guda ✔️U ṱoḓisisa na u wanulusa

source: So many benefits, so few items needed: 1. Duplo LEGO blocks 2. Plastic animals 3. Blue paper 4. Scissors
ven: Hu na mbuelo nnzhi fhedzi hu tshi tou ṱoḓea zwithu zwiṱukuṱuku: 1. Zwibuloko zwa DUPLO LEGO 2. Zwipuka zwa pulasiṱiki 3. Mabammbiri a buḽuu/lutombo 4. Zwigero

source: How does it work? 1. Cut a circle out of the blue paper and use it as the pond. 2. Tell the story about a little animal who is trying to get across the pond to see its mommy. 3. It can’t swim and it’s too far to walk around the pond. 4. Divide the children into pairs and give them some duplo blocks. 5. Ask them to build a bridge for the little animal. 6. Once they have finished, ask them to show you how their animal crosses the bridge 7. Get them to tell you the story in their own way
ven: Zwi shumisa hani? 1. Kha vha gere zwidanga kha bammbiri ḽa buḽuu/lutombo vha ḽi shumise sa tshisima. 2. Kha vha anetshele tshiṱori nga ha tshipuka tshiṱuku tshine tsha khou lingedza u pfukha kutivha ukwo uri tshi kone uya u vhona mme atsho. 3. A tshi koni u bammbela, hone uri tshi tou mona na kutivha ndi nḓila ya kule. 4. Kha vha khethekanye vhana nga vhavhili vhavhili vha vha ṋee zwibuḽoko zwa DUPLO. 5. Kha vha vha humbele vha fhaṱe buroho u itela tshipuka itsho. 6. Musi vho no fhedza, kha vha vha humbele uri vha vha sumbedze uri tshipuka tshavho tshi ḓo pfukisa hani buroho 7. Kha vha vhudze vha vha ṱalutshedze tshiṱori nga nḓila yavho.
