Repository: Ari-Ramkilowan/po-files
Catalog: translations/SGroup20(Release (open))_Tsonga.po
Languages: tso

source: See how it works
tso: Vona leswaku swi tirha njhani

source: Animal Pond
tso: Loko ku ri leswaku a wu se byela vana xitori xa swihari namuntlha, Phondo ya Swihari wu nga va nghingiriko wa kahle. 🐘🐂🐪

source: Read the notes
tso: Hlaya tinotsi

source: Back to menu
tso: Ku tlhelela eka menyu

source: See what you need
tso: Vona leswi u swi lavaka

source: Let the children build on their brilliant stories by asking them these questions: Level 1 • What animal do you have? • Where does he want to go? • How will you help him? • What will you build? • How will you build it? • How will the animal cross? • Where is he going now? Level 2 • How does your goat feel? • What does he feel that way? • What will make him feel scared? • What will make him feel safe and happy? Level 3 • Tell me the story of your little goat.
tso: Endla leswaku vana va ndlandlamuxa switori swa vona swa kahle hi ku va vutisa swivutiso leswi: Levhele ya 1 • Xana u na xihari xihi? • Xana xi lava ku ya kwihi? • Xana u ta xi pfuna njhani? • Xana u ta aka yini? • Xana u ta xi aka njhani? • Xana xihari xi ta tlula njhani? • Xana xi ya kwihi sweswi? Levhele ya 2 • Xana mbuti ya wena yi ti twa njhani? • Hikokwalahokayini yi ti twa hi ndlela yoleyo? • Xana i yini swi nga endlaka leswaku yi chava? • Xana i yini swi nga ta endla leswaku yi ti twa yi hlayisekile no tsaka? Levhele ya 3 • Ndzi byeli xitori hi ximbutana xa wena.

source: This game develops:
tso: Ntlangu lowu wu ya emahlweni:

source: ✔️Skills for Learning ✔️Exploring & Finding Out
tso: ✔️Swikili swo dyondza ✔️Ku valanga na ku kuma

source: So many benefits, so few items needed: 1. Duplo LEGO blocks 2. Plastic animals 3. Blue paper 4. Scissors
tso: Mivuyelo yo tala, ku ri karhi ku laveka tiayitheme tintsongo: 1. Tibuloko ta DUPLO LEGO 2. Swihari swa pulasitiki 3. Phepha ra wasi 4. Xikero

source: How does it work? 1. Cut a circle out of the blue paper and use it as the pond. 2. Tell the story about a little animal who is trying to get across the pond to see its mommy. 3. It can’t swim and it’s too far to walk around the pond. 4. Divide the children into pairs and give them some duplo blocks. 5. Ask them to build a bridge for the little animal. 6. Once they have finished, ask them to show you how their animal crosses the bridge 7. Get them to tell you the story in their own way
tso: Xana swi tirha njhani? 1. Tsema sekele eka phepha ra wasi na ku ri tirhisa tanihi phondo. 2. Hlamusela xitori hi xihari lexintsongo lexi ringetaka ku tsemakanya phondo ku ya vona manana wa xona. 3. A xi koti ku hlambela naswona i kule ku va xi nga rhendzeleka hi phondo. 4. Avanyisa vana hi swiphere na ku va nyika tibuloko ta DUPLO. 5. Va byeli va akela xihari lexintsongo buloho. 6. Loko va hetile, va byeli va ku komba leswi swihari swa vona swi tsemakanyisaka swona buloho 7. Endla leswaku va ku byela xitori hi ndlela ya vona.
