Repository: Ari-Ramkilowan/po-files
Catalog: translations/SGroup2(Release (open))_Tsonga.po
Languages: tso

source: See what you need
tso: Vona leswi u swi lavaka

source: Read the notes
tso: Hlaya tinotsi

source: Back to menu
tso: Ku tlhelela eka menyu

source: It’s time to play Knock Down Skittles. 🎳
tso: I nkarhi wo tlanga Wisela Swikitele ehansi. 🎳

source: This game develops:
tso: Ntlangu lowu wu ya emahlweni:

source: ✔️Arm & Hand Control ✔️Numbers , Shapes and Sizes
tso: ✔️Ku lawula voko na xandla ✔️Tinomboro, swivumbeko na tisayizi

source: This is a great to get the children playing in groups together so that they can make new friends. 1. A set of skittles (3 to 5). You can make these out of empty drinking bottles, but not glass. 2. A ball (you can make this out of plastic bags and onion bags). 3. Space to play skittles.
tso: Leswi swi kahle ku endla vana va tlanga hi mitlawa leswaku va kota ku kuma vanghana lavantshwa. 1. Sete ya swikitele (3 ku fika 5). U nga swi endla hi ku tirhisa mabodhlela yo n’wela lama nga riki na nchumu endzeni, kambe ku nga ri nghilazi. 2. Bolo (u nga yi endla hi ku tirhisa tibeke ta tipulasitiki kumbe swisakana swa tinyala). 3. Ndhawu yo tlangela swikitele.

source: See how it works
tso: Vona leswaku swi tirha njhani

source: It’s also really straightforward, and you can play it over and over. All you have to do is: 1. Line the skittles up in a row. 2. Line the children up in front of the skittles. 3. Together take 5 steps back and count out loud as they step backwards. 4. Give each child a turn to roll the ball towards the skittles. 5. The ball should not leave the ground. 6. Reset the skittles when they have been knocked over. 7. This time take six steps back. 8. Have the children throw under arm first. 9. Then throw overarm. 10. Throw ball with two hands. 11. Throw ball with one hand.
tso: Swi olovile, naswona u nga swi tlanga hi ku vuyelela. Leswi u faneleke ku endla swona i ku: 1. Longoloxa swikitele hi rheyi. 2. Longoloxa vana emahlweni ka swikitele. 3. Tekani swin’we magoza ya 5 ku ya endzhaku na ku hlayelela ehenhla loko va teka magoza yo ya endzhaku. 4. Nyika n’wana un’wana na un’wana nkarhi wo khunguluxela bolo eka swikitele. 5. Bolo a yi fanelanga ku suka ehansi. 6. Tlhela u veketela swikitele loko swi wele ehansi. 7. Sweswi tekani magoza ya tsevu ku ya enzhaku. 8. Endla leswaku vana va rhanga hi ku hoxa ehansi ka voko. 9. Kutani va hoxa ehenhla ka voko. 10. Hoxa bolo hi mavoko mambirhi. 11. Hoxa bolo hi voko rin’we.

source: But it’s not just physical, you can also use these questions to help the kids learn more: Before you start: • How many skittles can you see? • What colours are they? While you’re taking turns: • How many did you knock over? • How many are left? • Can you catch the ball with 2 hands? Before you start the next round: • How many steps should we take now? • Is that more or less than last time? • Can you catch the ball 1-handed?
tso: Kambe a ko va swo endliwa ntsena. U nga ha tlhela u tirhisa swivutiso leswi ku pfuna vana ku va va dyondza swotala: Loko u nga se sungula: • Xana u vona swikitele swingani? • Xana i swa muhlovo muni? Loko mi ri karhi mi cincana: • Xana u wise swingani? • Xana ku sele swingani? • Xana u nga khoma bolo hi mavoko ma 2? Loko u nga se sungula rhawundi leyi landzelaka: • Xana hi fanele ku teka magoza mangani sweswi? • Xana matele kumbe ma le hansi ka lama nkarhi lowu nga hundza? • Xana u nga khoma bolo hi voko ri 1?
