Repository: Ari-Ramkilowan/po-files
Catalog: translations/SGroup8(Release (open))_Venda.po
Languages: ven

source: Another great arts and crafts activity is Making Faces 😃🙃🤪😜🤩😎😠🤗🤐😴🤕🤒🤠🤯😍
ven: Muṅwe mushumo wavhuḓisa wa vhutsila na zwivhaḓwa ndi ita Zwifhaṱuwo 😃🙃🤪😜🤩😎😠🤗🤐😴🤕🤒🤠🤯😍

source: But I don’t mean pulling faces, I mean making them with: 1. 1 piece of paper per child 2. Wool 3. Scissors and glue For younger children: 1. Cut out 1 pair of eyes per child. 2. Cut out 1 pair of ears per child. 3. Cut out nose per child. 4. Cut out mouth per child. For older children: 1. Pictures where they can cut out the eyes, nose, mouth etc.
ven: A thi khou amba nga ha u shandukisa zwifhaṱuwo, ndi khou amba u tou zwi ita: 1. Tshipida tshithihi (1) tsha bammbiri nga ṅwana 2. Uḽu 3. Zwigero 4. Guḽuu Kha vhana vhaṱuku: 1. Kha vha gere phere nthihi (1) ya maṱo nga ṅwana. 2. Kha vha gere phere nthihi (1) ya nḓevhe nga ṅwana. 3. Kha vha gere ningo nga ṅwana. 4. Kha vha gere mulomo nga ṅwana. Kha vhana vhahulwane: 1. Tshifanyiso tshine khatsho vha nga gera maṱo, ningo mulomo na zwiṅwevho.

source: Read the notes
ven: Kha vha vhale kha notsi

source: See what you need
ven: Zwine vha ṱoḓa

source: See how it works
ven: Zwi shumisa hani

source: Back to menu
ven: Kha vha humele murahu kha zwirengomu (Menu)

source: This game develops:
ven: Mutambo uyu u bveledza:

source: ✔️Arm & Hand Control ✔️Talking & Understanding
ven: ✔️Ndaulo ya tshanḓa tshoṱhe ✔️U amba na u pfesesa

source: Once you have everything you need: 1. Give each child a piece of paper and cut-out pictures of noses, eyes, ears and mouths to give to younger children. 2. Give pictures of faces to older children. 3. Ask them to use the pictures to make a face. 4. Talk about the senses as you do it (smell, taste, seeing, hearing etc.). 5. Get them to stick their pictures down when they have made their faces. 6. Give them each some wool and ask them to turn it into hair. 7. They can cut and stick the materials in any way they want to. 8. Look at the faces together and talk about them to help the kids learn. There are examples of what to ask in the notes. 9. Cut the faces out and attach them to a stick. 10. You can use these to tell stories.
ven: Musi vho no kuvhanganya zwoṱhe zwine vha ṱoda: 1. Kha vha ṋee ṅwana muṅwe na muṅwe tshipiḓa tsha bammbiri na zwifanyiso zwo gerwaho zwa ningo, maṱo, nḓevhe na milomo vha ṋee vhana vhaṱuku. 2. Kha vha ṋee zwifanyiso zwa zwifhaṱuwo kha vhana vhahulwane. 3. Kha vha vha humbele vha shumise zwifanyiso izwo u ita zwifhaṱuwo. 4. Kha vha ambe nga ha zwipfi vha tshi khou tou zwi sumbedza nga nyito (u nukhedza, u thetshela, u vhona, u pfa, u fara na zwiṅwevho). 5. Kha vha ri vha nambatedze zwifanyiso zwavho fhasi musi vha tshi khou ita zwifhaṱuwo zwavho. 6. Kha vha vha ṋee uḽu vha vha humbele uri vha dzi ite mavhudzi. 7. Vha nga gera vha nambatedza zwithu izwo nga nḓila iṅwe na iṅwe ine vha funa ngayo. 8. Kha vha lavhelese kha zwifhaṱuwo zwoṱhe vha ambe navho nga hazwo u itela u thusa vhana u guda. Hu na tsumbo dza zwine vha tea u zwi vhudzisa kha notsi. 9. Kha vha gere zwifanyiso vha zwi nambatedze kha thanda. 10. Vha nga shumisa izwi u anetshela tshiṱori.

source: As promised, here are some questions: ❓ Level 1 • What do we use our noses for? • What do we use our eyes for? • And our ears? • Is your face happy or sad? • What kind of hair will you make? • What is the name of this face? Level 2 • What is your favourite taste? • What do you like to smell? • What can you hear right now? • What can you see with your eyes if you look left? • What can you see with your eyes if you look to the right? Level 3 Allow older children to make up a story - for example: • Who does your face belong to? • Mine is a gogo • What do you want to say to gogo? • Gogo asks: “What you would like for supper?” • Gogo asks if you will help her make supper. • What shall we do first? You can even act the story out if you like.
ven: Sa zwo fulufhedziswaho, idzi ndi dziṅwe dza mbudziso: Ḽiga 1 • Ri ita mini nga ningo dzashu? • Ri shumisa maṱo u ita mini? • Nḓevhe dzashu dzone? • Tshifaṱuwo tshaṋu tsho takala kana tsho ṱungufhala? • Ni nga ita lushaka lufhio lwa mavhudzi? • Dzina ḽa tshifhaṱuwo itshi ndi ḽifhio? Ḽiga 2 • Ndi muthetshelo ufhio une na u funesa? • Ni tama munukhelelo ufhio? • Ni khou pfa mini zwino? • Ni khou vhona mini nga maṱo musi ni sedza kha tshamonde? • Ni khou vhona mini nga maṱo musi ni tshi sedza kha tshauḽa? Ḽiga 3 Kha vha tendele vhana vhahulwane uri vha ite tshiṱori tshavho – sa tsumbo: • Tshifhaṱuwo tshaṋu ndi tsha mini? • Tshanga ndi tsha makhulu. • Ni khou ṱoḓa u amba mini na makhulu? • Makhulu vho vhudzisa uri: “Ni ḓo ṱoḓa u ḽa mini nga tshilalelo?” • Makhulu vho vhudzisa arali vha tshi ṱoḓa u thusa u ita tshilalelo. • Ri ḓo tea u thoma nga u ita mini? Vha nga tou ita nyito dza nga ha tshiṱori itsho.
