Repository: Ari-Ramkilowan/po-files
Catalog: translations/SGroup9(Release (open))_South Ndebele.po
Languages: nbl

source: Use this activity as a bigger learning opportunity by asking the children some fun questions. Level 1 • Who likes blowing bubbles? • What do we normally use dishwashing soap for? • What colours do we have here? Level 2 • What does this pattern look like? • What shapes can you see? • What colours have you made? • How many bubbles can you see here? Level 3 • Let’s mix some colours. • Now what colours do you have? • What does blue and yellow make? (green) • What does red and yellow make? (orange) • What does blue and red make? (purple) • What sound does blue start with? (ba) • What sound does red start with? (rrrrrr) • What sound does yellow start with? (ya) • What sound does green start with? (ga) • What sound does orange start with? (o) • What sound does purple start with? (pa)
nbl: Sebenzisa lo msebenzi njengethuba elikhulu lokufunda ngokubuza abantwana imibuzo emnandi. Ileveli yoku - 1 • Ngubani othanda ukuvuthela amabhamuza • Esikhathini esinengi isibha sokuvasa iinkotlelo siyisebenziselani? • Ngimiphi imibala esinayo? Ileveli Iyei - 2 • Iphethini le iqaleka njani? • Ngimaphi amajamo owabonako? • Mimiphi imibala oyenzileko? • Mangaki amabhamuza owabonako lapha? Ileveli Iyei - 3 • Khesivanganise imibala. • Ngimiphi imibala onayo nje? • Umbala ohlaza Awatjheli wenza onjani? (ohlaza satjani) • Umbala obomvu Awatjheli wenza onjani? (orentji) • Umbala ohlaza Awabomvu wenza onjani? (iphephuli) • Ohlaza uthoma ngamuphi umsindo? (hl) • Obomvu uthoma ngamuphi umsindo? (b) • Otjheli uthoma ngamuphi umsindo? (tjh) • Ohlaza uthoma ngamuphi umsindo? (hl) • Orentji uthoma ngamuphi umsindo? (o) • Iphephuli ithoma ngamuphi umsindo? (ph)

source: Read the notes
nbl: Funda amaAwathi

source: See what you need
nbl: Bona ukuthi utlhoga ini

source: See how it works
nbl: Bona ukuthi isebenza bunjani

source: Back to menu
nbl: Buyela erhelweni

source: Have the children tried Painting with Bubbles yet? 🎨
nbl: Ingabe abantwana sebazamile ukuPenda ngamaBhamuza? 🎨

source: This game develops:
nbl: Umdlalo lo uthuthukisa:

source: ✔️Exploring & Finding Out ✔️Early Reading & Writing
nbl: ✔️Ukuhlola Awakuthola ✔️Ukufunda Awakutlola kwekuseni

source: It’s really simple. All you need is: 1. Paint 2. Dishwashing liquid 3. Straws 4. Paper
nbl: Kulula khulu. Okutlhogako ngilokhu: 1.Ipende 2.Isibha sokuvasa iinkohlelo 3.Amathunjana wokusela 4.Iphepha

source: Read the note
nbl: Funda amaAwathi

source: This activity breathes new life into having fun with paint. No paintbrushes required! 🖌 1. Mix some paint with some dishwashing liquid in a cup. 2. Add a little bit of water to the mixture. 3. Give each child a straw and some paper, and ask them to share the paint. 4. Ask them to blow (not suck) through the straw into the cup. This will make bubbles. 5. Then ask the children to hold the paper over the cup and bubbles and press down gently. 6. The bubbles will leave a bubble pattern on the paper. 7. The children can repeat this with other colours and then leave their art to dry.
nbl: Umsebenzi lo uletha ipilo etja yokusebenza ngepende. Akutlhogeki amabratjhi wokupenda! 🖌 1.Vanganisa ipende nesibha sokuva iinkotlelo ngekopini. 2.Thela amanzi amancane. 3.Nikeza umntwana ngamunye ithunjana lokusela nephepha bese ubabawa bona babelane ipende. 4.Babawe bona bavuthule (bangamunyi) ngethunjana ekopini. Lokhu kuzokwenza amabhamumuza. 5.Nje bawa abantwana ukuthi baphakamise iphepha ngaphezu kwekopi namabhamuza bese bacindezela phasi kabuthaka. 6.Amabhamuza azakutjhiya iphethini yawo ephepheni. 7.Abantwana bangaphinda lokhu ngeminye imibala bese bayalisa bona kome.
