Repository: Ari-Ramkilowan/po-files
Catalog: translations/SGroup11(Release (open))_Xhosa.po
Languages: xho

source: The little ones might struggle with the higher levels, but these questions are a great way to ease them into basic maths, and an education on money. 💸 Level 1 • What colours have you used? • What shape are the coins? • Which is the biggest coin? • Which is the smallest? • How many coins do we have? • What do we do with money? • Where should we keep our money? Level 2 • Who can show me a R1 coin? • Who can show me a R2 coin? • Who can show me a R5 coin? • How can you make R6? • How can you make R3 etc? • Etc Level 3 • Who can show me a 5 cent coin? • Who can show me a 10 cent coin? • Who can show me a 20 cent coin? • Who can show me a 50 cent coin? • How can you make 20 cents? • How can you make 10 cents? • Etc
xho: Abancicni bangahlupheka ngoMgangatho, kodwa le mibuzo zindlela ezinkulu ukuba zizenze zindlela ezilula zokwenza bathambele isiseko sezibalo, kunye nesifundo malunga nemali. 💸 Umgangatho 1 • Ngowuphi umbala owusebenzisile? • Kokuphi ukumila kwekhoyini? • Yeyiphi ikhoyini eyona inkulu? • Yeyiphi eyona incinci? • Ingaba zingaphi iikhoyini esinazo? • Ingaba senzani ngemali? • Ingaba singayigcinaphi imali yethu? Umgangatho 2 • Ngubani ongandibonisa i R1 ikhoyini? • Ngubani ongandibonisa i R2 ikhoyini? • Ngubani ongandibonisa i R5 ikhoyini? • Ngubani ongenza i R6? • Ngubani ongenza i R3 njl njl.? Umgangatho 3 • Ngubani ongandibonisa i 5 senti ikhoyini? • Ngubani ongandibonisa i 10 senti ikhoyini? • Ngubani ongandibonisa i 20 senti ikhoyini? • Ngubani ongandibonisa i 50 senti ikhoyini? • Ngubani ongenza i 20 senti? • Ngubani ongenza i 10 senti?

source: Engage the children in a conversation about money while they go about this game. 1. Make sure each coin has been washed and is clean. 2. While you talk about money and what it’s used for, give each child a coin. 3. Ask them to look at their coin and tell you what they see. 4. Give them each a crayon and a piece of paper. 5. Show them that if you put the coin under the paper and then rub the crayon over it, you’ll see the picture of a coin. 6. Get them to share their items and explore different coins and colours.
xho: Qalisa ingxoxo malunga nemali xa abantwana beqhubeka nemidlalo yabo. 1. Qiniseka ukuba imali nganye ihlambulukile kwaye ihlambulukile. 2. Ngelixa uthetha ngemali kunye nento esetyenziselwa yona, unike umntwana ngamnye imali. 3. Buza ukuba bajonge imali yabo kwaye bakuxelele oko bakubonayo. 4. Banike nganye ikrayray kunye nephepha elithile. 5. Batshengise ukuba ukuba ubeka ingqekembe phantsi kwephepheni uze uyibhinqe ikrayoni phezu kwalo, uza kubona umfanekiso wesengqekembe. 6. Bafumane ukwabelana ngezinto zabo kwaye bahlole iimali ezahlukeneyo kunye nemibala.

source: Back to menu
xho: Buyela kwimenyu

source: See what you need
xho: Bona okudingayo

source: See how it works
xho: Jonga ukuba isebenza njani

source: Read the notes
xho: Funda amanqaku

source: Remind the kids they’ll need to be very responsible when they’re each given one of the following: 1. A coin 2. A piece of paper 3. A crayon
xho: Khumbuza abantwana baza kudinga ukuba babenoxanduva olukhulu xa ngamnye benikwe oku kulandelayo: 1. Ikhoyini 2. Ipisi ephepha 3. Ikrayoni

source: This game develops:
xho: Lo mdlalo uphuhlisa:

source: It’s never too early to start learning about money with Money Rubs! 💰
xho: Akukho lula ukuqalisa ufunde ngemali ngeMali eKhuhlwa kuwe! 💰

source: ✔️Numbers , shapes & sizes ✔️ Arm & Hand Control
xho: ✔️Amanani, ukumila kunye nesayizi ✔️ Ulawulo lwengalo kunye nesandla
