Repository: Ari-Ramkilowan/po-files
Catalog: translations/SGroup19(Release (open))_Pedi; Sepedi;  Northern Sotho.po
Languages: nso

source: Back to menu
nso: Re boela morago go menyu

source: See what you need
nso: Bona se o se hlokago

source: Read the notes
nso: Bala dinoutse

source: See how it works
nso: Bona ka moo e šomago ka gona

source: This game develops:
nso: Papadi ye e kaonafatša:

source: It’s time to decorate your classroom by Making Chains. Don’t worry, the children’s chains will be way nice than these: ⛓
nso: Ke nako ya go kgabiša phapošiborutelo ya gago ka Go dira Ditšhaene. Se tshwenyege, ditšhaene tša bana e tla ba tše botse kudu go phala tše: ⛓

source: ✔️Skills for Learning ✔️Arm & hand control
nso: ✔️Bokgoni bja go ithuta ✔️Taolo ya letsogo le seatla

source: Good news! You probably have everything you need under your nose right now. 1. Coloured paper 2. Scissors 3. Glue
nso: Ditaba tše botse! O swanetše go ba o na le dilo ka moka tše o di hlokago ka fase ga nko ya gago gabjale. 1. Pampiri ye e kgabišitšwego 2. Sekero 3. Sekgomaretši

source: Not exactly sure what to ask? Try out some of these questions: Level 1 • What colour do you like? • How many links will you make? • What could you use your chain for? Level 2 • What is your pattern? • How many colours do you have? Level 3 • How many links do you have? • How many links does your friend have? • How many links do you have together? • What if I take 5 links away? • How many will you have left?
nso: Ga o na bohlatse bja nnete gore o ka botšiša eng? Leka tše dingwe tša dipotšišo tše: Kgato ya 1 • Naa o rata mmala ofe? • Naa o ka dira dikgokagano tše kae? • Naa o šomišetša tšhaene ya gago eng? Kgato ya 2 • Naa phethene ya gago ke efe? • Naa o na le mebala ye mekae? Kgato ya 3 • Naa o na le dikgokagano tše kae? • Naa mogwera wa gago o na le dikgokagano kae? • Naa o na le dikgokagano tše kae ka moka? • Naa go tla direga eng ge ke ntšha dikgokagano tše 5? • Naa o tla be o šetše ka dikgokagano tše kae?

source: This activity is great for the children’s hand-eye coordination! 🖐🏿 👁 • Help the children cut the coloured paper into short strips. • They should each have about 10 strips . • Stick the 2 short edges of one strip together, making a ring. • Thread a new strip through the ring and stick its ends together, linking the 2 rings. • Continue with at least 10 strips, and make rings that link to each other. • Make scarves, necklaces, or belts with them before hanging them up in the classroom. • Ask questions as you work to help the kids learn.
nso: Mošomo wo o bohlokwa go kgokagano ya seatla la mahlo tša bana! 🖐🏿 👁 • Thuša bana go ripa pampiri ya mebalabala ka meseto ye mekopana. • Yo mongwe le yo mongwe o swanetše go ba le meseto ye e ka bago ye 10. • Kgomaretša merumo ye mekopana ye 2 ya moseto o tee mmogo, go dira palamonwana. • Rokelela moseto o mofsa godimo ga palamonwana gomme o e kgomaretše merumo ya yona mmogo, ka go kgomaganya dipalamenwana tše 2. • Tšwela pele ka meseto ye e ka bago ye 10, gomme o dire dipalamenwana tše di kgokaganago. • Dira dikhafo, dipheta tša molaleng, goba mapanta le bona pele o di fega ka phapošingborutelo. • Botšiša dipotšišo ge le tsene fase ka mošomo go thuša digotlane go ithuta.
