Repository: Ari-Ramkilowan/po-files
Catalog: translations/SGroup20(Release (open))_Swati.po
Languages: ssw

source: See how it works
ssw: Buka kutsi isebenta njani

source: Animal Pond
ssw: Uma ngabe ungakabacoceli indzaba labantfwana namuhla, Lichibi Letilwane lingaba ngumsebenti lokahle. 🐘🐂🐪

source: Read the notes
ssw: Fundza emanotsi

source: Back to menu
ssw: Buyela emuva kumenyu

source: See what you need
ssw: Buka kutsi yini loyidzingako

source: Let the children build on their brilliant stories by asking them these questions: Level 1 • What animal do you have? • Where does he want to go? • How will you help him? • What will you build? • How will you build it? • How will the animal cross? • Where is he going now? Level 2 • How does your goat feel? • What does he feel that way? • What will make him feel scared? • What will make him feel safe and happy? Level 3 • Tell me the story of your little goat.
ssw: Labantfwana abakhe ngaletindzaba tabo letimnandzi ngekutsi nawe ubabute lemibuto: Lizinga1 • Unatiphi tilwane? • Tifuna kuya kuphi? • Utisita njani? • Utawakha ini? • Utayakha njani? • Letilwane titawundlula njani? • Tiyaphi nyalo? Lizinga 2 • Imbuti yakho itiva njani? • Kungani itive ngalolo luhlobo? • Yini letawenta itive itfukile? • Yini letawenta itive iphephile futsi ijabulile? Lizinga 3 • Ngicocele lendzaba yakho yelizinyane lembuti.

source: This game develops:
ssw: Lomdlalo utfutfukisa:

source: ✔️Skills for Learning ✔️Exploring & Finding Out
ssw: ✔️Emakhono ekufundza ✔️Kufunisisa nekutfola kabanti

source: So many benefits, so few items needed: 1. Duplo LEGO blocks 2. Plastic animals 3. Blue paper 4. Scissors
ssw: Tinzuzo letingaka, kudzingeka tintfo letincane: 1. Emabhuloki eDUPLO LEGO 2. Tilwane temapulastiki 3. Liphepha lelilingangane 4. Tikelo

source: How does it work? 1. Cut a circle out of the blue paper and use it as the pond. 2. Tell the story about a little animal who is trying to get across the pond to see its mommy. 3. It can’t swim and it’s too far to walk around the pond. 4. Divide the children into pairs and give them some duplo blocks. 5. Ask them to build a bridge for the little animal. 6. Once they have finished, ask them to show you how their animal crosses the bridge 7. Get them to tell you the story in their own way
ssw: Kusebenta njani? 1. Juba indingilizi kuleliphepha lelilingangane bese ulisebentisa njengalelichibi. 2. Coca indzaba ngesilwanyane lesincane lesizama kuwela kuyobona make waso ngale kwemfula. 3. Asikwati kuhlamba kantsi kukhashane kutsi singahamba situngelete lelichibi. 4. Hlukanisa labantfwana babe ngemapheya bese ubaniketa emabhuloki ema-DUPLO. 5. Bacele kutsi bakhe libhuloho laletilwanyane letincane. 6. Uma ngabe sebacedzile, bacele kutsi bakukhombe kutsi tilwane tabo tilenca njani lelibhuloho. 7. Bacele bakucocele lendzaba yabo ngekwabo.
