Repository: Ari-Ramkilowan/po-files
Catalog: translations/SGroup4(Release (open))_Tsonga.po
Languages: tso

source: See how it works
tso: Vona leswaku swi tirha njhani

source: See what you need
tso: Vona leswi u swi lavaka

source: Read the notes
tso: Hlaya tinotsi

source: Back to menu
tso: Ku tlhelela eka menyu

source: It’s time to decorate your classroom by Making Flowers. 🌸
tso: I nkarhi wo khavisa tlilasi ya n’wina hi ku Endla Swiluva. 🌸

source: This game doesn’t just let the the kids be creative byn painting, but also teaches them to be creative in how they make their brushes. 1. A piece of paper per child 2. 1 peg per child 3. 1 small piece of sponge per child 4. Paint 5. Crayons
tso: Ntlangu lowu a wu endli ntsena leswaku vana va va na vutumbuluxi hi ku penda, kambe wu tlhela wu va dyondzisa ku va na vutumbuluxi hi ndlela leyi va endlaka tiburaci ta vona hakona. 🔧 Va ta lava: 1. Xiphephana hi n’wana 2. Phekisi yi 1 hi n’wana 3. Xiphemu lexintsongo xa xiponci hi n’wana 4. Pende 5. Tikhirayoni

source: This is the fun part. 😃 1. Tell the children they are going to make flowers. 2. Tell them to draw a few circles on their page. Circles are the centre of the flower. They can also draw stems. 3. Help children to peg the small piece of sponge (making a paintbrush). 4. Ask them to dip the sponges in paint and make petals around the circles. 5. Encourage the older children to add other things to their paintings like the sun, grass or butterflies. 6. Allow pictures to dry then hang them around your room. 7. Extend learning while you work by asking questions.
tso: Lexi i xiphemu lexi tsakisaka. 😃 1. Byela vana leswaku va ta endla swiluva. 2. Va byele leswaku va dirowa tisekele ti nga ri tingani eka pheji ya vona. Tisekele hi le xikarhi ka xiluva. Va nga tlhela va dirowa na switshindzi. 3. Pfuna vana ku phekisa xiphemu xa xiponci (va endla burachi yo penda). 4. Va byeli va peta swiponci endzeni ka pende kutani va endla tiphetali ku rhendzeleka na tisekele. 5. Khutaza vana lavakulu ku engetela swilo swin’wana eka swo penda swa vona ku fana na dyambu, byanyi kumbe maphaphatani. 6. Yima swifaniso swi oma kutani u swi hayeka ku rhendzeleka na kamara. 7. Ndlandlamuxa ku dyondza loko u ri karhi u tirha hi ku vutisa swivutiso.

source: Make sure you talk to the kids about what they’re drawing and painting and help them if they get stuck. You can ask them some of these questions: • How many flowers will you make? • What colours will your petals be? • Is your flower tall or short? • Where does it grow? • What do flowers need to grow? • What else can you tell me about your flowers?
tso: Vona leswaku u vulavula na vana hi leswi va nga eku swi diroweni na ku swi penda, kutani u va pfuna loko va nga ha koti ku ya emahlweni. U nga ha va vutisa swin’wana swa swivutiso leswi: • Xana u ta endla swiluva swingani? • Xana tiphetali ta wena ti ta va ta muhlovo muni? • Xana xiluva xa wena xi lehile kumbe xi komile? • Xana xi mila kwihi? • Xana swiluva swi lava yini ku va swi kula? • Xana i yini swin’wana u nga ndzi byelaka swona hi swiluva swa wena?

source: This game develops:
tso: Ntlangu lowu wu ya emahlweni:

source: ✔️Arm & Hand Control ✔️Talking & Understanding
tso: ✔️Ku lawula voko na xandla ✔️Ku vulavula na ku twisisa
