Repository: Ari-Ramkilowan/po-files
Catalog: translations/SGroup12(Release (open))_Tsonga.po
Languages: tso

source: It’s time for these budding entrepreneurs to learn about the value of money. 1. Give each child their coin rubbings from the previous activity. 2. Ask them to cut out the coins. 3. Help those that need it. 4. Help them to fold over their piece of paper to make a purse. 5. Ask the children to put their coins into their new purse for safekeeping. 6. Set up a shop. 7. Talk about the items in your shop as you set up. 8. Have words under your items. Eg, milk, bread, cereal, etc. 9. Ask each child to come to your shop and buy something. 10. When they give you their money, tell them what they can buy with it. 11. Talk as you play and ask questions to help the children learn. 12. For the older children, ask them for money and give them change.
tso: I nkarhi wo va van’wamabindzu va nkarhi lowu taka va dyondza hi nkoka wa mali. 1. Nyika n’wana un’wana na un’wana khoyini ya yena leyi rhaberiweke ephepheni ku suka eka nghingiriko lowu nga hundza. 2. Va byele leswaku va tsema tikhoyini. 3. Pfuna lava lavaka ku pfunaniwa. 4. Va pfune ku petsa swiphephana swa vona va endla xipaci. 5. Byela vana ku veka tikhoyini ta vona endzeni ka xipaci xa vona lexintshwa ku va tihlayiseka. 6. Sungula vhengele. 7. Vulavula hi tiayitheme leti nga evhengeleni ra wena loko u ri karhi u ri sungula. 8. Va na na marito ehansi ka tiyitheme ta wena. Xikombiso, masi, xinkwa, sirili, na swin’wana. 9. Byela n’wana un’wana na un’wana ku ta evhengeleni ra wena a ta xava nchumu wo karhi. 10. Loko va ku nyika mali ya vona, va byele leswi va nga xavaka swona hi yona. 11. Vulavula loko u ri karhi u tlanga na ku vutisa swivutiso ku pfuna vana ku va va dyondza. 12. Vana lavakulu, va byeli leswaku va hakela nchumu wo karhi kutani u va nyika cinci.

source: See what you need
tso: Vona leswi u swi lavaka

source: See how it works
tso: Vona leswaku swi tirha njhani

source: Read the notes
tso: Hlaya tinotsi

source: Back to menu
tso: Ku tlhelela eka menyu

source: Spending money is easy, it’s saving money that’s hard. Try remind the children how important saving is while you talk to them. 🏦 Level 1 • Where do you keep your money? • What do you want to buy at my shop? • What are you going to cook with these things…? • What else would you like to buy? Level 2 • How much money have you got? • That will cost… Level 3 • Have you got any money left? • Would you like to use that money to buy something else? • Do you have enough? • Or would you rather save it for next time? • What sounds does milk start with? (mmmm) • What sound does fish start with? (ffff)
tso: Ku tirhisa mali swa olova, i ku hlayisa mali leswi nonohaka. Ringeta ku tsundzuxa vana hi nkoka wo hlayisa loko u ri karhi u vulavula na vona. 🏦 Levhele ya 1 • Xana u veka kwihi mali ya wena? • Xana u lava ku xava yini evhengeleni ra mina? • Xana u ta sweka yini hi swilo leswi? • Xana i yini swin’wana u nga lavaka ku swi xava? Levhele ya 2 • Xana u na mali muni? • Sweswo swi ta durha… Levhele ya 3 • Xana u na mali leyi nga sala? • Xana u nga tsakela ku tirhisa mali yoleyo ku xava nchumu wun’wana? • Xana u na mali yo ringana? • Kumbe u vona u nga lava ku hlayisela nkarhi lowutaka? • Xana masi yi sungula hi mpfumawulo wihi? (mmmm) • Xana nhlampfi yi sungula hi mpfumawulo wihi? (ffff)

source: Let’s put the Money Rubs the children did to good use with Spending Coins!💰
tso: A hi tirhiseni kahle Mali ya Rhaba leswi vana va nga swi endla eka Tirhisa Tikhoyini! 💰

source: This game develops:
tso: Ntlangu lowu wu ya emahlweni:

source: ✔️Talking & Understanding ✔️Social
tso: ✔️Ku vulavula na ku twisisa ✔️Swikili swo hanyisana na vanhu

source: Now that the children have created their own money during the previous activity, it’s time to give them something to spend it on. You’ll need: 1. Coin drawings from the previous Small Group Activity. 2. Scissors. 3. A piece of paper for each child to make a purse. 4. Empty food containers such as cereal boxes, milk bottles, egg boxes, etc. Have enough for each child to “buy” a few items. 🍞🥔🥚
tso: Leswi vana va nga endla mali ya vona eka nghingiriko lowu nga hundza, sweswi se i nkarhi wo va nyika swin’wana leswaku va yi tirhisela swona. U ta lava: 1. Tikhoyini to dirowiwa ku suka eka Nghingiriko wa Ntlawa Lowuntsongo. 2. Xikero. 3. Xiphephana xa n’wana un’wana na un’wana ku va a endla xipaci. 4. Tikhontheyina ta swakudya leti nga riki na nchumu ku fana na mabokisi ya sirili, mabodhlele ya masi, mabokisi ya matandza, na swin’wana. Kuma swo ringana swo va n’wana un’wana na un’wana a “xava” tiayitheme tingari tingani. 🍞🥔🥚
