Repository: Ari-Ramkilowan/po-files
Catalog: translations/SGroup4(Release (open))_Tswana.po
Languages: tsn

source: See how it works
tsn: Bona kafa o tshamekiwang ka teng

source: See what you need
tsn: Bona se o se tlhokang

source: Read the notes
tsn: Bala dintlha

source: Back to menu
tsn: Boela kwa mmenyung

source: It’s time to decorate your classroom by Making Flowers. 🌸
tsn: Ke nako ya go kgabisa phaposiborutelo ya lona ka go Dira Mabolomo. 🌸

source: This game doesn’t just let the the kids be creative byn painting, but also teaches them to be creative in how they make their brushes. 1. A piece of paper per child 2. 1 peg per child 3. 1 small piece of sponge per child 4. Paint 5. Crayons
tsn: Motshameko o ga o dire fela gore bana ba itlhamele ka go penta, mme gape o ba ruta go itlhamela ka tsela e ba dirang maborashe a bone ka gone. Ba tlile go tlhoka: 1. Pampiri ngwana mongwe le mongwe 2. Ngwana a le mongwe a na le phekese e le 1 3. Seponje se le 1 ngwana mongwe le mongwe 4. Pente 5. Dikerayone

source: This is the fun part. 😃 1. Tell the children they are going to make flowers. 2. Tell them to draw a few circles on their page. Circles are the centre of the flower. They can also draw stems. 3. Help children to peg the small piece of sponge (making a paintbrush). 4. Ask them to dip the sponges in paint and make petals around the circles. 5. Encourage the older children to add other things to their paintings like the sun, grass or butterflies. 6. Allow pictures to dry then hang them around your room. 7. Extend learning while you work by asking questions.
tsn: Se ke karolo e e jesang monate. 😃 1. Bolelela bana gore ba tlile go dira mabolomo. 2. Ba bolelele gore ba thale disekele di le mmalwa mo pampiring ya bone. Disekele ke bofagare jwa lebolomo. Gape ba ka thala dikutu tsa lebolomo. 3. . Thusa bana go tshwara ka pekese ditokinyana tsa seponje (ba dira borashe jwa pente). 4. Ba kope gore ba tsenya diseponje mo penteng ba bo ba tshwantsha matlapenyana a mabolomo go ya le disekele. 5. Kgothaletsa bana ba bagolo gore ba tsenye dilo tse dingwe mo ditshwantshong tsa pente tse di tshwanang le letsatsi, bojang kgotsa dirurubele. 6. Letla ditshwantsho gore di ome o bo o di anega mo phaposing. 7. Oketsa thuto fa o ntse o dira ka go botsa dipotso.

source: Make sure you talk to the kids about what they’re drawing and painting and help them if they get stuck. You can ask them some of these questions: • How many flowers will you make? • What colours will your petals be? • Is your flower tall or short? • Where does it grow? • What do flowers need to grow? • What else can you tell me about your flowers?
tsn: Tlhomamisa gore o bua la bana kaga se ba se tshwantshang le se ba se pentang, mme o ba thuse fa ba palelwa. O ka ba botsa dipotso tse: • Le tlile go dira maboloko a le kae? • Matlapenyana a mabolomo a tlile go nna a mebala efe? • A lebolomo la gago le leleele kgotsa le lekhutshwane? • Le golela fa kae? • Ke mabolomo afe a o tshwanetseng go a jwala? • O ka mpolelelang ka ga mabolomo a gago?

source: This game develops:
tsn: Motshameko o o a tswelela:

source: ✔️Arm & Hand Control ✔️Talking & Understanding
tsn: ✔️Taolo ya lebogo le seatla ✔️Go bua le go tlhaloganya
