Repository: Ari-Ramkilowan/po-files
Catalog: translations/SGroup3(Release (open))_Pedi; Sepedi;  Northern Sotho.po
Languages: nso

source: On a rainy day, or if you’ve got a very physical Large group activity planned, why not have some Puzzle Fun? 🌧= 🖼
nso: Ka letšatši la pula, goba ge e ba o beakantše mošomo wo o nyakago maatla kudu wa sehlopha se segolo, le reng le sa be le papadi ya Boipshino ka Marara? 🌧= 🖼

source: You don’t even need to go buy puzzles, all you need is: 1. 3 homemade puzzles made from pictures in magazines (choose pictures that children enjoy). 2. Ensure that there are some easier puzzles for younger children, but not too easy.
nso: Ga go hlokege gore o ye go reka marara, tšeo o di hlokago ke: 1. Marara a 3 ao a dirilwego ka gae ka diswantšho tša ka dikgatišobakeng (kgetha diswantšho tšeo bana ba ipshinago ka tšona). 2. Kgonthiša gore go na le marara a bonolo a bana ba bannyane, eupša e sego a bonolo kudu.

source: Once you have your amazing, custom puzzles you can begin. 1. Choose easier puzzles for young children and give more difficult puzzles to older children. 2. Give each child a piece of a puzzle. 3. Ask them to put their pieces down so that everyone can see. 4. Then give them additional pieces, one by one. 5. Slowly help them arrange the pieces so that they can make the puzzle. 6. Talk about the picture. 7. Repeat with the other puzzles. 8. If you think they are able, mix up the 3 puzzles and see if they can sort them out, and build the 3 separate puzzles.
nso: Morago ga gore o be le marara a tlwaelo ao a makatšago, o ka thoma. 1. Kgethela bana ba bannyane marara a bonolo gomme o fe bana ba bagolo marara a bothata kudu. 2. Efa ngwana yo mongwe le yo mongwe karolo ya lerara. 3. Ba kgopele go bea dikarolwana tša bona fase gore mang le mang a di bone. 4. Morago ga moo, ba fe dikarolwana tša tlaleletšo, ka e tee ka e tee. 5. Ba thuše go beakanya dikarolwana ka go iketla gore ba kgone go dira marara. 6. Bolela mabapi le seswantšho. 7. Bušeletša ka go dira marara a mangwe. 8. Ge o lemogile gore ba a kgona, hlakanya marara a 3 gomme o bone ge e ba ba ka a hlopha, le go aga marara a 3 a go fapafapana.

source: See what you need
nso: Bona se o se hlokago

source: See how it works
nso: Bona ka moo e šomago ka gona

source: Read the notes
nso: Bala dinoutse

source: Back to menu
nso: Re boela morago go menyu

source: This game develops:
nso: Papadi ye e kaonafatša:

source: ✔️Exploring & Finding out ✔️Skills for Learning
nso: ✔️Go nyankolla le go utolla ✔️Bokgoni bja go ithuta

source: And because this game is to help develop the children’s thinking skills, ask some questions along the way. For the easier puzzles: • What do you think this picture is? • Where do you think this piece goes? While putting the puzzle together: • Tell me about this picture? • What can you see? • Is this an edge or a middle piece? If you mix all three puzzles: • What happens if we mix up the puzzles? • Who has this piece?
nso: Ka lebaka la gore papadi e nepile go thuša go kaonafatša bokgoni bja bana bja go nagana, ba botšiše dipotšišo ge ba tsene fase ka mošomo. Go marara a bonolo: • O nagana gore seswantšho se se bolela ka eng? • O nagana gore karolwana ye e tsena kae? Ge o le gare o bopa marara: • O ka mpotša eng mabapi le seswantšho se? • Naa o bona eng? • Naa karolo ye e tsena morumong goba bogareng? Ge o hlakanya marara ka moka a mararo: • Naa go direga eng ge re hlakanya marara? • Ke mang yo a nago le karolwana ye?
