Repository: Ari-Ramkilowan/po-files
Catalog: translations/SGroup6(Release (open))_Southern Sotho.po
Languages: sot

source: Read the notes
sot: Bala dinoutso

source: See what you need
sot: Sheba seo o se hlokang

source: See how it works
sot: Bona hore e sebetsa jwang

source: Back to menu
sot: Kgutlela ho menu

source: Find the budding scientists and engineers in the class with the game Making Tunnels. 👩🏿‍🔬👨🏿‍🔬
sot: Batla borasaense le baenjenere ba kamoso ka tlelaseng ka papadi ya Ho Etsa Dithanele. 👩🏿‍🔬👨🏿‍🔬

source: First you have to make the tunnel, then you show the children how it works. 🚇 1. Give each child 2 or 3 toilet rolls. 2. Help them to stick their toilet rolls together to make a long tunnel. 3. They can decorate their tunnel with paper and crayons if they want to. 4. Ask one of the children to hold the tunnel up straight. 5. Place a little bowl at the bottom of the tunnel to catch the stones. 6. Give other children stones and get them to ‘post’ the stones into the top of the tunnel. Use words like ‘up, down, through, top, bottom’ etc. 7. Allow older children to make more complex tunnels if they want to.
sot: Qala pele ka ho etsa thanele, mme ebe o bontsha bana hore e sebetsa jwang. 🚇 1. Nea ngwana ka mong dirolo tsa pampiri ya ntlwana tse 2 kapa 3. 2. Ba thuse ho kopanya dirolo tseo mmoho bakeng sa ho etsa thanele e telele. 3. Ba ka kgabisa thanele ya bona ka pampiri le dikerayone haeba ba batla. 4. Kopa e mong wa bana ho tshwara thanele e eme tsepa. 5. Bea sekotlolo se senyane ka tlasa thanele hore se tshware majwe. 6. Efa bana ba bang majwe mme o re ba ‘pose’ majwe ao ka hodimo ho thanele. Sebedisa mantswe a kang ‘hodimo, tlase, ka nqane, ka hodimo, ka tlase’ jj. 7. Dumella bana ba baholwanyane ho etsa dithanele tse thatanyana haeba ba batla.

source: ✔️Exploring & Finding Out ✔️Arm & hand control
sot: ✔️Ho sibolla le ho fumana ✔️Taolo ya sephaka le letsoho

source: Because you’re teaching kids about gravity, it’s a good idea to ask them lots of questions about how they think it works. ⚗ Easiest version • How tall is our tunnel? • How many toilet rolls have we used? More advanced version • What will happen to this stone? • Where will it land? • Whose turn is it now? For older children • Do it 10 times • How many times did it land in the bowl? • How many times did it NOT land in the bowl? • Tell me about your decoration.
sot: Ka hobane o ruta bana ka kerafiti, ke mohopolo o motle ho ba botsa dipotso tse ngata mabapi le kamoo ba nahang hore e sebetsang ka teng. ⚗ Mohato wa 1 • Thanele ya rona e bolelele bo bokae? • Re sebedisitse dirolo tsa pampiri ya ntlwana tse kae? Mohato wa 2 • Ho tla etsahala eng ka lejwe lee? • Le tla wela hokae? • Ke sebaka sa mang jwale? Mohato wa 3 • E etse makgetlo a 10 • Le wetse ka sekotlolong ka makgetlo a makae? • HA E a wela ka sekotlolong ka makgetlo a makae? • Mpolelle ka mekgabiso ya hao.

source: This game develops:
sot: Papadi ena e bopa:

source: This game is a fun way to combine crafts with learning, and let’s kids make their own toys. 1. Empty toilet rolls (2 per child) 2. Sticky tape 3. Stones 4. Paper (optional) 5. Crayons (optional)
sot: Papadi ena ke tsela e monate ya ho kopanya bonono le ho ithuta, mme e dumella bana ho iketsetsa dithoye. O tla hloka: 1. Ditshwari tsa pampiri ya ntlwana (tse 2 ngwana ka mong) 2. Theipi e kgomaretsang 3. Majwe 4. Pampiri (ke ya boikgethelo) 5. Dikerayone (ke tsa boikgethelo)
