Repository: Ari-Ramkilowan/po-files
Catalog: translations/SGroup15(Release (open))_South Ndebele.po
Languages: nbl

source: Read the notes
nbl: Funda amaAwathi

source: Back to menu
nbl: Buyela erhelweni

source: See what you need
nbl: Bona ukuthi utlhoga ini

source: See how it works
nbl: Bona ukuthi isebenza bunjani

source: ✔️Arm & hand control ✔️Talking & Understanding
nbl: ✔️Ukulawula umkhoAwa nesandla ✔️Ukukhuluma Awakuzwisisana

source: Have the kids given Pick it Up and Turn it Over a try yet?
nbl: Abantwana bayizamile i-Pick it Up ne Turn it Over?

source: This game develops:
nbl: Umdlalo lo uthuthukisa:

source: Running a bit low on ideas? Try giving the children some of these instructions: Level 1 Use the peg to… • Put the block up. • Put it behind you. • Turn it over. • Put it in front of you. • Put it in your other hand. Level 2 • Put it next to your knee. • Hold it high in the sky. • Put it in your pocket. • Put it under your shoe. • Walk around the room holding it. • Run around the room holding it above your head. Level 3 • Put it on your left hand side. • Put it on your right hand side. • Use the blocks to make the first letter of your name.
nbl: Sowuphelelwe miboAwa? Nikela abantwana lemiyalelo: Ileveli yoku - 1 Sebenzisa ipeksi uku… • Phakamisa amabhlogo. • Libeke ngemva kwakho. • Liphendule. • Libeke phambi kwakho. • Libeke kwesinye isandla. Ileveli Iyei - 2 • Libeke phambi kwedolo. • Liphakamisele emkayini. • Lifake esikhwameni. • Libeke phasi kwesicathulo. • Khamba khamba ulibambile. • Zombeleza ngekamureni ulibeke phezu kwehloko. Ileveli Iyei - 3 •Libe esandleni sokuncele. • Libeke esandleni sokudla. • Sebenzisa amabhlogo ukwenza iledere yokuthoma yebizo lakho..

source: You’ll only need two things before you can get going with this game: • Lego blocks • A clothing peg for each child
nbl: Uzakuthloga izinto ezimbili ngaphambi kokobana uragele phambili ngomdlalo lo: • Amabhlogo we - LEGO • Ipeksi linye umntwana ngamunye

source: Our future surgeons will need steady hands. 🏥 1. Give each child a peg. 2. Ask them to choose a block from the pile and pick it up with a peg. 3. Now ask them to put it down on the floor next to them. 4. Ask them to turn the block upside down using the peg. 5. Now ask them to put it behind the person sitting next to them using their peg. 6. Next, ask them to put it in the middle of the circle using the peg. 7. Continue with these kinds of instructions. 8. Keep instructions simple for younger children. 9. Make the instructions for the older kids more challenging. 10. Ask the older kids to give their own instructions to the group.
nbl: Abahlinzi bakusasa batlhoga izandla eziqinile. 🏥 1.Nikeza umntwana ngamunye ipeksi. 2.Babawe bakhethe ibhlogo bese bayiphakamisa ngepeksi. 3.Nje babawe kuthi bayibeka phasi duze nabo. 4.Babawe baliqalise phasi ngalo ipeksi. 5.Nje ke babawe balibeke ngemva komuntu ahlezi qadi kwakhe. 6.Okulandelako, babawe ukuthi balibeke ngaphakathi kwesiyingi basebenzisa ipeksi. 7.Ragela phambili ngayo imalayo le. 8.Yenza imilayo ibe lula ebantwaneni abancani. 9.Yenza imiyalo yabantwana abakhulu ibe budisana.. 10.Bawa abantwana abakhulu ukuthi banikele yabo imiyalelo esiqhemeni..
